{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_6", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "y1"}, "name": "y1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[0.3597677946090698, -0.40823841094970703, -0.31895318627357483, -0.05068623647093773, -0.09728764742612839, -0.05724464729428291, 0.18663355708122253, 0.2811194956302643, -0.0801260843873024, 0.0935094803571701, -0.12653030455112457, -0.13049772381782532, 0.05555231124162674, -0.02379092574119568, 0.014411449432373047, -0.30918627977371216, 0.20448333024978638, -0.013004817999899387, -0.05994941666722298, -0.020939601585268974, 0.020812921226024628, -0.05680617690086365, 0.19693979620933533, 0.12493861466646194, -0.18559984862804413, 0.16525110602378845, -0.2658750116825104, -0.06961807608604431, -0.250450074672699, -0.30992886424064636, -0.03883051127195358, -0.21891146898269653, -0.09259732067584991, -0.09947023540735245, 0.05573675408959389, 0.14107276499271393, -0.27941399812698364, -0.10514634847640991, -0.21730807423591614, -0.05109645798802376, 0.03919738903641701, -0.04405749589204788, -0.24164985120296478, -0.09738528728485107, -0.1512347161769867, -0.21033956110477448, -0.06763507425785065, -0.04274144023656845, -0.07354988902807236, -0.16933205723762512, -0.06228378787636757, -0.06462819874286652, -0.041333772242069244, -0.03224044293165207, -0.07008793205022812, 0.08870948851108551, 0.030364667996764183, -0.06403851509094238, 0.04833400994539261, 0.02538551203906536, 0.3731543719768524, -0.08354680985212326, 0.06801727414131165, 0.06496685743331909, 0.2889033555984497, -0.35631006956100464, -0.15395639836788177, 0.08038362115621567, 0.10592591017484665, 0.03413984179496765, -0.020501552149653435, 0.05466005206108093, 0.18089696764945984, 0.04640676826238632, -0.18304285407066345, -0.15654174983501434, -0.0454707145690918, 0.16781564056873322, 0.19269056618213654, -0.011764269322156906, 0.02531873621046543, 0.06032450497150421, 0.0761667862534523, 0.06494392454624176, -0.023594241589307785, 0.07124479860067368, 0.017321210354566574, 0.21756531298160553, -0.022589147090911865, -0.09209837764501572, -0.2054060995578766, -0.13906052708625793, -0.1896742433309555, -0.355587899684906, 0.01895686239004135, -0.007532611023634672, 0.05031776428222656, -0.19437813758850098, 0.08201537281274796, -0.02602577954530716, 0.03978845104575157, 0.177498921751976, 0.03753506392240524, -0.4402461647987366, 0.0036467034369707108, 0.18672719597816467, 0.08883021026849747, 0.1427774727344513, -0.1094459816813469, 0.1407262086868286, 0.14541855454444885, -0.11007022112607956, 0.1293143332004547, -0.046138450503349304, -0.2150612473487854, -0.20254990458488464, 0.14480143785476685, 0.12093325704336166, 0.09935679286718369, -0.06188387796282768, 0.08641591668128967, -0.2726530432701111, 0.018845142796635628, -0.1534556895494461, 0.353347510099411, 0.04547550156712532, 0.22037087380886078, 0.0756121352314949, -0.05168396234512329, -0.027919763699173927, 0.09240800142288208, -0.008195945993065834, -0.08664461970329285, -0.19583216309547424, 0.3117431104183197, -0.20588089525699615, -0.05915892496705055, -0.021019501611590385, -0.051223188638687134, 0.1460178792476654, -0.0906970426440239, 0.10252908617258072, -0.04567845165729523, -0.09985247254371643, -0.1254674792289734, -0.19172027707099915, 0.38166603446006775, -0.03807629272341728, 0.11490751802921295, 0.0027188195381313562, -0.2691722512245178, 0.06443982571363449, 0.035248611122369766, 0.08393894881010056, 0.2614145576953888, -0.09321731328964233, -0.11772169172763824, 0.013865496963262558, 0.2549724280834198, -0.31991544365882874, 0.20921902358531952, 0.0334957018494606, 0.10367709398269653, -0.23534925282001495, 0.0028084840159863234, -0.08016452193260193, -0.18711142241954803, -0.22786851227283478, -0.23765873908996582, -0.1819360852241516, -0.09931632876396179, -0.10189349949359894, 0.009377723559737206, -0.1610860377550125, 0.20307181775569916, -0.25310835242271423, -0.19116270542144775, -0.2774611711502075, -0.1250602900981903, -0.07372277230024338, -0.1188696101307869, -0.0308559350669384, -0.11938253045082092, -0.20412254333496094, 0.06670630723237991, 0.27440622448921204, 0.08704745769500732, -0.10083340108394623, 0.00042275837040506303, 0.09840278327465057, 0.1504025012254715, 0.07249712944030762, -0.12470515817403793, -0.044348906725645065, -0.07748790830373764, 0.046603646129369736, -0.051252126693725586, -0.20107050240039825, -0.12201635539531708, 0.008351446129381657, -0.024318575859069824, 0.06496132910251617, 0.01334165595471859, -0.14262263476848602, -0.015691693872213364, 0.10644053667783737, -0.10857003182172775, -0.014752713963389397, 0.03647128492593765, -0.24552859365940094, -0.026608742773532867, 0.07703875005245209, -0.01318328082561493, 0.03352811932563782, -0.0377822071313858, -0.08748827129602432, -0.076112762093544, -0.05735119432210922, -0.030181603506207466, 0.016372309997677803, -0.0009104070486500859, 0.005089651793241501, 0.06852690875530243, 0.10861597955226898, -0.10501767694950104, -0.023607192561030388, -0.1143399178981781, 0.11962644755840302, -0.13501054048538208, -0.05261990800499916, 0.018206605687737465, 0.16331899166107178, 0.17633771896362305, -0.018053481355309486, -0.0323486365377903, 0.03351973369717598, 0.124957375228405, -0.07697823643684387, 0.011098227463662624, -0.08491995930671692, 0.06555069983005524, -0.02841717191040516, 0.07251286506652832, 0.04756496474146843, 0.0008268732926808298, -0.014367658644914627, 0.22495140135288239, -0.19555401802062988, -0.0408904030919075, -0.0848507210612297, -0.02764074318110943, -0.1895165592432022, 0.01865193247795105, -0.025934923440217972, -0.002757640089839697, 0.009334374219179153, 0.12996284663677216, -0.019042253494262695, -0.06434999406337738, 0.030208135023713112, 0.09669606387615204, 0.04415809363126755, 0.02254357747733593, 0.11451677978038788, -0.018036935478448868, -0.06797748804092407, -0.12191060185432434, 0.12828557193279266, 0.0813889354467392, 0.18595649302005768, 0.10981234908103943, -0.025843849405646324, 0.11233382672071457, -0.22210519015789032, 0.13588102161884308, -0.018055740743875504, -0.06902047246694565, -0.13284584879875183, -0.12480197846889496, -0.07561171054840088, -0.017274536192417145, -0.10674996674060822, -0.024308137595653534, 0.1316569298505783, 0.06729574501514435, 0.10376953333616257, 0.019285280257463455, 0.02597849816083908, -0.014270758256316185, 0.06408216804265976, 0.019358519464731216, -0.15189862251281738, -0.014083648100495338, -0.13709786534309387, 0.006613083649426699, 0.03345859423279762, -0.042163219302892685, -0.05574113130569458, -0.01510966382920742, 0.00878574326634407], [0.05640541389584541, -0.02227720618247986, 0.18282665312290192, -0.5283353328704834, -0.1717662811279297, 0.31366950273513794, 0.06930161267518997, 0.030283816158771515, -0.3389490842819214, 0.0012794092763215303, -0.046917278319597244, 0.15258927643299103, -0.18117189407348633, -0.059493958950042725, 0.18384268879890442, 0.04485136270523071, 0.2649219036102295, -0.17540669441223145, 0.14823627471923828, -0.029540320858359337, 0.12377458810806274, -0.17762263119220734, 0.07270906120538712, -0.2791462242603302, -0.11656048893928528, -0.1110440343618393, -0.074489526450634, -0.14976800978183746, 0.03818833455443382, 0.41302087903022766, 0.08510029315948486, 0.25644052028656006, -0.11013705283403397, -0.03854170814156532, -0.2859845459461212, 0.013289744965732098, -0.18103159964084625, 0.042020827531814575, -0.11006959527730942, -0.16584599018096924, -0.3275924026966095, 0.0006770467734895647, -0.03367019072175026, -0.24926353991031647, -0.16007257997989655, -0.12438823282718658, 0.17320354282855988, -0.07412894815206528, 0.31997761130332947, 0.010790118016302586, -0.31180551648139954, 0.050300031900405884, 0.30979490280151367, 0.0457344725728035, 0.007867373526096344, 0.19410406053066254, 0.026944728568196297, 0.06913065165281296, -0.2281559258699417, 0.017612747848033905, -0.22702346742153168, 0.2847577631473541, -0.0654120221734047, 0.008583838120102882, 0.34619179368019104, -0.17196442186832428, 0.13556258380413055, -0.04720931500196457, -0.07522395998239517, 0.3157661259174347, 0.013192258775234222, -0.06443098932504654, 0.2905750572681427, -0.12789064645767212, -0.012132595293223858, -0.08287069946527481, 0.07765552401542664, -0.28478896617889404, -0.14131197333335876, -0.22022438049316406, 0.0417887344956398, -0.06658445298671722, -0.1261330395936966, 0.26604607701301575, -0.07187965512275696, -0.009249803610146046, 0.26799577474594116, 0.1278030127286911, 0.10265307128429413, 0.12066382169723511, -0.25915002822875977, -0.06408084183931351, -0.12317036837339401, -0.2983908951282501, 0.05662854015827179, 0.031086497008800507, 0.07983725517988205, 0.08543713390827179, -0.21317240595817566, 0.3109227120876312, -0.19178198277950287, -0.20173917710781097, -0.19707301259040833, 0.026203053072094917, -0.2774679362773895, -0.0712946280837059, -0.03799431398510933, -0.13903388381004333, -0.00796648021787405, 0.016076024621725082, 0.022616738453507423, -0.1408609002828598, -0.07528015226125717, 0.02271946705877781, 0.21109682321548462, 0.025411000475287437, -0.042052093893289566, 0.08376532793045044, 0.07671783864498138, 9.300559759140015e-05, -0.09943928569555283, -0.08675777167081833, 0.14474864304065704, -0.13006311655044556, -0.14567114412784576, -0.2388887256383896, 0.005681917537003756, -0.06170312687754631, -0.36461302638053894, -0.05211174488067627, -0.1251484602689743, -0.017620965838432312, -0.019906269386410713, -0.07475919276475906, -0.085459865629673, -0.09713645279407501, -0.2103966325521469, 0.0017390410648658872, -0.17750908434391022, -0.056653834879398346, -0.012008651159703732, -0.1335405856370926, -0.17085109651088715, -0.04560894891619682, -0.2783680558204651, 0.05789374187588692, -0.058902498334646225, -0.2002287358045578, -0.3381849229335785, 0.0716337114572525, -0.13144145905971527, -0.23955105245113373, -0.12380176037549973, -0.023367421701550484, -0.23338697850704193, -0.16619157791137695, 0.07345893979072571, 0.010372178629040718, -0.07346244901418686, -0.19850555062294006, -0.19869855046272278, -0.0820329338312149, -0.08894811570644379, -0.109074667096138, -0.28168708086013794, 0.11494672298431396, -0.16458317637443542, 0.03372085094451904, 0.1389201432466507, 0.14828121662139893, -0.2621519863605499, -0.12915831804275513, 0.10421343147754669, 0.2706281542778015, 0.006965018808841705, -0.2038024663925171, -0.20757447183132172, -0.22471244633197784, -0.08711101114749908, -0.06858187913894653, -0.1143895611166954, -0.15947462618350983, 0.012282608076930046, -0.20179086923599243, -0.17357288300991058, -0.03850899636745453, -0.3955283463001251, -0.030532430857419968, -0.3392811119556427, 0.011086305603384972, -0.08119481056928635, -0.1802573949098587, 0.21169160306453705, 0.13246627151966095, -0.011951128020882607, -0.24139562249183655, -0.016443569213151932, -0.03426053747534752, -0.11113433539867401, 0.1595080941915512, -0.007413709536194801, -0.10694855451583862, 0.10590852051973343, 0.015490789897739887, -0.11307241767644882, 0.05737093463540077, -0.06579026579856873, -0.09393078088760376, -0.08874203264713287, 0.06873176246881485, -0.03391740098595619, -0.028155894950032234, 0.025575967505574226, 0.15239255130290985, -0.2143722027540207, 0.05986751988530159, 0.026139982044696808, 0.0645260289311409, -0.1281605362892151, -0.02280784770846367, 0.03801163285970688, 0.10443184524774551, -0.0274043045938015, -0.017485547810792923, 0.013715997338294983, 0.0015685524558648467, -0.0011895133648067713, -0.07140393555164337, -0.059473469853401184, 0.1379823386669159, 0.030806943774223328, -0.08498992025852203, 0.03517717123031616, -0.010214745998382568, 0.18584591150283813, -0.05598629266023636, -0.021048402413725853, -0.20633326470851898, 0.18086953461170197, -0.044310737401247025, -0.09885594993829727, 0.14727279543876648, -0.09246701747179031, -0.1101776510477066, 0.061062026768922806, 0.018213137984275818, 0.08764105290174484, -0.04362614080309868, -0.03284183517098427, -0.09294982999563217, -0.008809694088995457, 0.009474136866629124, 0.07228472828865051, -0.0031432765536010265, -0.03595474362373352, 0.0003766431473195553, -0.04567334055900574, -0.03735708072781563, 0.07912243902683258, 0.034529540687799454, 0.03302802890539169, -0.037947531789541245, -0.061012353748083115, 0.017996221780776978, 0.0007363257464021444, -0.14822661876678467, -0.1598495990037918, -0.18578892946243286, 0.0332743339240551, 0.062413670122623444, 0.08143122494220734, 0.09106098860502243, -0.08669539541006088, 0.0829247534275055, 0.06677756458520889, -0.04785190522670746, -0.06714344024658203, 0.01953904889523983, -0.010039176791906357, -0.1711859256029129, 0.06138859689235687, -0.09630356729030609, 0.15023784339427948, -0.039270710200071335, 0.15482765436172485, 0.18079589307308197, 0.0382002629339695, -0.06477601826190948, -0.11513698101043701, 0.10822834074497223, -0.09259742498397827, -0.141909658908844, -0.08885645866394043, 0.07622864097356796, 0.06943424046039581, 0.15660198032855988, -0.015714120119810104, 0.04546620696783066, -0.06550994515419006, 0.08395248651504517], [-0.03929378464818001, 0.0035992769990116358, 0.016051597893238068, 0.17087823152542114, 0.22267043590545654, -0.09378036856651306, -0.08103355765342712, 0.003188495058566332, 0.18572407960891724, -0.023588648065924644, 0.3039354383945465, 0.07097318023443222, -0.1398123800754547, -0.12312333285808563, -0.1771743893623352, 0.16125410795211792, -0.19263103604316711, -0.21879678964614868, 0.1067887619137764, -0.1835145503282547, 0.02533842995762825, -0.1467525064945221, -0.11484503746032715, 0.04140566661953926, -0.21525411307811737, 0.18914884328842163, -0.03631255030632019, 0.06478539109230042, 0.03230633959174156, 0.02901301719248295, 0.10237453132867813, 0.13773474097251892, -0.31510794162750244, -0.19025295972824097, 0.16157618165016174, 0.08605083078145981, 0.0840122252702713, 0.17641834914684296, 0.037007179111242294, -0.164510577917099, 0.2219400852918625, 0.055869393050670624, 0.021695157513022423, 0.07149264216423035, -0.12311975657939911, -0.21424157917499542, -0.04285810887813568, -0.24713706970214844, -0.298881471157074, -0.07775413244962692, 0.22201500833034515, 0.04481394588947296, -0.18709330260753632, -0.11821068823337555, 0.1263677477836609, -0.08450445532798767, 0.11186699569225311, -0.19631631672382355, 0.005588442087173462, -0.10132365673780441, 0.23367740213871002, 0.06338474899530411, -0.26586470007896423, -0.1271149069070816, 0.026646852493286133, -0.02069167234003544, -0.1392703503370285, 0.003755629761144519, -0.09850253164768219, 0.04634459316730499, -0.21140156686306, -0.21858619153499603, 0.1300714761018753, 0.24426138401031494, 0.18537381291389465, -0.2401675134897232, -0.009571991860866547, 0.07060636579990387, 0.20385509729385376, 0.08245886862277985, -0.043577976524829865, 0.09753719717264175, 0.025288837030529976, 0.030379317700862885, -0.020399171859025955, 0.4439737796783447, -0.0525834895670414, -0.15403082966804504, -0.10324113070964813, -0.4528939127922058, 0.10346119850873947, 0.12808449566364288, 0.12868349254131317, 0.24121423065662384, -0.2836514711380005, 0.02454616315662861, -0.01960032433271408, 0.0327409990131855, -0.045041657984256744, -0.1588178128004074, 0.1533232033252716, -0.20522987842559814, 0.2656095623970032, -0.05538389831781387, 0.06651043891906738, 0.18549631536006927, -0.0960879996418953, -0.1424117386341095, -0.011591912247240543, -0.028555143624544144, 0.14910279214382172, 0.12771329283714294, 0.11467398703098297, -0.13696694374084473, -0.17489159107208252, -0.1572381556034088, -0.07355409115552902, -0.17020472884178162, -0.03506914898753166, -0.09140168875455856, 0.02735188603401184, -0.07271117717027664, 0.0012605497613549232, 0.2179347574710846, -0.16305311024188995, -0.2388664335012436, 0.16078580915927887, -0.03560055419802666, -0.15684372186660767, 0.11717955768108368, 0.1293296217918396, -0.17884249985218048, -0.14095738530158997, -0.11742186546325684, -0.21995049715042114, -0.12577129900455475, -0.3881853222846985, -0.02221549116075039, -0.1103120967745781, -0.226859912276268, 0.31115421652793884, -0.1263611763715744, -0.23457695543766022, -0.2054826021194458, -0.03827371075749397, 0.17943060398101807, -0.01997789926826954, 0.010108036920428276, 0.11375937610864639, 0.29149845242500305, -0.09467054158449173, -0.1570100039243698, -0.07989298552274704, -0.05811775475740433, 0.03729711100459099, -0.05371472239494324, -0.15154388546943665, -0.16859258711338043, -0.2303369790315628, 0.13284538686275482, -0.21147321164608002, -0.13005967438220978, -0.14268656075000763, -0.200826957821846, -0.008504536934196949, -0.039401959627866745, -0.20887085795402527, -0.1689964383840561, -0.06977715343236923, 0.0471918024122715, -0.10904308408498764, -0.13254393637180328, -0.11735667288303375, 0.08318814635276794, -0.041671570390462875, -0.20991387963294983, 0.1345340609550476, -0.2955174744129181, 0.06304202973842621, -0.3210281729698181, -0.16611887514591217, 0.13540790975093842, -0.06177222356200218, 0.05520334467291832, 0.0707470253109932, 0.08251858502626419, 0.16480910778045654, -0.09651685506105423, 0.1573784202337265, -0.026043370366096497, -0.17077980935573578, -0.2908329665660858, 0.09759046882390976, 0.2194121778011322, 0.062492139637470245, -0.1619170904159546, -0.055326659232378006, 0.07520265132188797, 0.08748576045036316, -0.08038946241140366, -0.09591909497976303, 0.22539764642715454, -0.03643205389380455, -0.0649057999253273, 0.013965929858386517, -0.060812126845121384, 0.1349448710680008, -0.07665156573057175, 0.18727520108222961, 0.03452053666114807, 0.03964075818657875, -0.036062173545360565, 0.09837310016155243, -0.053833723068237305, 0.059776827692985535, 0.12032778561115265, -0.04193194583058357, -0.24377739429473877, -0.023852037265896797, -0.04886329546570778, 0.035074904561042786, 0.1577671617269516, -0.07431763410568237, 0.03691018372774124, -0.10509242862462997, -0.045687634497880936, 0.05334460362792015, -0.13764721155166626, 0.04275478422641754, 0.1050681322813034, 0.18032056093215942, -0.007707178592681885, 0.08554993569850922, -0.20358476042747498, -0.03393137827515602, 0.1440887749195099, 0.006094479467719793, 0.11647719889879227, 0.08972983062267303, 0.05039224028587341, -0.12132216989994049, 0.014060672372579575, -0.08839152008295059, -0.12376781553030014, -0.18317705392837524, 0.09368056058883667, 0.04776329919695854, -0.05064072087407112, -0.04091993346810341, -0.024898460134863853, 0.060314953327178955, -0.052716076374053955, 0.0816589891910553, 0.054896850138902664, -0.13016590476036072, -0.17132005095481873, 0.10284940153360367, -0.09922388941049576, -0.02120298519730568, -0.07999179512262344, -0.07663286477327347, 0.22668956220149994, -0.0027406502049416304, -0.02066366747021675, -0.06766578555107117, -0.1852145940065384, 0.11153843998908997, -0.025398075580596924, 0.11048102378845215, 0.012955931015312672, -0.11367589980363846, -0.08027810603380203, 0.10556237399578094, 0.04289419203996658, -0.025834592059254646, -0.14166070520877838, 0.07354514300823212, -0.015301298350095749, 0.21358448266983032, -0.040372565388679504, -0.1573864072561264, -0.09936100244522095, -0.1895950734615326, 0.09775816649198532, 0.01605515368282795, 0.008023145608603954, 0.047330982983112335, 0.029606861993670464, -0.05258360505104065, -0.2586319148540497, 0.25971516966819763, 0.04720529913902283, -0.04078783467411995, 0.023664668202400208, -0.031091036275029182, 0.0198225025087595, -0.051861513406038284, -0.001988726668059826, 0.015184265561401844, -0.04543882608413696], [0.048653703182935715, -0.3779730200767517, -0.11582843959331512, -0.17150676250457764, 0.0934615209698677, -0.25719520449638367, 0.02017035521566868, 0.1340838074684143, 0.06705645471811295, 0.003583861980587244, 0.01056966744363308, -0.2389962375164032, -0.27025312185287476, -0.07173774391412735, 0.04946121945977211, -0.09188780188560486, 0.04040999710559845, -0.28398948907852173, 0.07289543747901917, -0.3559172451496124, -0.03512674197554588, 0.167663112282753, -0.0617549903690815, -0.0017139648552984, -0.22715593874454498, -0.12517917156219482, -0.3781777620315552, -0.27505022287368774, -0.08542606234550476, 0.3113451600074768, 0.08383714407682419, 0.26486527919769287, -0.39021968841552734, 0.24064648151397705, -0.06620189547538757, -0.21668775379657745, -0.24524471163749695, 0.04948795959353447, 0.12919454276561737, 0.37391597032546997, -0.2713701128959656, -0.2415986806154251, -0.07757420092821121, 0.05077771842479706, -0.1012788861989975, -0.06915935128927231, 0.20111599564552307, -0.10930947214365005, -0.09551545977592468, 0.13935543596744537, -0.10254088044166565, -0.11632326245307922, 0.34476837515830994, -0.164062961935997, -0.24563944339752197, 0.23664945363998413, 0.026526369154453278, -0.06586460769176483, -0.010663582943379879, 0.07674799859523773, -0.009250149130821228, 0.0025417692959308624, 0.09347104281187057, -0.27384620904922485, 0.1710110306739807, -0.42112651467323303, 0.1123933494091034, 0.015574264340102673, -0.04046715050935745, 0.2809670865535736, -0.027147343382239342, -0.09016825258731842, 0.20945410430431366, -0.1072663813829422, -0.022254036739468575, -0.011504941619932652, -0.09468796104192734, -0.2246655523777008, -0.11172947287559509, -0.10976918041706085, 0.16051624715328217, -0.3246622383594513, -0.28385886549949646, 0.17646493017673492, -0.12350300699472427, 0.1208813339471817, -0.1255195587873459, 0.15882554650306702, -0.19714811444282532, -0.01901211030781269, -0.13428428769111633, 0.4948803186416626, -0.1873362958431244, -0.16883613169193268, -0.12557421624660492, 0.17682093381881714, 0.3098617494106293, -0.056251779198646545, 0.09885125607252121, -0.1429867148399353, -0.002018596278503537, -0.058217547833919525, -0.17316052317619324, -0.31978359818458557, -0.4183102250099182, 0.1565098762512207, -0.01598474197089672, -0.12365197390317917, 0.06405545026063919, -0.011342457495629787, 0.15533456206321716, -0.04442515969276428, -0.057218585163354874, -0.10519327223300934, -0.129933163523674, -0.17575505375862122, 0.1948968917131424, 0.12683528661727905, 0.07720702141523361, -0.1116248220205307, -0.01037398912012577, -0.040983427315950394, 0.3726469576358795, -0.08397827297449112, 0.08489159494638443, -0.2510922849178314, -0.03926051780581474, -0.056399088352918625, -0.28529641032218933, 0.004004396498203278, -0.019224043935537338, -0.11203999817371368, -0.08101490139961243, -0.1639612913131714, -0.21957014501094818, -0.20560936629772186, -0.08614857494831085, -0.2869296371936798, -0.30732646584510803, -0.11676311492919922, -0.22863425314426422, -0.05598512664437294, -0.06134120002388954, -0.10489003360271454, -0.2750212252140045, 0.013732457533478737, -0.0328839048743248, -0.23917309939861298, -0.3538345992565155, 0.006894704420119524, -0.40453317761421204, -0.1502213180065155, 0.09694759547710419, -0.21642056107521057, -0.319573312997818, 0.19984425604343414, -0.12029644101858139, -0.11234692484140396, -0.17956002056598663, -0.16600266098976135, -0.22841472923755646, -0.16596566140651703, -0.2785837650299072, 0.003991132602095604, 0.047388751059770584, 0.08629010617733002, -0.05144241079688072, -0.18547017872333527, -0.1228376030921936, 0.14109767973423004, -0.27537479996681213, -0.07662805914878845, -0.07058797031641006, 0.10778935998678207, -0.14370572566986084, -0.13948844373226166, -0.051678482443094254, -0.4297725558280945, -0.46035510301589966, -0.37796053290367126, -0.06945500522851944, -0.06429965049028397, -0.1326901763677597, 0.15341779589653015, 0.029323432594537735, 0.09242376685142517, 0.014110381714999676, 0.1391245424747467, -0.07368729263544083, -0.06644389778375626, -0.10247168689966202, -0.23756247758865356, -0.016661345958709717, -0.019711226224899292, 0.16014786064624786, -0.4782988131046295, -0.23989787697792053, 0.006861703936010599, -0.27792659401893616, -0.010508445091545582, 0.02592986263334751, 0.12947669625282288, -0.025355001911520958, -0.003186863614246249, -0.15143097937107086, 0.10452952980995178, 0.07016000896692276, -0.015005200169980526, 0.022384973242878914, -0.17564359307289124, 0.029547063633799553, 0.136106476187706, -0.059197936207056046, 0.01602233573794365, -0.12847070395946503, -0.11133365333080292, -0.10521101206541061, 0.1152823194861412, -0.0360264889895916, -0.05051637813448906, 0.041106536984443665, -0.3254888653755188, 0.008936898782849312, -0.009143807925283909, -0.058147914707660675, -0.14623872935771942, -0.05696287378668785, 0.09326126426458359, 0.06188960373401642, 0.05627993121743202, -0.0011782459914684296, -0.18199984729290009, -0.08358628302812576, 0.19044701755046844, -0.07745228707790375, 0.1632910668849945, -0.05511549115180969, -0.014743265695869923, 0.027338892221450806, -0.11832983046770096, -0.05516445264220238, 0.07104700803756714, -0.0789913684129715, 0.117162324488163, -0.01476198434829712, 0.10676919668912888, -0.07290653139352798, 0.00999546516686678, -0.0414094403386116, -0.019956346601247787, 0.04935264214873314, -0.01932271383702755, -0.04192040115594864, 0.12074022740125656, -0.011016140691936016, 0.02719137631356716, 0.040787942707538605, -0.09440086781978607, 0.03869735449552536, 0.11460509896278381, -0.11574138700962067, 0.2076665163040161, -0.08105838298797607, 0.03251520171761513, 0.046318162232637405, 0.2339530736207962, 0.12754908204078674, -0.2277391105890274, -0.05273105204105377, -0.08849973231554031, 0.13954131305217743, 0.07444736361503601, -0.01951385661959648, 0.05792907997965813, -0.07003950327634811, -0.008916430175304413, 0.04007751867175102, -0.07168968766927719, 0.0008933059289120138, 0.12293849885463715, -0.010427461005747318, -0.0805593729019165, -0.018798144534230232, -0.05538827180862427, -0.0035448940470814705, 0.10165487229824066, 0.001365694566629827, 0.012062257155776024, -0.11721079796552658, -0.015177762135863304, 0.06893124431371689, -0.0027261546347290277, 0.04661835357546806, -0.07739123702049255, 0.013772619888186455, 0.014612004160881042, -0.01586320251226425, -0.0034282871056348085, 0.017175685614347458, 0.12058290839195251], [-0.07324304431676865, -0.06091783195734024, 0.07431434094905853, -0.10436119884252548, -0.13646598160266876, -0.04114190489053726, 0.13011597096920013, -0.18057294189929962, -0.13807904720306396, -0.0877818614244461, 0.24392160773277283, -0.04172642529010773, -0.03581039980053902, -0.07188519835472107, -0.04674384370446205, -0.14277957379817963, 0.10271671414375305, -0.09932439774274826, 0.010853160172700882, -0.003764655441045761, -0.20227757096290588, 0.11488441377878189, -0.08153742551803589, -0.12147793918848038, -0.0046663363464176655, -0.13473491370677948, -0.12679123878479004, -0.07777217775583267, -0.26391297578811646, -0.13225318491458893, -0.09412636607885361, -0.086821548640728, -0.46789243817329407, -0.0681612566113472, -0.14858494699001312, -0.10285275429487228, -0.3225000202655792, -0.29633986949920654, 0.03546537086367607, 0.1422928124666214, -0.0944765955209732, -0.0938296914100647, -0.22325289249420166, -0.1893390417098999, 0.0014680696185678244, -0.1924750953912735, -0.022317945957183838, -0.30407920479774475, -0.06664765626192093, -0.13810372352600098, -0.05469309911131859, -0.21152865886688232, -0.03702952340245247, -0.26298069953918457, 0.06877297908067703, 0.08846437931060791, -0.24303092062473297, -0.26689279079437256, -0.023261241614818573, 0.0538652278482914, 0.17163535952568054, -0.35375407338142395, -0.29825615882873535, 0.11751081049442291, 0.1426990032196045, -0.1261383593082428, -0.04379726201295853, -0.26653528213500977, -0.6191559433937073, -0.07457767426967621, 0.08107107877731323, -0.047826655209064484, 0.017640935257077217, -0.28219667077064514, -0.197082981467247, -0.16328652203083038, -0.23114529252052307, 0.034810155630111694, -0.3892998695373535, -0.12331794947385788, -0.30660244822502136, -0.0831930860877037, -0.0648062452673912, 0.22266645729541779, -0.08284603804349899, 0.2003471851348877, -0.06254255026578903, 0.2062976211309433, -0.19887864589691162, -0.042981069535017014, -0.20402774214744568, -0.06003071367740631, -0.11629529297351837, -0.029913030564785004, 0.11539282649755478, 0.051457904279232025, 0.12245598435401917, 0.03642704337835312, -0.009630546905100346, -0.20578864216804504, -0.25718313455581665, -0.09233525395393372, -0.25040191411972046, -0.203788161277771, -0.06529030203819275, -0.1271483302116394, 0.07416657358407974, -0.13668611645698547, 0.058022014796733856, -0.13981996476650238, 0.06954649090766907, -0.16817693412303925, -0.14810870587825775, 0.06574613600969315, 0.023492710664868355, 0.0730811059474945, 0.05001712590456009, -0.06714637577533722, 0.06086667627096176, 0.10332219302654266, 0.01347794197499752, -0.1553114354610443, 0.1577768176794052, -0.18905970454216003, -0.061083536595106125, -0.10735002905130386, -0.10206978768110275, -0.4257968068122864, -0.057667963206768036, 0.1538534015417099, -0.07213989645242691, -0.06520976126194, -0.1650783121585846, -0.13001935184001923, 0.2263362854719162, -0.16598688066005707, -0.0342407263815403, -0.011813677847385406, -0.11282072216272354, 0.010296770371496677, -0.07246313244104385, -0.13207320868968964, -0.14598967134952545, 0.017425142228603363, -0.24892742931842804, -0.24132759869098663, -0.06722494959831238, -0.208244189620018, -0.30982568860054016, 0.09374438971281052, -0.2891622483730316, -0.31183409690856934, -0.11116369813680649, -0.20491714775562286, -0.002093544229865074, 0.05054305121302605, -0.349642276763916, -0.20158061385154724, -0.30831044912338257, -0.06706493347883224, -0.09524395316839218, -0.24088536202907562, -0.15803518891334534, -0.03436650335788727, -0.04824500158429146, -0.09256408363580704, -0.1573677510023117, -0.1373583823442459, 0.03263579308986664, -0.06198246404528618, -0.03386763483285904, -0.20310454070568085, -0.04536811262369156, 0.1459256410598755, 0.0027508216444402933, -0.13992708921432495, 0.059757065027952194, -0.18530693650245667, -0.23082272708415985, -0.19023267924785614, -0.076849065721035, -0.013708681799471378, 0.028385275974869728, -0.03780302777886391, -0.20675159990787506, 0.02889520674943924, -0.10583815723657608, -0.04107885807752609, 0.0490095429122448, -0.0031289185862988234, -0.3454742729663849, -0.17191562056541443, -0.131915882229805, -0.027248628437519073, 0.13551326096057892, -0.16852453351020813, -0.2539350390434265, 0.02104353718459606, -0.01668405719101429, 0.05443967133760452, -0.026329966261982918, -0.006050439085811377, 0.108151376247406, -0.150415301322937, -0.15594860911369324, 0.021817239001393318, 0.1329706311225891, 0.06171779707074165, -0.04184048995375633, 0.044631022959947586, -0.04775291681289673, 0.10779085755348206, -0.04141261801123619, -0.10033054649829865, 0.059175748378038406, 0.14121656119823456, -0.04318512976169586, -0.019097134470939636, 0.024487104266881943, -0.08662617206573486, 0.04215223342180252, -0.0058438703417778015, 0.08350246399641037, 0.043597567826509476, -0.255655437707901, 0.010967906564474106, -0.153010755777359, 0.03457318991422653, 0.06318380683660507, 0.04161131754517555, 0.010302969254553318, -0.038532815873622894, -0.25109538435935974, 0.0006911073578521609, -0.15375754237174988, 0.0026976384688168764, -0.05015786364674568, -0.05954045057296753, 0.019266514107584953, 0.050621990114450455, 0.029129186645150185, 0.06791873276233673, -0.05462783947587013, 0.043613534420728683, -0.010558010078966618, -0.10728750377893448, -0.11223047226667404, 0.05124197527766228, 0.15115287899971008, -0.026468586176633835, 0.023107009008526802, 0.011804647743701935, -0.08574219793081284, -0.191399484872818, -0.03946869820356369, 0.29409724473953247, -0.31627777218818665, 0.4251239001750946, -0.040127385407686234, 0.06538494676351547, -0.1548682302236557, -0.06258547306060791, 0.0051939040422439575, -0.04298851639032364, 0.007999458350241184, -0.02797064743936062, 0.052828624844551086, -0.07267662137746811, -0.0008424650295637548, -0.056512024253606796, -0.06800008565187454, -0.007371547166258097, -0.10412825644016266, -0.03950398415327072, -0.08795276284217834, -0.040797509253025055, 0.08153314888477325, 0.024243947118520737, 0.09071070700883865, -0.09450586140155792, 0.1378246396780014, -0.1430789679288864, -0.011334638111293316, 0.014506235718727112, -0.10909712314605713, -0.00542590394616127, -0.054097164422273636, -0.10007109493017197, 0.03825061395764351, -0.068227119743824, -0.013417940586805344, -0.060064662247896194, -0.029770752415060997, 0.02085714228451252, 0.01627417467534542, -0.09589993208646774, -0.03876763954758644, -0.12933313846588135, 0.028308946639299393, -0.03064795210957527], [-0.2595663070678711, -0.005295468959957361, 0.17701642215251923, 0.15505097806453705, 0.16553649306297302, 0.031971219927072525, -0.22050902247428894, -0.1266283541917801, -0.005580445285886526, -0.17269420623779297, -0.1522020399570465, 0.10148116201162338, 0.10225679725408554, 0.01907624676823616, 0.023621035739779472, -0.009106899611651897, 0.17386332154273987, -0.002867085626348853, 0.07424191385507584, 0.2568836808204651, 0.06055334210395813, 0.057272668927907944, 0.16949307918548584, -0.01850011758506298, 0.22906117141246796, -0.15116985142230988, 0.1350572407245636, 0.0634189248085022, 0.23137061297893524, 0.033025436103343964, 0.03544517979025841, 0.14537987112998962, -0.014971679076552391, -0.10588507354259491, -0.010338906198740005, 0.00039882748387753963, 0.37549951672554016, 0.224061980843544, 0.36434489488601685, 0.0013667556922882795, -0.12265496701002121, -0.13763175904750824, 0.06642038375139236, 0.07817432284355164, 0.19611160457134247, 0.16712376475334167, -0.1485561579465866, 0.08533591777086258, 0.0602593868970871, 0.15073402225971222, 0.15008266270160675, 0.20250526070594788, 0.06397341936826706, 0.09657181054353714, -0.19650699198246002, -0.11613038927316666, 0.14332690834999084, -0.10668103396892548, 0.0885656550526619, -0.10302892327308655, -0.0737973004579544, 0.1237589493393898, 0.24214623868465424, -0.283415287733078, -0.10573243349790573, 0.048451345413923264, 0.13629813492298126, -0.06272441148757935, 0.10212454944849014, 0.047001343220472336, -0.195282444357872, -0.09685317426919937, -0.16092844307422638, 0.08853814005851746, -0.21085971593856812, -0.06332523375749588, 0.04497598111629486, -0.07222488522529602, -0.13753290474414825, 0.07409834116697311, -0.07293781638145447, 0.011054648086428642, -0.1389826238155365, 0.0032235507387667894, -0.0021775190252810717, -0.059452153742313385, 0.1730080097913742, -0.28446245193481445, -0.19825801253318787, 0.10428859293460846, -0.018431300297379494, 0.19424548745155334, -0.11073698103427887, -0.034440815448760986, -0.18496371805667877, -0.076075978577137, -0.107671819627285, 0.19759540259838104, 0.051537610590457916, 0.04894222691655159, 0.17576637864112854, -0.023348871618509293, 0.09313591569662094, 0.28164806962013245, -0.048216842114925385, -0.11789774149656296, -0.04733898118138313, -0.1159883514046669, -0.13833341002464294, 0.27949947118759155, -0.012656394392251968, -0.07333403080701828, -0.0248876940459013, 0.002541561145335436, -0.1954295039176941, 0.05105939134955406, -0.16395917534828186, -0.19896376132965088, 0.1710667908191681, -0.023581597954034805, 0.0483274906873703, 0.4528595507144928, -0.20307116210460663, 0.216978520154953, 0.007226759567856789, -0.0096115218475461, 0.18440532684326172, 0.10724899172782898, 0.0280588511377573, 0.0065263407304883, -0.07554085552692413, 0.03389303386211395, 0.1276398003101349, 0.20420901477336884, -0.1798170804977417, 0.07062294334173203, -0.20523647964000702, -0.03479031100869179, 0.047112032771110535, -0.28706827759742737, 0.30966275930404663, 0.057477422058582306, 0.019210368394851685, 0.15011811256408691, 0.13228701055049896, 0.07623808830976486, 0.07112279534339905, 0.08835463225841522, 0.06408347934484482, -0.28321224451065063, 0.1829071044921875, 0.2967311441898346, 0.16152040660381317, 0.12261837720870972, -0.18015067279338837, -0.03511562570929527, 0.10645688325166702, 0.24858668446540833, 0.05137409269809723, 0.25844913721084595, -0.2591206431388855, -0.1590987592935562, 0.17175839841365814, 0.1269422173500061, 0.10419561713933945, 0.010514515452086926, 0.19663287699222565, 0.011741986498236656, -0.06612265110015869, 0.04082345962524414, -0.16808542609214783, -0.12303411960601807, -0.009146288968622684, -0.17785629630088806, -0.23151454329490662, -0.02311566472053528, 0.13193963468074799, 0.03601621091365814, 0.2940046191215515, -0.06126993149518967, -0.06188080087304115, 0.2847766578197479, 0.15766485035419464, 0.1773899346590042, 0.1573316752910614, 0.02659071423113346, 0.06207798793911934, 0.09716637432575226, -0.02333221398293972, 0.03884480148553848, 0.12582366168498993, 0.0777946412563324, 0.1298181265592575, -0.11258607357740402, -0.0017112146597355604, 0.2625408470630646, 0.029084976762533188, 0.0560726560652256, 0.04393666982650757, 0.11937425285577774, -0.027055196464061737, 0.09915445744991302, 0.038901593536138535, 0.031341034919023514, 0.053730301558971405, -0.3108094036579132, -0.09018608182668686, -0.11730748414993286, -0.023824235424399376, 0.005682717077434063, 0.07371662557125092, -0.06381651759147644, 0.0973123162984848, 0.016277583315968513, -0.11116818338632584, 0.03999173268675804, 0.06702772527933121, 0.056068792939186096, -0.0016558775678277016, 0.04185899347066879, 0.026015572249889374, -0.038102295249700546, -0.0007302515441551805, -0.051657166332006454, 0.08049941062927246, 0.028194691985845566, 0.2558043897151947, -0.15569493174552917, -0.032488808035850525, 0.08836235105991364, -0.0017728088423609734, -0.07049392908811569, 0.0007196187507361174, 0.10224046558141708, 0.03330126032233238, 0.02875676564872265, -0.34434202313423157, 0.11179064214229584, -0.016359826549887657, -0.01848633401095867, -0.30706295371055603, 0.008768312633037567, 0.01843581721186638, -0.07592741400003433, -0.07324749231338501, 0.027428191155195236, -0.09307246655225754, 0.13887189328670502, 0.021686479449272156, 0.08024705201387405, 0.16404326260089874, 0.00017940840916708112, -0.057983510196208954, -0.09748834371566772, 0.040106914937496185, 0.06055538356304169, -0.16129307448863983, 0.05664195120334625, 0.08148366957902908, -0.07362304627895355, -0.17402298748493195, -0.17155666649341583, 0.05371374636888504, 0.06389226019382477, -0.007736570201814175, -0.022117584943771362, 0.03980686143040657, 0.016893064603209496, -0.13255880773067474, -0.0940011665225029, 0.02179417759180069, -0.02745036780834198, -0.02036173827946186, 0.108427032828331, -0.003125343471765518, -0.028694070875644684, -0.029273441061377525, 0.04743114113807678, 0.18640080094337463, 0.3160746097564697, -0.04334426298737526, 0.145894393324852, -0.05568494647741318, -0.043242450803518295, -0.16053950786590576, -0.010549073107540607, 0.14298029243946075, 0.08977453410625458, -0.04981089383363724, 0.05624290928244591, -0.007954463362693787, -0.0029858890920877457, -0.08368606865406036, 0.11690477281808853, 0.010289613157510757, 0.04736916720867157, 0.014389189891517162, -0.10194752365350723, -0.01267449650913477, -0.054833121597766876], [-0.00863583106547594, -0.021178919821977615, -0.16085435450077057, -0.05253216624259949, 0.09060724824666977, 0.10338468849658966, 0.058581624180078506, 0.01983865164220333, 0.008561967872083187, 0.2225629836320877, 0.1754695624113083, -0.06447769701480865, 0.12115766853094101, 0.15980130434036255, -0.06984614580869675, 0.015421525575220585, 0.05961132049560547, 0.2400028258562088, 0.06650062650442123, -0.047492027282714844, -0.10884761810302734, -0.10164335370063782, -0.09207864850759506, 0.27645808458328247, 0.06880614161491394, 0.24116644263267517, 0.17000983655452728, -0.06308518350124359, 0.2254362553358078, -0.15808789432048798, -0.022543594241142273, -0.2362554371356964, 0.2951769232749939, 0.09684062004089355, -0.05405222252011299, 0.17409054934978485, -0.12296082824468613, -0.07629435509443283, -0.2629421353340149, -0.052821867167949677, 0.2540750503540039, 0.0744798332452774, 0.0044613550417125225, -0.10559257119894028, 0.030648931860923767, 0.031399987637996674, -0.10598763078451157, 0.18714426457881927, -0.010422557592391968, -0.20368477702140808, 0.27324292063713074, -0.04078185558319092, -0.06814441084861755, -0.059886712580919266, 0.14555811882019043, -0.22929465770721436, 0.08693242073059082, 0.15191596746444702, -0.2539938688278198, -0.02204938419163227, 0.15854302048683167, -0.21153691411018372, -0.025597531348466873, -0.03649323061108589, -0.09964066743850708, -0.03132908046245575, -0.043862756341695786, 0.11274391412734985, 0.09830310195684433, -0.11806176602840424, 0.15638992190361023, 0.29665619134902954, 0.06105732545256615, 0.04925272986292839, 0.21796105802059174, -0.12276523560285568, 0.028891546651721, 0.1676524430513382, 0.32042521238327026, 0.12570685148239136, -0.01844140514731407, 0.14439965784549713, 0.36241504549980164, -0.10125478357076645, -0.009650826454162598, -0.018120525404810905, -0.08897154033184052, -0.09659506380558014, -0.09075210988521576, -0.06772305071353912, 0.0782012864947319, -0.11687217652797699, 0.06787608563899994, 0.19475868344306946, 0.13479164242744446, -0.2744913101196289, -0.005257602781057358, -0.1671772450208664, 0.0362493097782135, -0.14912542700767517, 0.0611790232360363, 0.1380404680967331, 0.14595703780651093, -0.09776759892702103, 0.17641326785087585, 0.07897531241178513, 0.01483365148305893, 0.12571537494659424, 0.1451026201248169, -0.005174144171178341, 0.0005646618665196002, 0.09202130138874054, 0.011853593401610851, 0.0574992299079895, 0.17347286641597748, -0.0632370263338089, 0.057486120611429214, -0.04685129225254059, -0.10226114839315414, 0.033330950886011124, -0.012081798166036606, -0.049592893570661545, -0.04220738261938095, 0.12988972663879395, 0.04186362400650978, 0.041330378502607346, 0.09752959758043289, 0.08248583972454071, 0.00025253993226215243, -0.018162742257118225, 0.11697769910097122, 0.017293306067585945, 0.029695997014641762, -0.1410873532295227, -0.05396870896220207, -0.002098554279655218, 0.18903163075447083, -0.01901618018746376, 0.07753101736307144, 0.23172175884246826, -0.19393527507781982, 0.3180743455886841, 0.1530711054801941, -0.2705610990524292, 0.06913487613201141, -0.0030675868038088083, -0.07173982262611389, 0.16890861093997955, 0.2500796616077423, -0.02334095723927021, -0.12937980890274048, 0.0031652527395635843, 0.16827695071697235, 0.04571568965911865, 0.047696396708488464, -0.001804993487894535, 0.022720929235219955, -0.04363241791725159, 0.1079924926161766, -0.2665179669857025, 0.4729616343975067, 0.00443800026550889, -0.035620447248220444, -0.09176692366600037, 0.04463953524827957, 0.10400616377592087, 0.04010509327054024, 0.02059279941022396, -0.05806989595293999, -0.031626321375370026, 0.1672150045633316, 0.06378866732120514, -0.13714048266410828, 0.08236075192689896, 0.15789444744586945, -0.08303157985210419, -0.013334163464605808, 0.12837883830070496, -0.09132152795791626, -0.008852892555296421, 0.1719559282064438, 0.10465116798877716, -0.04642840474843979, 0.011674401350319386, -0.08347748219966888, 0.040604062378406525, -0.03236399218440056, -0.06566356122493744, 0.06144179403781891, -0.12682019174098969, -0.0031496647279709578, 0.020266177132725716, -0.11460196226835251, 0.1251615434885025, -0.04773293063044548, 0.07591327279806137, 0.19487901031970978, -0.010938407853245735, 0.012958480976521969, -0.11984097212553024, -0.05775463208556175, 0.019968422129750252, -0.0016374214319512248, -0.03864021599292755, 0.05413278564810753, 0.1881989985704422, -0.02771240845322609, 0.07741796970367432, -0.07704030722379684, -0.0021482398733496666, 0.020701764151453972, -0.051020506769418716, -0.0966767892241478, 0.008910502307116985, 0.06873462349176407, -0.11644294857978821, 0.0003961362817790359, -0.037922244518995285, 0.0011498040985316038, -0.008586744777858257, -0.005386244039982557, -0.06012289226055145, 0.0878467708826065, 0.07654367387294769, 0.03577573969960213, 0.01193445548415184, -0.15791545808315277, 0.2062649130821228, 0.015528452582657337, -0.03101302497088909, -0.010827505961060524, 0.010009526275098324, 0.1323312371969223, 0.0015931363450363278, 0.019290922209620476, -0.15116293728351593, 0.7499351501464844, 0.05729042366147041, -0.1403275728225708, -0.08182619512081146, 0.139185830950737, -0.13322198390960693, 0.04247468709945679, -0.25739312171936035, 0.007604317739605904, 0.0036938488483428955, 0.16906960308551788, 0.021780775859951973, 0.08735501021146774, -0.058614328503608704, 0.013671111315488815, -0.010733340866863728, -0.011053336784243584, 0.06497795879840851, -0.07790635526180267, -0.1969708353281021, 0.1517348438501358, -0.15807564556598663, -0.26477566361427307, 0.04227815940976143, 0.2806917130947113, -0.06444806605577469, -0.03749151900410652, 0.0856722965836525, -0.014542140997946262, 0.10492909699678421, -0.12541329860687256, 0.2145567536354065, 0.22225496172904968, -0.06846374273300171, 0.08756910264492035, -0.004653673153370619, 0.029707392677664757, -0.09445247054100037, 0.23491914570331573, 0.009264863096177578, 0.01552053727209568, -0.07930527627468109, -0.24979716539382935, 0.019303079694509506, -0.12028336524963379, -0.018078774213790894, -0.07980034500360489, 0.05156223848462105, 0.0751677006483078, -0.07445531338453293, 0.05941047519445419, -0.03985776752233505, 0.05013642832636833, 0.11301758885383606, 0.07883130759000778, -0.012636224739253521, 0.09234533458948135, -0.045747362077236176, 0.05678955838084221, 0.12005823105573654, -0.1241707131266594, -0.05415280908346176, -0.0007001502672210336, -0.02071334607899189], [0.0073318518698215485, 0.12800513207912445, 0.08974906802177429, -0.11266597360372543, 0.23054815828800201, -0.2604449689388275, -0.06400927901268005, -0.26860955357551575, -0.24004746973514557, 0.009067579172551632, 0.06009576469659805, -0.03609343618154526, -0.08974607288837433, -0.21640291810035706, -0.1934979110956192, -0.04138118028640747, 0.02350728213787079, 0.07368700206279755, 0.09953756630420685, 0.048318322747945786, -0.06194068491458893, 0.08073125779628754, -0.14692409336566925, 0.0997711792588234, -0.07971853762865067, -0.08071213215589523, -0.0024954723194241524, -0.10362610220909119, -0.37745174765586853, -0.14678999781608582, -0.013219947926700115, -0.0003258622600696981, 0.10732980072498322, 0.013594593852758408, 0.12202312797307968, -0.07978734374046326, -0.15646782517433167, -0.14126043021678925, 0.18234668672084808, -0.018208788707852364, -0.27279895544052124, -0.005978970788419247, -0.03964681178331375, -0.1913132667541504, 0.17249879240989685, -0.011539893224835396, -0.010846061632037163, -0.18443812429904938, 0.12915514409542084, 0.06051076948642731, -0.20669084787368774, -0.24882270395755768, 0.21587789058685303, -0.1240713894367218, -0.02521399036049843, -0.08286558836698532, 0.0946003720164299, -0.09734801203012466, 0.06943807005882263, 0.011137045919895172, -0.30866774916648865, -0.21514172852039337, 0.10337289422750473, 0.1936008781194687, -0.16358469426631927, 0.08042566478252411, -0.024224303662776947, -0.238930344581604, -0.2412603199481964, -0.06957907229661942, 0.04193174093961716, 0.05750033259391785, -0.16988933086395264, -0.19400842487812042, -0.19845612347126007, -0.16762596368789673, 0.07268816232681274, -0.09463468939065933, -0.21896883845329285, -0.07051228731870651, 0.11895836144685745, -0.15758810937404633, 0.03443867713212967, -0.08909077197313309, -0.04198811948299408, -0.043179817497730255, -0.17157267034053802, -0.07923398166894913, 0.0537092350423336, 0.13257353007793427, -0.15468785166740417, -0.0997808575630188, -0.17980444431304932, -0.10922107845544815, 0.04017360135912895, 0.1958925426006317, 0.09835205227136612, 0.09027989208698273, -0.09206614643335342, -0.3083098232746124, 0.06403080374002457, 0.10586656630039215, -0.3764473497867584, -0.1310521364212036, -0.07789928466081619, 0.044753555208444595, 0.13667955994606018, 0.14380836486816406, 0.049989521503448486, 0.058447789400815964, -0.08419101685285568, -0.031125040724873543, -0.2904416620731354, 0.043265312910079956, -0.09741809964179993, -0.0835123136639595, -0.04673026129603386, 0.1935248076915741, 0.005563506856560707, -0.02973853051662445, -0.15085579454898834, -0.12736785411834717, 0.27312153577804565, -0.02334025874733925, 0.14784055948257446, 0.13003607094287872, -0.17242032289505005, -0.05373809114098549, 0.06803618371486664, -0.005393960513174534, 0.10790643841028214, -0.16941764950752258, -0.09197945892810822, -0.1515040099620819, -0.06973487138748169, -0.03233295679092407, -0.03750648722052574, 0.051471952348947525, -0.10991466790437698, 0.21547380089759827, -0.2509787976741791, -0.25025150179862976, 0.0693487823009491, 0.19324709475040436, -0.10570326447486877, -0.2784404754638672, 0.037404801696538925, -0.0861215740442276, -0.03293144702911377, -0.06905090063810349, -0.07966239005327225, 0.0040423027239739895, -0.09281378239393234, -0.08735596388578415, -0.01774696260690689, -0.16845084726810455, -0.06402526050806046, -0.0847260057926178, 0.1380191594362259, -0.11451207846403122, 0.14890865981578827, 0.113315649330616, -0.07760358601808548, 0.09230305999517441, 0.09935542196035385, -0.06928257644176483, 0.0911707803606987, 0.07530514150857925, -0.16922615468502045, -0.21835489571094513, 0.09184297174215317, -0.02767886593937874, 0.040750984102487564, 0.03620809689164162, -0.07350526005029678, 0.07796145975589752, -0.1435934454202652, -0.03366986662149429, -0.19945840537548065, 0.05572105944156647, 0.2647925317287445, -0.2579999566078186, 