{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_10", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "y2"}, "name": "y2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 40, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[0.08377087861299515, -0.018446486443281174, 0.058263134211301804, 0.10990262776613235, -0.12912355363368988, -0.02671942673623562, -0.05836262181401253, 0.06342050433158875, -0.09405877441167831, -0.1767074167728424, -0.16359536349773407, 0.08002789318561554, -0.011289621703326702, -0.17369548976421356, 0.08962032943964005, -0.0024873027577996254, 0.030383076518774033, -0.057015519589185715, -0.03880088031291962, -0.030259402468800545, -0.1295146644115448, 0.23760707676410675, -0.17055314779281616, 0.149150550365448, -0.18203049898147583, 0.13771651685237885, -0.13959901034832, 0.4037940204143524, 0.019750189036130905, -0.05096837133169174, 0.0760108157992363, 0.0531475804746151, 0.11086615920066833, 0.024786535650491714, -0.1933937519788742, -0.21198393404483795, -0.0493515282869339, -0.1378825604915619, -0.13572406768798828, -0.07614881545305252], [-0.02875910885632038, 0.007829300127923489, -0.06997352838516235, -0.28250977396965027, 0.22325773537158966, 0.0769975408911705, -0.046986307948827744, 0.09168381989002228, 0.045140113681554794, 0.13522320985794067, -0.031171513721346855, 0.10187593102455139, -0.03204432874917984, -0.2173299938440323, 0.2620241641998291, 0.009013776667416096, 0.0518244206905365, 0.047809019684791565, 0.006071599666029215, -0.31193920969963074, -0.17048226296901703, 0.5211445093154907, -0.11127165704965591, 0.027539832517504692, -0.11237050592899323, 0.2376147359609604, -0.03941696509718895, 0.059739962220191956, 0.26532530784606934, 0.21841612458229065, 0.2869304120540619, 0.2860743999481201, -0.08455237746238708, -0.2476750910282135, -0.246893048286438, 0.05256608873605728, 0.2042146474123001, -0.0650201290845871, 0.19709782302379608, -0.15394726395606995], [-0.10462360829114914, 0.05045104771852493, -0.013753916136920452, -0.10040891170501709, 0.23404106497764587, 0.11985451728105545, 0.12403970211744308, 0.11102748662233353, 0.08206208795309067, -0.0019542784430086613, -0.07526845484972, -0.11339916288852692, 0.25829610228538513, -0.07799207419157028, -0.051392339169979095, 0.13055133819580078, -0.11795604974031448, -0.01393759623169899, -0.06007925793528557, -0.17481334507465363, 0.06722117215394974, 0.16444049775600433, -0.032959483563899994, -0.02476116269826889, -0.10179635137319565, 0.1624888777732849, -0.15177570283412933, -0.09879106283187866, -0.10233917832374573, -0.011857670731842518, 0.10747504234313965, 0.15129484236240387, -0.23260727524757385, -0.18236209452152252, -0.16212162375450134, 0.18683262169361115, 0.0503028966486454, -0.15259703993797302, -0.06976776570081711, -0.20578764379024506], [0.06799781322479248, -0.04107947647571564, -0.5253725647926331, -0.2562761902809143, 0.16406258940696716, -0.08678047358989716, -0.24635310471057892, 0.10793738067150116, 0.22060927748680115, 0.1843786984682083, -0.22858227789402008, 0.10146154463291168, -0.08079136908054352, -0.11307543516159058, 0.23138166964054108, -0.15295077860355377, 0.12345285713672638, -0.14943987131118774, -0.05800682678818703, 0.1500501185655594, -0.09281718730926514, 0.1489807367324829, -0.1706901490688324, -0.0687553659081459, -0.012149112299084663, -0.22152705490589142, 0.10742086172103882, -0.4444620609283447, -0.027993952855467796, 0.11475177854299545, 0.18680718541145325, -0.11659602075815201, 0.10115505009889603, 0.024028822779655457, -0.0435221828520298, -0.2207973748445511, 0.1169181689620018, 0.0757800042629242, -0.0809236615896225, 0.20363377034664154], [-0.11665693670511246, -0.08938868343830109, 0.21959517896175385, 0.07866624742746353, 0.05429846793413162, 0.059063345193862915, 0.13583648204803467, -0.14571857452392578, 0.19487547874450684, 0.10699077695608139, 0.10004542768001556, -0.33480873703956604, 0.04615151882171631, 0.17156006395816803, -0.15073354542255402, -0.14208708703517914, -0.26768410205841064, 0.09743554890155792, -0.09913581609725952, -0.01644202508032322, 0.09191156178712845, -0.29125872254371643, 0.17302700877189636, 0.07489881664514542, 0.04711577668786049, 0.13020849227905273, -0.11779393255710602, -0.14542324841022491, -0.03370523825287819, -0.18499916791915894, -0.16110026836395264, -0.023052949458360672, -0.2155115008354187, -0.1278996616601944, 0.001164930174127221, 0.1606425791978836, -0.18628326058387756, -0.05504888296127319, 0.09240498393774033, 0.04547477886080742], [-0.19603502750396729, 0.07406619936227798, 0.06772184371948242, 0.18754416704177856, -0.07103604823350906, 0.013633545488119125, 0.12169630825519562, -0.06306006759405136, -0.2664041519165039, -0.28437086939811707, 0.04261162877082825, -0.0038787475787103176, 0.011633086949586868, 0.004997226409614086, 0.018408460542559624, 0.21766608953475952, 0.08965440094470978, -0.03618758171796799, -0.04435719922184944, -0.10221824795007706, -0.09142746776342392, 0.1839212030172348, 0.2160017341375351, 0.1741923838853836, -0.07875249534845352, 0.14691147208213806, 0.09827464073896408, 0.3550975024700165, -0.06899689882993698, 0.020010769367218018, 0.08769512176513672, 0.05370662361383438, 0.2387615591287613, 0.1759263575077057, -0.1127968356013298, 0.06022367626428604, -0.1342400461435318, -0.1952793449163437, 0.19371481239795685, -0.0741797611117363], [-0.18587370216846466, 0.11453503370285034, -0.15195901691913605, 0.02350611798465252, 0.00873410515487194, -0.29324108362197876, -0.04730658978223801, 0.060734670609235764, -0.18039019405841827, -0.18214590847492218, -0.10786283016204834, -0.05063152313232422, -0.04346969351172447, 0.04214698448777199, 0.18526338040828705, -0.0036487849429249763, -0.06894195824861526, -0.30378222465515137, -0.2482895404100418, 0.15193916857242584, 0.08760866522789001, -0.11977511644363403, -0.051751766353845596, 0.07181864976882935, -0.08556661009788513, -0.16430826485157013, 0.16190290451049805, -0.16434991359710693, -0.1427491158246994, 0.038060400635004044, -0.00017081096302717924, -0.10634690523147583, 0.1123615950345993, 0.09276747703552246, 0.08048753440380096, -0.04569811746478081, -0.009487190283834934, 0.016249723732471466, -0.027595238760113716, 0.031306084245443344], [-0.008098703809082508, 0.11040022224187851, 0.40812864899635315, 0.49209049344062805, 0.15376915037631989, 0.168039932847023, 0.07600034028291702, -0.11153760552406311, 0.14468123018741608, -0.14775672554969788, -0.011470155790448189, -0.16528846323490143, -0.07530141621828079, 0.13365228474140167, -0.14304183423519135, 0.21163584291934967, -0.006795699242502451, -0.10524751245975494, 0.26542890071868896, -0.05707111954689026, 0.09058765321969986, -0.12251080572605133, 0.16297650337219238, -0.02169599011540413, 0.1288430541753769, 0.18458592891693115, 0.07133353501558304, 0.06584696471691132, -0.07007826864719391, 0.19197618961334229, 0.26407772302627563, -0.09586737304925919, 0.12946121394634247, -0.1060018241405487, 0.17011459171772003, -0.039998024702072144, -0.03019726648926735, 0.2541917562484741, -0.028281010687351227, 0.16449616849422455], [-0.2379741221666336, 0.14531153440475464, -0.1355350762605667, -0.3253991901874542, 0.02662881463766098, -0.34158411622047424, -0.07449426501989365, -0.05510830879211426, -0.12303151935338974, -0.2082575112581253, -0.24692842364311218, -0.23039288818836212, 0.001836165669374168, 0.09300975501537323, -0.16855689883232117, 0.0830608531832695, 0.1144605278968811, -0.2736767530441284, -0.1992284059524536, -0.11895082890987396, -0.042251959443092346, -0.023018918931484222, -0.09644103050231934, -0.06797632575035095, -0.10319161415100098, -0.14151479303836823, -0.011790825985372066, -0.10285510867834091, -0.16356736421585083, 0.09234053641557693, -0.0723033994436264, 0.04170737415552139, -0.06776350736618042, 0.07656248658895493, 0.06804049015045166, 0.15991054475307465, 0.022123249247670174, -0.17263522744178772, -0.029004115611314774, -0.03645718842744827], [-0.0969078540802002, -0.15570604801177979, 0.15850766003131866, -0.20346936583518982, 0.07375529408454895, 0.19184094667434692, 0.09529128670692444, -0.36017438769340515, 0.15154384076595306, 0.17342625558376312, 0.02370321936905384, -0.1989026665687561, -0.028666071593761444, -0.021577704697847366, -0.008240597322583199, 0.05616391822695732, -0.004445029888302088, 0.15945233404636383, 0.06981056183576584, -0.021676620468497276, -0.08551757037639618, -0.08976240456104279, -0.035570111125707626, -0.021937986835837364, 0.039572395384311676, 0.22533251345157623, -0.2106804996728897, -0.3989255726337433, -0.005671750754117966, -0.049488190561532974, 0.01590617187321186, 0.1638384759426117, -0.09995977580547333, -0.2666757106781006, 0.16627220809459686, -0.0038795594591647387, 0.03878364711999893, -0.023860516026616096, 0.06420008093118668, 0.15917520225048065], [-0.19948162138462067, 0.016495155170559883, 0.46238353848457336, 0.04377837851643562, -0.16088293492794037, -0.03388502076268196, -0.10862165689468384, 0.03824421763420105, -0.3650609850883484, -0.2305968552827835, 0.12225894629955292, 0.015162539668381214, 0.03189649060368538, -0.1980985552072525, -0.31671029329299927, 0.005393706727772951, -0.03029913641512394, -0.20835907757282257, -0.13228774070739746, -0.19288703799247742, 0.15029574930667877, 0.057521458715200424, 0.016164062544703484, 0.1323270946741104, 0.11495105177164078, -0.2188514769077301, -0.1958518624305725, 0.19222751259803772, -0.23379600048065186, 0.06987148523330688, -0.037907425314188004, -0.1741001158952713, 0.10754033178091049, 0.02382587641477585, -0.3112904131412506, -0.05306495353579521, -0.05868770554661751, -0.11714630573987961, -0.058692771941423416, -0.005005928222090006], [-0.012428252957761288, 0.09226907044649124, -0.36323148012161255, -0.24025672674179077, 0.0076953754760324955, -0.23010848462581635, -0.23118114471435547, 0.13209320604801178, -0.1804870218038559, -0.21795636415481567, 0.02025957778096199, 0.08341385424137115, -0.13255713880062103, -0.06641443818807602, -0.08346667885780334, -0.12389160692691803, 0.1586133986711502, -0.16746272146701813, 0.017504282295703888, 0.10437428951263428, -0.2421547770500183, 0.06971953809261322, 0.0495511069893837, 0.02220541052520275, -0.005516559351235628, -0.2451707124710083, 0.2096485197544098, -0.2533947229385376, -0.061838820576667786, 0.20606303215026855, 0.1839708834886551, -0.07699456065893173, 0.12890546023845673, 0.062210533767938614, 0.44781383872032166, -0.16585707664489746, -0.0727582797408104, -0.1451539695262909, 0.1353149265050888, 0.20968414843082428], [-0.07413375377655029, -0.16436174511909485, -0.17773748934268951, 0.12590837478637695, -0.1063518151640892, -0.005775203462690115, 0.07686474174261093, 0.17676116526126862, 0.023601684719324112, 0.039252784103155136, -0.14799420535564423, 0.1111089363694191, 0.06888652592897415, 0.016821816563606262, 0.05314195901155472, -0.29525795578956604, 0.19111260771751404, 0.11736482381820679, 0.09789107739925385, 0.12153682112693787, -0.0697827860713005, 0.05073149502277374, -0.05216330289840698, 0.011686436831951141, -0.17911483347415924, 0.13211065530776978, 0.06294553726911545, 0.06754329800605774, -0.0547913983464241, -0.06123923510313034, -0.10634858161211014, 0.259789377450943, -0.0060271755792200565, -0.05145146697759628, -0.08365602046251297, -0.06995440274477005, -0.003412578720599413, -0.04417896270751953, 0.1311599463224411, -0.08416470140218735], [-0.12159804254770279, 0.09865099936723709, 0.017988000065088272, 0.006142104975879192, 0.02641359344124794, -0.18159933388233185, 0.14593970775604248, -0.12053103744983673, -0.0944405123591423, -0.12179645895957947, -0.02357443980872631, -0.11920864880084991, -0.024085547775030136, 0.05077992007136345, 0.12066077440977097, 0.14966312050819397, -0.006490578409284353, -0.26803550124168396, -0.14421629905700684, 0.060512423515319824, 0.10785124450922012, -0.1534806340932846, 0.006667325273156166, 0.028254112228751183, 0.0677630677819252, -0.16227537393569946, 0.04597168415784836, -0.021469056606292725, -0.19329944252967834, 0.10873446613550186, -0.10519123077392578, -0.15865637362003326, 0.02376295067369938, 0.05891352891921997, 0.05802395939826965, 0.15489302575588226, 0.16270390152931213, -0.1470315009355545, -0.0038662394508719444, -0.03509142994880676], [-0.02627270668745041, 0.11994454264640808, 0.1307186484336853, 0.0472773015499115, -0.027138303965330124, -0.008760201744735241, -0.004998788703233004, -0.022846050560474396, -0.015547587536275387, 0.005882208701223135, 0.06363984942436218, -0.00018611819541547447, 0.12006588280200958, 0.14379914104938507, 0.0034309758339077234, 0.08855020999908447, -0.042296092957258224, 0.08842504769563675, 0.04940168932080269, -0.03206946328282356, 0.0473867803812027, -0.028869077563285828, 0.11721181869506836, 0.1030869409441948, -0.047064680606126785, 0.10730461776256561, 0.04494597017765045, -0.10634274780750275, 0.04407016932964325, -0.08893291652202606, 0.048290714621543884, 0.02186533808708191, 0.0438246876001358, 0.052052516490221024, 0.15535247325897217, 0.13088321685791016, 0.017673201858997345, 0.05804053694009781, 0.09457483142614365, -0.011954935267567635], [0.21922911703586578, 0.138224259018898, 0.010611481964588165, 0.0685708224773407, -0.08058540523052216, -0.18212221562862396, 0.10252828896045685, -0.014109805226325989, 0.17412443459033966, 0.018267372623085976, 0.1917436718940735, -0.03918309882283211, 0.11299901455640793, 0.11125964671373367, 0.11246497184038162, 0.16828560829162598, 0.26304933428764343, 0.08564063906669617, -0.058134134858846664, 0.1956174224615097, 0.14562653005123138, 0.047386281192302704, -0.007592819631099701, 0.0858500599861145, 0.06746029853820801, 0.002598904073238373, -0.01803802326321602, -0.011389638297259808, -0.08930239081382751, 0.10871648043394089, 0.2054610401391983, -0.014530080370604992, -0.07837775349617004, -0.07562661170959473, 0.18613356351852417, 0.16772346198558807, -0.06270444393157959, 0.018538931384682655, -0.12126190215349197, 0.14689920842647552], [0.164104163646698, 0.1682204306125641, 0.0932261049747467, -0.02906944416463375, 0.17731288075447083, 0.13900990784168243, 0.049280062317848206, 0.03857855126261711, 0.2176317274570465, 0.08988192677497864, -0.016639351844787598, 0.053304072469472885, -0.0712912529706955, -0.028889397159218788, 0.22008036077022552, 0.037718284875154495, 0.07246357202529907, -0.13137859106063843, 0.11999291181564331, 0.19259405136108398, -0.08683853596448898, 0.06014653295278549, -0.024006085470318794, 0.01955820620059967, 0.08583711832761765, -0.00684902910143137, 0.1790265589952469, -0.17333893477916718, 0.007498953025788069, 0.15190109610557556, 0.13238248229026794, 0.2154473066329956, 0.1426798403263092, -0.0016349912621080875, 0.16450999677181244, -0.010103262960910797, 0.2138516753911972, 0.03748752549290657, 0.21577785909175873, 0.25686684250831604], [-0.3433460593223572, -0.34470218420028687, -0.3007068336009979, 0.2515556216239929, 0.04071569815278053, -0.17519629001617432, -0.29575300216674805, 0.03040873259305954, -0.011534581892192364, -0.1707044541835785, -0.07976767420768738, 0.19303205609321594, -0.19467222690582275, -0.11790882796049118, -0.26757457852363586, 0.00502778310328722, -0.044735152274370193, -0.21098949015140533, 0.05376799777150154, 0.09776779264211655, 0.004504936747252941, -0.24789294600486755, 0.06029985472559929, 0.04606383666396141, 0.02069806307554245, -0.326699823141098, 0.05028285086154938, 0.0488450787961483, -0.11174817383289337, 0.31527504324913025, 0.10493019223213196, -0.12497374415397644, 0.23959815502166748, 0.1824434995651245, 0.14620284736156464, -0.07125263661146164, -0.11561938375234604, -0.03495399281382561, -0.12314514070749283, 0.33385148644447327], [0.17009969055652618, 0.18273405730724335, -0.21105100214481354, 0.2360602617263794, -0.22320792078971863, 0.02128702774643898, 0.04947832226753235, 0.23779496550559998, -0.15637262165546417, 0.03519235551357269, 0.10714700818061829, -0.05758126080036163, 0.11648944765329361, 0.06501041352748871, -0.1910911649465561, 0.03912030905485153, 0.20884369313716888, 0.14161600172519684, 0.006551650818437338, 0.12325415015220642, 0.5663938522338867, 0.03315809741616249, 0.02766207791864872, -0.0832538977265358, 0.10561671108007431, -0.13153328001499176, 0.012696613557636738, 0.01460819598287344, -0.13938096165657043, 0.17783068120479584, -0.06654584407806396, -0.056572116911411285, -0.041861288249492645, 0.22409547865390778, -0.22266021370887756, -0.0662776306271553, 0.26292312145233154, -0.04365537688136101, -0.27945414185523987, -0.1271570324897766], [0.02386780083179474, 0.11951342225074768, 0.1637682467699051, 0.24980618059635162, 0.08574803173542023, 0.2363770604133606, 0.05956341326236725, 0.15346278250217438, 0.1242644414305687, 0.03409836068749428, -0.021417565643787384, 0.2853674590587616, -0.0019148888532072306, -0.18041111528873444, -0.13543401658535004, -0.07786589115858078, 0.2126348614692688, 0.020670931786298752, -0.020490150898694992, -0.14454154670238495, -0.055185943841934204, -0.03685956820845604, -0.03600667044520378, -0.16136595606803894, 0.08292414247989655, 0.05418677255511284, 0.046032603830099106, 0.4417690634727478, 0.23048986494541168, 0.19787926971912384, 0.013682912103831768, 0.1771964728832245, -0.010183739475905895, 0.22559292614459991, -0.22153925895690918, -0.14970602095127106, -0.06763250380754471, 0.31087327003479004, -0.18432417511940002, -0.06152217090129852], [-0.31946584582328796, -0.2491152137517929, -0.101849764585495, 0.06120474264025688, 0.0216987282037735, -0.022970926016569138, 0.018348529934883118, -0.0776771679520607, -0.11312191933393478, -0.16026701033115387, 0.06016748026013374, 0.11025058478116989, 0.08369529247283936, 0.08938730508089066, -0.14060792326927185, 0.20482602715492249, -0.09359487146139145, 0.010717952623963356, -0.15314242243766785, 0.015402557328343391, 0.07394763827323914, 0.06525735557079315, 0.09056474268436432, 0.12653104960918427, -0.0871674194931984, 0.07643072307109833, -0.2155320644378662, -0.03653941676020622, -0.2568996250629425, -0.009252024814486504, 0.05615038797259331, -0.21569107472896576, 0.08113670349121094, 0.10616414994001389, -0.0437711663544178, -0.05341218039393425, 0.005739436484873295, -0.2690325677394867, 0.13966959714889526, -0.06101110950112343], [0.07919345051050186, 0.1639164537191391, -0.038223810493946075, 0.4534926414489746, -0.19094057381153107, 0.07591977715492249, -0.06808009743690491, 0.04034760966897011, -0.10370482504367828, -0.059161439538002014, 0.25931409001350403, -0.10664767026901245, 0.11429134011268616, 0.14356990158557892, -0.09272221475839615, 0.025684013962745667, 0.027608012780547142, 0.3011312186717987, 0.011274570599198341, 0.015902169048786163, 0.33400851488113403, 0.006929758936166763, -0.002540913876146078, -0.009964311495423317, 0.10122768580913544, -0.02326088957488537, 0.026332644745707512, 0.1756637543439865, -0.25849345326423645, 0.09753833711147308, -0.11094248294830322, 0.03136144205927849, -0.22921517491340637, 0.052325230091810226, 0.09336870908737183, -0.04005521908402443, -0.07905609905719757, -0.1033104658126831, 0.010674400255084038, 0.03649759292602539], [0.13879843056201935, -0.06050550565123558, -0.1554160863161087, -0.44813117384910583, -0.04551218822598457, 0.03687264025211334, -0.16118234395980835, 0.16961808502674103, -0.0032820110209286213, -0.008809368126094341, 0.024264613166451454, 0.2877745032310486, 0.08635483682155609, -0.2762201428413391, -0.13737845420837402, 0.19102144241333008, 0.09072898328304291, -0.06271790713071823, 0.11113911122083664, -0.1680838167667389, -0.062479790300130844, 0.22238697111606598, -0.10286080092191696, -0.040426816791296005, -0.2551015615463257, 0.15393324196338654, 0.08538579195737839, -0.1913016140460968, 0.12032188475131989, 0.10881651192903519, 0.05577193200588226, -0.0004636478843167424, 0.08631572872400284, 0.20704002678394318, -0.2713555693626404, 0.05591196566820145, 0.07347112894058228, 0.023230180144309998, 0.052905309945344925, -0.06085415929555893], [0.11143822222948074, 0.16388161480426788, 0.16431200504302979, 0.23857592046260834, -0.0862879604101181, -0.12798823416233063, 0.14450447261333466, 0.07906927913427353, -0.23702171444892883, -0.16427944600582123, 0.023342905566096306, 0.03681638091802597, 0.07519836723804474, 0.2264120727777481, 0.11316362023353577, -0.06487984955310822, -0.08356605470180511, 0.07244913280010223, 0.07152579724788666, 0.03738994151353836, -0.07655978202819824, -0.11886398494243622, -0.023211032152175903, 0.08658816665410995, -0.00660206563770771, 0.049849215894937515, 0.031225403770804405, 0.33751189708709717, -0.14508260786533356, -0.0473126657307148, -0.20063373446464539, 0.16965065896511078, -0.003989569377154112, 0.27392828464508057, 0.03317904844880104, -0.0763935074210167, -0.11340729147195816, -0.14107130467891693, 0.07161775231361389, -0.07105236500501633], [0.020898042246699333, -0.19107577204704285, 0.09391821175813675, 0.053684018552303314, 0.12995031476020813, 0.1594327837228775, 0.010402140207588673, 0.06190365552902222, 0.0886523500084877, 0.19465632736682892, -0.09833429753780365, 0.19342918694019318, -0.26958122849464417, -0.14180028438568115, 0.3045769929885864, -0.19050663709640503, 0.02759036049246788, 0.020240962505340576, 0.18997475504875183, 0.11247570067644119, -0.2119872123003006, -0.26520419120788574, -0.0035406912211328745, -0.18905827403068542, 0.11503442376852036, -0.20066209137439728, -0.039975203573703766, -0.14524635672569275, 0.08833757787942886, 0.11809360980987549, -0.08799867331981659, 0.159744992852211, -0.23206977546215057, -0.0072672413662076, 0.06485605239868164, -0.16275878250598907, 0.09282834827899933, 0.19040416181087494, -0.27286380529403687, 0.08035261183977127], [-0.08075525611639023, -0.016166038811206818, 0.17002630233764648, 0.15015682578086853, 0.16439032554626465, 0.056561555713415146, -0.0808630883693695, -0.10294661670923233, 0.14531265199184418, -0.09787072986364365, 0.1531766653060913, 0.030224952846765518, -0.19195567071437836, -0.18228591978549957, -0.09138050675392151, -0.0029253331013023853, -0.1509857177734375, -0.003187567461282015, 0.010052579455077648, -0.21180036664009094, -0.056743644177913666, -0.17436125874519348, 0.0002375001204200089, -0.08041330426931381, 0.18351489305496216, -0.10302619636058807, -0.17698492109775543, -0.10264009237289429, 0.12413052469491959, 0.09968236088752747, 0.09704238176345825, -0.022695600986480713, 0.014220232143998146, 0.08165227621793747, -0.06586571037769318, -0.1563289761543274, -0.2658222019672394, -0.12570303678512573, -0.034581106156110764, 0.11615800112485886], [-0.022840185090899467, -0.07281362265348434, 0.24305793642997742, -0.036307573318481445, 0.15850068628787994, -0.16813814640045166, -0.04694965481758118, -0.26933735609054565, 0.1770639568567276, 0.1285427361726761, -0.014336105436086655, -0.19579806923866272, -0.20668743550777435, 0.09154732525348663, 0.09082643687725067, -0.12486717849969864, -0.16853688657283783, -0.14759378135204315, -0.10058393329381943, 0.14413855969905853, -0.025153322145342827, -0.2251719981431961, -0.028364984318614006, -0.014063239097595215, 0.1667395830154419, -0.15687555074691772, 0.05099007487297058, -0.28211116790771484, -0.11421000212430954, 0.14341403543949127, 0.041185762733221054, -0.05547216907143593, -0.11138186603784561, -0.31377458572387695, 0.26937437057495117, 0.13470067083835602, 0.01069991197437048, -0.06875841319561005, 0.1724991351366043, 0.1915561407804489], [0.20037685334682465, 0.11593030393123627, 0.17710180580615997, 0.23766909539699554, 0.1877450942993164, -0.14688049256801605, -0.13248151540756226, 0.14454162120819092, -0.010392329655587673, 0.11449850350618362, -0.16856087744235992, 0.05045933648943901, -0.10972268879413605, 0.045320481061935425, 0.2765291929244995, 0.10345981270074844, -0.090970978140831, -0.05713104084134102, 0.06642201542854309, 0.19078487157821655, -0.04192252457141876, 0.14242103695869446, -0.030985090881586075, 0.1723352074623108, -0.0406825952231884, 0.052777089178562164, 0.11328155547380447, 0.3117958903312683, -0.17854975163936615, -0.051411036401987076, 0.2591625452041626, -0.20692329108715057, 0.15258537232875824, 0.07945245504379272, 0.1959562599658966, 0.012465190142393112, -0.025570262223482132, 0.011853557080030441, 0.017421528697013855, 0.09378471970558167], [0.06423009932041168, -0.05538831651210785, 0.008558361791074276, -0.02321438491344452, 0.14484114944934845, -0.24217163026332855, -0.15202596783638, 0.018385227769613266, 0.07014619559049606, 0.28297513723373413, -0.216689333319664, -0.1299419403076172, 0.08160125464200974, 0.15643833577632904, 0.018111955374479294, 0.07576166093349457, 0.01873204857110977, 0.006990100257098675, -0.06307187676429749, -0.07158736884593964, -0.061961445957422256, 0.16020911931991577, -0.12090939283370972, 0.03886396810412407, -0.2740194499492645, -0.01566453091800213, 0.19241392612457275, -0.08556131273508072, 0.2541806101799011, 0.011914229951798916, 0.045727502554655075, 0.006387334316968918, 0.027929093688726425, -0.03507307171821594, 0.24673646688461304, 0.1080884337425232, -0.17938578128814697, 0.23116159439086914, 0.36624443531036377, -0.038880713284015656], [0.2081812471151352, -0.01780078001320362, -0.022675884887576103, 0.10450240969657898, -0.02836175262928009, -0.11725570261478424, -0.1665409952402115, 0.20512905716896057, -0.03825487568974495, -0.010651886463165283, -0.1671983003616333, 0.3180353343486786, 0.013817854225635529, -0.23338569700717926, 0.2056606113910675, -0.15191759169101715, 0.17117220163345337, -0.010148306377232075, 0.12916572391986847, -0.034202154725790024, -0.154933363199234, 0.29242274165153503, -0.1517162173986435, 0.045097555965185165, -0.12689802050590515, -0.14337413012981415, 0.2086704820394516, 0.2773852050304413, 0.06595951318740845, 0.001093258149921894, 0.25203704833984375, 0.14098899066448212, 0.20922981202602386, 0.03842383250594139, 0.043102048337459564, -0.30611395835876465, 0.1287766546010971, -0.020833265036344528, -0.07157573103904724, -0.10009009391069412], [0.18448787927627563, 0.248564675450325, -0.03622052073478699, 0.21972300112247467, -0.06292188912630081, 0.1962965428829193, -0.03133048489689827, 0.08824951946735382, 0.09717358648777008, 0.0597221776843071, -0.07431156188249588, 0.172535702586174, 0.0696677565574646, -0.036792587488889694, -0.0862114205956459, 0.25046154856681824, 0.22806993126869202, -0.03487205132842064, 0.09689687192440033, -0.09361294656991959, -0.10125727951526642, 0.15508562326431274, -0.06200326979160309, -0.01080570463091135, -0.028998544439673424, 0.047643858939409256, -0.1862020492553711, 0.120182104408741, 0.18067903816699982, 0.03687899559736252, -0.019804414361715317, 0.24728697538375854, 0.010036409832537174, -0.022995274513959885, -0.13621743023395538, -0.03365543112158775, 0.046196360141038895, 0.18110904097557068, -0.11020642518997192, 0.012541636824607849], [0.15689940750598907, -0.030271248891949654, 0.05432743951678276, 0.2140553593635559, -0.013881008140742779, 0.09061063081026077, 0.11030635982751846, -0.0665702074766159, -0.05980890616774559, -0.10026818513870239, 0.12170154601335526, 0.08426407724618912, -0.050285059958696365, -0.0752469152212143, 0.016736069694161415, 0.3257780969142914, -0.002330484800040722, 0.06618475168943405, 0.03854548931121826, -0.16312825679779053, 0.00710034416988492, 0.055369287729263306, 0.22821027040481567, 0.19918397068977356, -0.09246977418661118, 0.24031110107898712, -0.08874737471342087, 0.12090980261564255, 0.06236908957362175, -0.11591070145368576, 0.27319905161857605, -0.1510731726884842, 0.2736368179321289, 0.046696390956640244, 0.13358570635318756, 0.004753466695547104, -0.1392708271741867, 0.0034882472828030586, -0.13566678762435913, 0.15454871952533722], [-0.023935729637742043, -0.25120383501052856, 0.09416703879833221, 0.06768658757209778, -0.10419360548257828, 0.1941625475883484, 0.2565567195415497, -0.0983799621462822, -0.03595747426152229, 0.008878655731678009, -0.11750822514295578, -0.02764979936182499, -0.1169009655714035, -0.06396108120679855, 0.012491817586123943, 0.145040825009346, 0.21111980080604553, 0.1457027792930603, 0.09702596813440323, 0.2797916531562805, -0.15037906169891357, 0.0224518571048975, 0.07895685732364655, -0.16377435624599457, 0.014835458248853683, 0.11532700806856155, 0.2225218415260315, 0.13385267555713654, 0.1878846287727356, -0.1703566014766693, -0.2771192491054535, -0.11379331350326538, -0.045670781284570694, 0.004412708338350058, 0.2965627610683441, 0.160452738404274, -0.0018407728057354689, 0.3299349248409271, -0.08441181480884552, -0.15563738346099854], [-0.01028443779796362, -0.1623007357120514, -0.1975766271352768, -0.2324945032596588, 0.05500223487615585, 0.1437336504459381, 0.12738512456417084, 0.08996757119894028, -0.04824948310852051, -0.17594139277935028, 0.13381192088127136, 0.2128695696592331, -0.03998280689120293, -0.12355317920446396, -0.008083388209342957, -0.025662994012236595, 0.06337925046682358, -0.09092401713132858, -0.017520764842629433, -0.22898918390274048, -0.02442222647368908, -0.1348266303539276, 0.11991492658853531, 0.07104535400867462, -0.1397239863872528, -0.007854579016566277, -0.08668310195207596, -0.1833103746175766, 0.1862306296825409, -0.03058224730193615, 0.15582819283008575, -0.20330576598644257, 0.10941837728023529, 0.1140066385269165, -0.26775822043418884, -0.04605429619550705, 0.05431801453232765, 0.07590799033641815, -0.14453478157520294, 0.08071158081293106], [0.14401623606681824, 0.17839527130126953, 0.23380807042121887, 0.17329345643520355, -0.03846117854118347, -0.16902947425842285, 0.04401275888085365, 0.2106362283229828, -0.0009161718771792948, 0.13812117278575897, -0.18796251714229584, -0.08774423599243164, 0.004822434391826391, 0.13151130080223083, -0.05380053073167801, 0.029179522767663002, 0.09472504258155823, -0.06735043227672577, -0.009903835132718086, 0.20199674367904663, 0.02348085306584835, 0.10792446881532669, -0.08800704032182693, 0.08141976594924927, -0.0580001026391983, -0.2693703770637512, 0.3407467305660248, 0.04262661188840866, -0.008839311078190804, 0.09864895045757294, -0.20376111567020416, -0.026033593341708183, -0.11164320260286331, 0.19826528429985046, 0.005302644334733486, 0.020115258172154427, 0.04589932784438133, 0.097381591796875, 0.07009359449148178, -0.09767726808786392], [0.07664038985967636, 0.10305618494749069, -0.013705532997846603, -0.030164500698447227, 0.0661734789609909, -0.07050769031047821, 0.21279969811439514, 0.09646587818861008, -0.2538158893585205, -0.106735460460186, -0.021622804924845695, 0.29200249910354614, -0.028944868594408035, -0.20492589473724365, 0.256503701210022, -0.08011144399642944, 0.024597669020295143, -0.13075551390647888, -0.15427418053150177, 0.1864197850227356, 0.049474820494651794, 0.16100086271762848, -0.14236010611057281, -0.01810472086071968, 0.011567963287234306, -0.21578319370746613, 0.0025727173779159784, 0.09161806851625443, -0.02045915089547634, -0.007085602730512619, 0.009205639362335205, -0.13667400181293488, 0.17969569563865662, 0.13739873468875885, -0.29285746812820435, -0.07570953667163849, 0.10584776848554611, 0.014237740077078342, -0.0719512477517128, -0.15176178514957428], [-0.28573498129844666, -0.21216772496700287, 0.10048044472932816, 0.002135560382157564, -0.07160133868455887, -0.07829009741544724, 0.0938493013381958, -0.1826259195804596, -0.35864973068237305, -0.04671373963356018, -0.015149355866014957, -0.11309579759836197, 0.054099682718515396, 0.05074379965662956, -0.05558275058865547, 0.26153501868247986, 0.01475493423640728, -0.017246566712856293, 0.02881511114537716, -0.19724532961845398, 0.13494475185871124, -0.049349941313266754, 0.0879889503121376, 0.09542995691299438, -0.22833921015262604, 0.19045060873031616, 0.02572045475244522, 0.23915207386016846, 0.17112292349338531, -0.15055648982524872, 0.0034236174542456865, -0.1276179999113083, 0.10610853135585785, -0.06434763967990875, 0.18109649419784546, 0.23072807490825653, -0.1890394538640976, 0.11324900388717651, 0.1585233211517334, -0.004780510440468788], [0.08851255476474762, 0.006497678812593222, -0.12591160833835602, -0.10932496190071106, 0.06397608667612076, -0.0513249970972538, -0.21275214850902557, -0.01992122270166874, 0.058426547795534134, 0.04987812414765358, -0.13124050199985504, -0.008311943151056767, -0.1090279221534729, -0.38116583228111267, 0.09716923534870148, -0.0246299896389246, 0.08469313383102417, -0.17543625831604004, 0.03310101479291916, -0.04639572277665138, -0.15251553058624268, 0.3161383271217346, -0.21032807230949402, 0.008106501772999763, -0.2184758335351944, -0.0008437624201178551, 0.11565549671649933, 0.11381750553846359, 0.13381235301494598, 0.06533845514059067, 0.03701957315206528, -0.014351275749504566, 0.010442614555358887, -0.12402988970279694, -0.04715389013290405, -0.07085580378770828, 0.014960629865527153, 0.007295842282474041, 0.11528132110834122, 0.04149108752608299], [0.1661171317100525, 0.10888704657554626, -0.22211673855781555, -0.2724591791629791, 0.16963127255439758, 0.20019195973873138, 0.002766235964372754, -0.0690479502081871, -0.033402763307094574, -0.04467832297086716, -0.1584264039993286, -0.005537735298275948, -0.09203806519508362, -0.29998552799224854, -0.06508777290582657, 0.21825827658176422, -0.12212344259023666, -0.237928569316864, -0.20409777760505676, -0.07492796331644058, -0.0026338982861489058, 0.04694552347064018, -0.1454199254512787, 0.11596870422363281, 0.11241140961647034, 0.00470762001350522, -0.2120179384946823, -0.13212651014328003, -0.23237235844135284, -0.12924882769584656, 0.2585468590259552, -0.24782714247703552, 0.022110125049948692, -0.2700614035129547, -0.23558489978313446, 0.10104841738939285, 0.21195463836193085, -0.22624853253364563, -0.1764717847108841, -0.014378893189132214], [0.025023004040122032, -0.2543119490146637, -0.012315434403717518, 0.1020975410938263, -0.12786418199539185, 0.24475263059139252, 0.1712760627269745, -0.04658526927232742, 0.13717389106750488, 0.11574967950582504, 0.04086909070611, 0.04991007596254349, -0.07401370257139206, 0.06358867883682251, -0.05668308213353157, -0.04542475938796997, 0.11620820313692093, 0.2740497589111328, 0.14648187160491943, 0.12209685891866684, -0.12715891003608704, -0.09825719892978668, 0.20492970943450928, -0.14720554649829865, 0.027073964476585388, 0.24706807732582092, -0.037898071110248566, -0.16183367371559143, -0.012455735355615616, -0.12662556767463684, -0.07487821578979492, 0.009448627009987831, -0.07736480236053467, 0.030681172385811806, -0.005244231782853603, -0.008109024725854397, -0.03253762423992157, -0.1647011786699295, -0.16615548729896545, -0.0606873519718647], [-0.05023001506924629, -0.17057913541793823, -0.20677222311496735, 0.30248671770095825, -0.1360325664281845, -0.02645336650311947, 0.16080519556999207, 0.11458814144134521, -0.09956017136573792, -0.2738858163356781, 0.15743404626846313, 0.16322562098503113, -0.17581020295619965, -0.14998580515384674, 0.03834192454814911, -0.02759208343923092, 0.18830183148384094, 0.11902406066656113, 0.11834773421287537, 0.19971798360347748, -0.0788172259926796, 0.019918574020266533, 0.1995193213224411, 0.14419196546077728, -0.12242969125509262, 0.044545978307724, -0.0016807797364890575, 0.12593139708042145, 0.18314863741397858, -0.18830494582653046, -0.011160952039062977, 0.0034503403585404158, 0.11031149327754974, 0.18735376000404358, 0.11613047122955322, -0.20193475484848022, -0.15812276303768158, 0.05266965553164482, -0.16953636705875397, 0.12957113981246948], [-0.10123080760240555, -0.19323676824569702, 0.1565982699394226, -0.09469970315694809, -0.08588135242462158, 0.22629553079605103, -0.1429653763771057, -0.10462687909603119, -0.03988761454820633, 0.06857765465974808, -0.1496177762746811, -0.10498034954071045, -0.20498791337013245, -0.23178553581237793, -0.05116815119981766, 0.08225367218255997, -0.03541674464941025, -0.1563389003276825, 0.0922042652964592, -0.10420985519886017, -0.09786325693130493, -0.12397218495607376, 0.04979687184095383, 0.09817147254943848, 0.07573913782835007, -0.12218616157770157, 0.02720569632947445, -0.13647784292697906, 0.05855735018849373, 0.19235709309577942, -0.02853158488869667, 0.0871126726269722, -0.05020279809832573, -0.03023223578929901, 0.15620368719100952, -0.19532783329486847, 0.028202887624502182, 0.033649690449237823, 0.01207354199141264, 0.2441815435886383], [0.2010086178779602, 0.013384062796831131, 0.14273028075695038, -0.01711263880133629, 0.05401907116174698, 0.26520195603370667, -0.09775909036397934, -0.00420644786208868, 0.25780147314071655, 0.06257401406764984, 0.009895358234643936, 0.03642464429140091, 0.12063736468553543, -0.026099232956767082, 0.032899901270866394, -0.05717959627509117, -0.17927195131778717, 0.2019384354352951, 0.10466478019952774, -0.03796428442001343, -0.22806760668754578, 0.049563951790332794, 0.08971206843852997, -0.008657350204885006, 0.018618838861584663, 0.12838110327720642, 0.019783228635787964, 0.0900997668504715, 0.22375069558620453, -0.0012826460879296064, 0.009201000444591045, 0.10052860528230667, -0.21925927698612213, -0.183778315782547, -0.09930559992790222, -0.1761077344417572, -0.01885337568819523, 0.11117713153362274, 0.02189633436501026, 0.034160397946834564], [0.15988890826702118, 0.07198316603899002, -0.05766616016626358, 0.25507837533950806, -0.2405640333890915, 0.1280694454908371, -0.02445145510137081, 0.0819040983915329, -0.11555995792150497, -0.1776985377073288, -0.1244695857167244, 0.07568635791540146, -0.17288492619991302, -0.10061637312173843, 0.09072276949882507, 0.17968586087226868, 0.12176406383514404, -0.056656528264284134, 0.15746526420116425, 0.10040488839149475, 0.18942007422447205, 0.03993386775255203, -0.19741135835647583, -0.04065652936697006, 0.06062312796711922, -0.21272796392440796, 0.048824530094861984, 0.014762882143259048, -0.06066426262259483, -0.08172719925642014, 0.1361730843782425, -0.22081653773784637, 0.24249659478664398, -0.052181072533130646, -0.14364472031593323, -0.27416741847991943, -0.028860263526439667, -0.062427591532468796, -0.4059545695781708, 0.06944447755813599], [-0.10994307696819305, -0.009729176759719849, 0.051542606204748154, -0.10035331547260284, 0.038899023085832596, 0.19046901166439056, -0.04858739301562309, -0.023345941677689552, 0.06733833998441696, -0.15024375915527344, 0.13847045600414276, 0.061345599591732025, -0.20244407653808594, -0.051287900656461716, -0.07181087881326675, 0.2888531982898712, -0.04234105721116066, -0.10165698826313019, 0.01972464844584465, -0.03643506020307541, -0.10559482872486115, 0.045598261058330536, 0.24943898618221283, 0.13298743963241577, -0.04244823008775711, -0.03192058578133583, -0.025887371972203255, 0.2213933914899826, 0.15052711963653564, 0.15707656741142273, 0.15028062462806702, 0.03698037192225456, 0.18256115913391113, 0.06417344510555267, 0.11905115842819214, -0.1524893045425415, -0.21119707822799683, 0.009412141516804695, 0.07915709167718887, 0.22374793887138367], [-0.1018771156668663, -0.18220043182373047, -0.10324182361364365, 0.16363190114498138, -0.039222247898578644, -0.13532251119613647, -0.0531124547123909, 0.07650426030158997, 0.005359941627830267, 0.07206518948078156, -0.030176928266882896, -0.03503943234682083, 0.21260659396648407, 0.05065856873989105, -0.17222140729427338, 0.01674204133450985, 0.045577820390462875, 0.02793682925403118, -0.057543717324733734, 0.15311014652252197, -0.16375717520713806, 0.235236257314682, 0.0016669398173689842, -0.007734435610473156, -0.20925526320934296, 0.1852698028087616, -0.11828968673944473, 0.11321204155683517, -0.1647924929857254, 0.017037808895111084, 0.03586192801594734, 0.035851605236530304, 0.04876251891255379, -0.002165550831705332, 0.02983435057103634, -0.029255105182528496, 0.19435885548591614, -0.1336480975151062, 0.1725625991821289, -0.16183532774448395], [0.011016643606126308, 0.05265219137072563, 0.09872180223464966, 0.16241410374641418, -0.16205903887748718, -0.16659466922283173, 0.05054895952343941, 0.06908468902111053, -0.19895517826080322, 0.0873354896903038, 0.15176184475421906, -0.0013395791174843907, 0.1869136542081833, 0.14264366030693054, 0.02937728352844715, -0.022655492648482323, 0.151564359664917, 0.26137542724609375, 0.08061118423938751, -0.07963863760232925, 0.17858020961284637, -0.09218057990074158, 0.18918642401695251, 0.021546214818954468, -0.07031810283660889, 0.11403842270374298, 0.049239467829465866, 0.3041994571685791, 0.006675667129456997, -0.026563454419374466, -0.14617829024791718, 0.1561153382062912, -0.057844266295433044, 0.14041946828365326, 0.047173019498586655, 0.24980835616588593, -0.037712156772613525, 0.0790664404630661, 0.09212271124124527, -0.06777062267065048], [-0.138941690325737, -0.008969680406153202, -0.1824028193950653, -0.08097408711910248, -0.18727999925613403, 0.08347659558057785, -0.14059625566005707, -0.22432126104831696, 0.1255960315465927, 0.21977975964546204, -0.0615258552134037, 0.05177716165781021, 0.19004718959331512, 0.028933674097061157, -0.029875462874770164, 0.011366477236151695, -0.12745751440525055, 0.1047961413860321, 0.11790001392364502, -0.16606789827346802, -0.02479211613535881, 0.2789502441883087, -0.0970764309167862, -0.015167121775448322, -0.14281848073005676, 0.11327654868364334, -0.19653847813606262, -0.22443948686122894, 0.11485087126493454, 0.027563076466321945, -0.006418462842702866, 0.25015559792518616, 0.13147875666618347, -0.2620989680290222, 0.0756039097905159, -0.03606150299310684, 0.20078659057617188, 0.18930840492248535, 0.12843827903270721, -0.04982610419392586], [0.06734207272529602, -0.04460127651691437, 0.04440676420927048, 0.1611228585243225, -0.021082846447825432, 0.43386581540107727, 0.23869258165359497, -0.14644677937030792, 0.02020305022597313, -0.3017197251319885, 0.129227876663208, 0.09420659393072128, 0.04055362939834595, -0.25959256291389465, 0.01940724439918995, 0.2149217128753662, 0.10823144763708115, -0.0996173620223999, -0.17167913913726807, -0.21842126548290253, 0.0007711517973802984, -0.1465592384338379, 0.04985067993402481, 0.018725723028182983, 0.25524821877479553, 0.10680930316448212, -0.14329837262630463, 0.20094449818134308, -0.01959305815398693, 0.21732494235038757, 0.06372770667076111, -0.09531547129154205, 0.1579631268978119, -0.014630492776632309, 0.001195032731629908, 0.09569817036390305, 0.14285120368003845, 0.025973070412874222, -0.04014536738395691, 0.19507311284542084], [-0.0885830745100975, -0.03101143054664135, 0.19627873599529266, -0.02289094775915146, 0.16714604198932648, -0.10032882541418076, -0.09268070757389069, -0.08828820288181305, 0.17088374495506287, -0.08186186105012894, -0.10814693570137024, -0.009274063631892204, -0.22725285589694977, -0.05292431265115738, 0.12096882611513138, -0.255093514919281, -0.03307724744081497, -0.1273065060377121, -0.03145894780755043, -0.00614510290324688, -0.23675000667572021, 0.02435125969350338, -0.1635764092206955, -0.1565246433019638, 0.05981328338384628, -0.22927653789520264, 0.05582505837082863, -0.14126181602478027, -0.08541484922170639, 0.10317803919315338, 0.006702619604766369, -0.16208846867084503, -0.04541132226586342, -0.18336325883865356, -0.053798381239175797, -0.1998368501663208, 0.062276922166347504, -0.02384628728032112, -0.08593948930501938, 0.2016448676586151], [-0.3130289316177368, 0.10292220115661621, -0.30885908007621765, -0.26087644696235657, 0.13180509209632874, 0.16376611590385437, 0.12667982280254364, 0.13067102432250977, 0.11151453107595444, -0.012421662919223309, -0.07361201196908951, 0.2151813954114914, 0.17878004908561707, -0.11004529893398285, -0.15345509350299835, 0.31316012144088745, 0.057573102414608, -0.05666198953986168, -0.133333221077919, 0.018559275195002556, 0.08106890320777893, -0.2170175164937973, 0.0411999374628067, -0.11660285294055939, -0.12240660935640335, 0.06088694557547569, 0.05358424037694931, -0.18583527207374573, 0.10790890455245972, 0.1690400242805481, 0.016088813543319702, -0.012033317238092422, -0.023137595504522324, 0.16781064867973328, -0.18599644303321838, 0.08874788880348206, 0.10620339959859848, 0.15515349805355072, -0.07354538887739182, -0.11758305132389069], [-0.1419626921415329, -0.15063416957855225, 0.2451912760734558, 0.23215243220329285, 0.09573659300804138, 0.013855790719389915, 0.003286700928583741, -0.34573274850845337, 0.0465736910700798, 0.000278506544418633, 0.058621954172849655, -0.05462534725666046, -0.16114386916160583, -0.010865334421396255, 0.02480856142938137, 0.1399691104888916, 0.011577768251299858, -0.025177814066410065, 0.09372534602880478, 0.1281171292066574, -0.10927010327577591, -0.0452115423977375, 0.063540980219841, 0.0038347868248820305, -0.01064606849104166, 0.14647670090198517, -0.1695333868265152, -0.1843094378709793, -0.05917956680059433, 0.018691791221499443, 0.08365469425916672, 0.1702098548412323, 0.23504579067230225, -0.10497092455625534, 0.17841105163097382, -0.10396329313516617, -0.0297181885689497, -0.058848462998867035, 0.03604712337255478, 0.2085423618555069], [0.10129712522029877, -0.133584663271904, 0.21695838868618011, -0.12960083782672882, 0.13748787343502045, 0.026881013065576553, -0.08376672118902206, 0.02141966111958027, 0.1264376938343048, 0.04626796767115593, -0.16706298291683197, -0.06152243912220001, -0.09537873417139053, -0.07730963081121445, -0.026526564732193947, 0.0485597662627697, 0.0862898901104927, -0.04280645027756691, 0.10828188061714172, 0.22865450382232666, -0.09842268377542496, 0.00011590862413868308, -0.22695448994636536, -0.16014759242534637, -0.06762749701738358, -0.13680635392665863, 0.026797404512763023, -0.1901242882013321, 0.10745677351951599, 0.057661984115839005, -0.011776690371334553, -0.0945887491106987, -0.08833078294992447, -0.14381401240825653, 0.2703295350074768, -0.019463028758764267, 0.055104151368141174, 0.2566457688808441, -0.15010090172290802, 0.11461567133665085], [-0.25381287932395935, -0.14765514433383942, -0.13913679122924805, 0.30150285363197327, -0.21615928411483765, 0.10024486482143402, -0.06083914265036583, 0.05300160497426987, -0.01167376060038805, 0.18174168467521667, -0.15549182891845703, 0.3245040774345398, 0.09614741802215576, -0.09444024413824081, -0.19619770348072052, 0.15344324707984924, 0.3695090413093567, 0.005770930089056492, 0.12161923199892044, -0.0087840361520648, 0.016697674989700317, 0.14179033041000366, -0.3282902240753174, -0.13038794696331024, -0.098744697868824, -0.07434172928333282, -0.06749533861875534, 0.25052398443222046, -0.0730871930718422, 0.11385173350572586, -0.017553262412548065, 0.051769305020570755, 0.13791267573833466, -0.1344088912010193, 0.138856440782547, -0.04847800359129906, 0.05156769976019859, 0.06145627051591873, -0.22084546089172363, 0.03458087146282196], [-0.0348016619682312, -0.18330472707748413, 0.056841813027858734, 0.21464647352695465, -0.18268077075481415, 0.08108911663293839, 0.0961688682436943, -0.1033267006278038, -0.09465168416500092, -0.055661700665950775, -0.039509307593107224, 0.1573166400194168, 0.01780630648136139, -0.036002133041620255, 0.051723431795835495, 0.09927401691675186, -0.018605872988700867, 0.10195278376340866, 0.25081339478492737, 0.1400052160024643, -0.035305675119161606, -0.047466084361076355, 0.07145965844392776, -0.00811302475631237, 0.01208861917257309, 0.17458872497081757, -0.18392202258110046, -0.0653923898935318, 0.004560111090540886, -0.17715424299240112, 0.08106806129217148, 0.11479220539331436, 0.1065264642238617, -0.0465715266764164, -0.12014409154653549, -0.13494129478931427, -0.1081114336848259, -0.1181756779551506, -0.17977187037467957, -0.11853441596031189], [0.058032602071762085, -0.030657220631837845, 0.09000809490680695, 0.28256163001060486, -0.12612225115299225, 0.17330411076545715, 0.26485782861709595, 0.0203908272087574, -0.22525174915790558, -0.24982769787311554, 0.25219810009002686, 0.10405838489532471, 0.12892647087574005, 0.04062483087182045, -0.028518712148070335, 0.0640782043337822, 0.009235311299562454, 0.1881028711795807, 0.0027495943941175938, -0.1842268854379654, 0.03583930432796478, 0.0792081356048584, 0.26361361145973206, 0.09829983115196228, -0.15515439212322235, 0.20250555872917175, -0.12790349125862122, 0.21689248085021973, -0.09022674709558487, 0.020795905962586403, -0.1589687317609787, 0.09173133969306946, 0.019327757880091667, 0.1421024352312088, 0.03175581246614456, -0.03974256291985512, -0.04989016801118851, -0.05505124852061272, -0.02218262478709221, -0.125396728515625], [-0.057231057435274124, -0.09218344837427139, 0.0719083696603775, -0.17218105494976044, 0.18198618292808533, 0.1256064623594284, 0.04119882360100746, -0.1312369853258133, 0.12624774873256683, 0.09483886510133743, 0.11071549355983734, -0.20341505110263824, -0.09161237627267838, -0.028396664187312126, 0.029772266745567322, -0.027587300166487694, -0.029678042978048325, 0.0974014401435852, -0.05841509997844696, 0.17443130910396576, 0.05820619687438011, -0.12239864468574524, 0.08869138360023499, -0.16227653622627258, -0.07794477790594101, 0.07105276733636856, -0.061804886907339096, -0.17572180926799774, 0.15018247067928314, -0.1101510152220726, -0.24650099873542786, -0.19158527255058289, -0.09463681280612946, -0.0719827339053154, 0.008550459519028664, 0.08784262835979462, 0.10165619105100632, 0.3075871467590332, -0.10922843217849731, 0.2105185091495514], [0.10391972959041595, 0.3207029402256012, 0.06275452673435211, 0.12017722427845001, -0.01522887870669365, 0.10426268726587296, 0.011385096237063408, -0.12581278383731842, -0.12637735903263092, 