{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_8", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputConcat"}, "name": "inputConcat", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 150, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[-0.0387389212846756, 0.22888408601284027, -0.36758530139923096, -0.09037911891937256, 0.3292791247367859, 0.25573495030403137, 0.0786510482430458, -0.07791513949632645, 0.4026055335998535, 0.08198641985654831, 0.4148273468017578, -0.10813270509243011, -0.3624371588230133, 0.11325007677078247, 0.03160647675395012, 0.11165466904640198, 0.16800686717033386, -0.1037239134311676, 0.21246090531349182, -0.3588501811027527, 0.43425318598747253, -0.156389057636261, -0.6506158709526062, -0.6779856085777283, -0.31366100907325745, 0.11512014269828796, -0.2412673681974411, 0.48531675338745117, -0.2592388689517975, -0.48061299324035645, -0.4672253429889679, 0.049623727798461914, 0.08747251331806183, 0.04834669828414917, -0.01854274794459343, -0.014677252620458603, 0.08164513111114502, 0.28666049242019653, 0.09421911090612411, 0.11212573945522308, 0.37528523802757263, -0.2805631458759308, 0.10432355105876923, 0.012652507051825523, 0.1489286571741104, -0.4766603708267212, 0.2178345024585724, 0.2528369426727295, 0.2771965265274048, -0.4283859133720398, 0.22324822843074799, 0.1658254712820053, -0.028183525428175926, 0.24638685584068298, 0.22935014963150024, 0.016746532171964645, 0.10333366692066193, 0.3672195374965668, 0.18923473358154297, -0.24532191455364227, 0.7030678987503052, -0.17663085460662842, -0.015872357413172722, -0.24174068868160248, 0.06025496870279312, 0.0656932145357132, 0.19781658053398132, -0.010712635703384876, -0.5917520523071289, -0.07657831162214279, -0.2812166213989258, 0.27555593848228455, -0.45812681317329407, 0.21973839402198792, -0.3275683522224426, 0.4327647387981415, -0.3268318474292755, -0.45387405157089233, 0.21924713253974915, 0.2530425786972046, 0.28822439908981323, -0.30751165747642517, 0.3150607943534851, 0.12037567049264908, -0.3769943416118622, 0.22423964738845825, 0.27393198013305664, -0.21337148547172546, -0.7414292693138123, -0.3138987123966217, 0.1009691059589386, -0.2896544933319092, -0.3532075583934784, -0.2184082567691803, -0.07603715360164642, 0.1672673374414444, -0.6203412413597107, 0.12516440451145172, -0.26275455951690674, -0.2815936505794525, -0.07957163453102112, -0.37943777441978455, -0.21828939020633698, 0.2640860676765442, 0.43741244077682495, 0.0018560256576165557, 0.057965945452451706, 0.48259854316711426, 0.5670978426933289, 0.43202733993530273, -0.07794863730669022, 0.09334807097911835, -0.029547331854701042, -0.31517234444618225, 0.09693627059459686, 0.09073454886674881, -0.40467187762260437, 0.22633610665798187, 0.2252224087715149, -0.17242366075515747, 0.08163096010684967, 0.2777751088142395, -0.018056627362966537, -0.031275197863578796, -0.07206279039382935, 0.26399025321006775, -0.18649941682815552, 0.6928858160972595, -0.2826354205608368, 0.35179534554481506, -0.23870493471622467, -0.7890081405639648, 0.25537776947021484, 0.26155000925064087, 0.03368038311600685, 0.14604903757572174, 0.18447944521903992, 0.08041354268789291, -0.020366141572594643, -0.38644522428512573, -0.09019148349761963, -0.3129006028175354, 0.28042876720428467, -0.14307397603988647, 0.461946576833725, -0.2636658549308777, -0.11447501927614212, -0.06312401592731476, -0.3241587281227112, -0.05513672158122063], [-0.5100072026252747, 0.03554243966937065, -0.0707118883728981, 0.15061841905117035, -0.4230559170246124, 0.34620267152786255, 0.35535621643066406, -0.12500117719173431, 0.18405258655548096, -0.3249575197696686, -0.35605403780937195, 0.649043619632721, 0.11559857428073883, 0.02196522057056427, 0.12589429318904877, -0.371053010225296, 0.11137809604406357, 0.033133916556835175, -0.4812837243080139, -0.04448176175355911, -0.17612498998641968, 0.08626866340637207, 0.39270928502082825, 0.36369165778160095, 0.06268223375082016, 0.38605988025665283, 0.30702951550483704, -0.3462587594985962, 0.028425203636288643, 0.3644474148750305, -0.2297133505344391, 0.2873309552669525, 0.10829300433397293, -0.06497827172279358, 0.1119527667760849, 0.08714796602725983, 0.46049368381500244, 0.02542472630739212, 0.024829670786857605, 0.19578631222248077, -0.1410391479730606, 0.2597101628780365, -0.11938532441854477, -0.09533701837062836, 0.2665860950946808, 0.34924501180648804, -0.016885502263903618, -0.11984658241271973, -0.16684551537036896, 0.40090781450271606, 0.25401535630226135, -0.14490720629692078, 0.18805871903896332, 0.3759114146232605, 0.022700652480125427, 0.16799643635749817, -0.11865527927875519, -0.4123542308807373, 0.22165453433990479, -0.30322155356407166, -0.49396705627441406, -0.15999068319797516, -0.23880638182163239, -0.11270446330308914, 0.4514499604701996, 0.5547829270362854, -0.41677895188331604, 0.19467473030090332, -0.2121458500623703, 0.5392019152641296, -0.16484297811985016, -0.5424078106880188, 0.5602916479110718, -0.4738040268421173, 0.1555299162864685, -0.4222537875175476, 0.4333590269088745, -0.31010016798973083, -0.5737592577934265, -0.4327947497367859, -0.23429618775844574, 0.26475805044174194, -0.1924484223127365, -0.23122714459896088, 0.11466899514198303, -0.40114590525627136, -0.37004584074020386, -0.17055293917655945, 0.46555468440055847, -0.3580752909183502, -0.09777887165546417, -0.330092191696167, 0.05793141573667526, 0.21408730745315552, -0.19946815073490143, -0.29334351420402527, 0.23124192655086517, -0.4282224774360657, -0.10439267754554749, -0.19010260701179504, 0.04461264982819557, 0.1996847689151764, 0.4175320863723755, -0.07512101531028748, 0.12878115475177765, -0.15075808763504028, 0.03437890484929085, -0.2838907539844513, -0.3576669991016388, -0.032194748520851135, -0.28727367520332336, 0.10891000181436539, -0.2531058192253113, -0.01835768297314644, -0.25086212158203125, 0.09392229467630386, 0.1748872995376587, 0.12615935504436493, -0.11883185803890228, 0.06190115958452225, -0.1796305924654007, -0.7516751289367676, 0.412404328584671, 0.3345719873905182, 0.2784859836101532, 0.17079687118530273, -0.28978508710861206, -0.42898157238960266, -0.11485373228788376, 0.20243164896965027, 0.6224978566169739, 0.3649177551269531, 0.46876639127731323, 0.23979045450687408, -0.4862065017223358, -0.3530312776565552, -0.5243964195251465, 0.23305296897888184, -0.47678542137145996, -0.04414835199713707, -0.05368904769420624, -0.015491705387830734, 0.16688580811023712, 0.1960882842540741, -0.25400084257125854, -0.011075331829488277, 0.3997182548046112, 0.0710453912615776, -0.4037673771381378, 0.23964479565620422], [0.46223706007003784, -0.19625723361968994, -0.10566560924053192, 0.5131269693374634, -0.1263301819562912, 0.07970654219388962, 0.38865453004837036, 0.15142317116260529, -0.05051731318235397, -0.130360946059227, -0.41168200969696045, -0.28654035925865173, -0.07244066148996353, -0.23775307834148407, 0.349744588136673, -0.04412287473678589, -0.1873854100704193, -0.04008481651544571, -0.18175210058689117, 0.14476080238819122, -0.020283900201320648, -0.2096455842256546, -0.1966353803873062, -0.046295925974845886, 0.6145834922790527, 0.23960720002651215, -0.01137434970587492, 0.1285439282655716, -0.044357992708683014, -0.013176489621400833, -0.22144336998462677, -0.5856502056121826, 0.329952210187912, 0.32323509454727173, -0.05447479709982872, 0.3725469410419464, -0.5392886400222778, -0.1638789176940918, -0.08707546442747116, 0.05837171524763107, 0.18391111493110657, 0.335365891456604, 0.15356098115444183, -0.14219403266906738, -0.4022284150123596, -0.022703254595398903, -0.24771946668624878, 0.0745178759098053, -0.3573536276817322, -0.06416061520576477, -0.17749477922916412, 0.5772257447242737, 0.19206486642360687, -0.44880348443984985, -0.16306646168231964, -0.09648992866277695, -0.18094979226589203, 0.4080919027328491, -0.40680578351020813, 0.15922382473945618, 0.04997986555099487, 0.3004801869392395, -0.16716670989990234, 0.10046062618494034, 0.008300808258354664, -0.33825045824050903, 0.11636621505022049, -0.3649370074272156, 0.15760090947151184, -0.0192984901368618, 0.23527202010154724, 0.43214312195777893, -0.20217253267765045, 0.43693336844444275, -0.019089631736278534, -0.18080861866474152, -0.29659175872802734, 0.3746411204338074, 0.3354489207267761, 0.3314472436904907, -0.24486438930034637, -0.1477930247783661, -0.12078260630369186, 0.22501692175865173, 0.34762656688690186, 0.08603423833847046, -0.3440311551094055, 0.18196721374988556, -0.03646918758749962, 0.29342448711395264, -0.05089182034134865, 0.16417258977890015, -0.3073698878288269, -0.36609047651290894, 0.12245719879865646, 0.4941900968551636, 0.08142490684986115, 0.09529038518667221, 0.4913094937801361, 0.2515561282634735, 0.5210937857627869, 0.18918663263320923, -0.15478460490703583, 0.2037479281425476, 0.03486553207039833, -0.3492735028266907, -0.030525142326951027, -0.3820455074310303, -0.3424634635448456, 0.0319644920527935, 0.3814925253391266, 0.4062265157699585, 0.53375244140625, 0.11799690127372742, 0.469036728143692, -0.06989643722772598, -0.6002992987632751, -0.35565462708473206, 0.031811680644750595, 0.5313502550125122, 0.22774933278560638, 0.17755910754203796, -0.0722123384475708, -0.055411115288734436, -0.222051739692688, 0.13285042345523834, 0.4653817415237427, -0.2028430998325348, 0.6567586660385132, 0.446547269821167, -0.28920987248420715, 0.3493618071079254, -0.28426674008369446, 0.2060997635126114, 0.5238997340202332, 0.16018135845661163, 0.4810256063938141, -0.040983133018016815, 0.340455561876297, 0.1923680454492569, -0.17513462901115417, 0.19792763888835907, -0.3201272189617157, -0.07682328671216965, -0.07422301173210144, 0.7624978423118591, -0.3117189407348633, -0.40963098406791687, -0.0784250870347023, -0.19868908822536469], [0.06959307938814163, -0.09607823193073273, -0.15654639899730682, -0.4767830967903137, -0.41683876514434814, 0.07030132412910461, -0.35843631625175476, 0.19951249659061432, -0.2011309266090393, -0.28668537735939026, 0.15124475955963135, -0.09778810292482376, 0.17925789952278137, 0.32144543528556824, -0.5120543241500854, 0.28752169013023376, 0.5400049090385437, -0.31592562794685364, 0.3660178482532501, 0.22182023525238037, 0.46749019622802734, 0.32841163873672485, -0.08886681497097015, -0.39310428500175476, -0.40543636679649353, 0.08086226880550385, -0.2305859476327896, 0.08950237929821014, -0.4027596712112427, -0.32609790563583374, 0.11424262076616287, 0.4228823184967041, -0.41645291447639465, 0.4059949219226837, 0.23454754054546356, -0.2335900068283081, 0.2151637226343155, 0.14893971383571625, -0.32930606603622437, -0.1491324007511139, 0.36534103751182556, -0.24649962782859802, -0.268958181142807, 0.0382978655397892, 0.8665870428085327, -0.027663635089993477, 0.30341917276382446, -0.0980629101395607, 0.3197306990623474, 0.14460116624832153, -0.16813619434833527, -0.3611941933631897, -0.19546641409397125, 0.17324195802211761, 0.13808336853981018, -0.13389667868614197, 0.406147301197052, 0.0028519900515675545, -0.23030732572078705, -0.018133725970983505, -0.04359222576022148, 0.1368427872657776, 0.3400627672672272, 0.18145878612995148, -0.10940174013376236, -0.28420498967170715, 0.086158886551857, 0.13649193942546844, -0.2611205577850342, 0.13462978601455688, 0.22649846971035004, -0.04630284383893013, -0.1636507213115692, -0.3787677586078644, 0.5563861131668091, 0.4746452867984772, -0.002048478228971362, -0.1833861768245697, -0.1779368817806244, -0.5422213077545166, 0.22519733011722565, 0.28582683205604553, -0.048023004084825516, 0.10644834488630295, -0.019621385261416435, -0.007210664916783571, 0.6128801107406616, -0.41799336671829224, -0.20265957713127136, -0.6254613995552063, 0.08671624213457108, -0.2016305774450302, 0.442705363035202, -0.21689343452453613, 0.11345468461513519, -0.18886394798755646, 0.07661797851324081, 0.3113916218280792, 0.11358394473791122, -0.028498362749814987, -0.47375357151031494, -0.22350871562957764, -0.14451315999031067, -0.3707158863544464, 0.0837954729795456, 0.3522632420063019, -0.09171301871538162, 0.04132488742470741, 0.4571493864059448, -0.199571892619133, -0.4576208293437958, 0.46036821603775024, -0.17587020993232727, -0.0708751231431961, -0.07800911366939545, 0.5020735263824463, 0.07922212034463882, 0.23745298385620117, 0.5310456156730652, -0.07338250428438187, -0.23275157809257507, 0.33363378047943115, -0.11656880378723145, 0.5650324821472168, 0.11556007713079453, 0.21130229532718658, -0.3929990828037262, 0.08040142059326172, -0.47386306524276733, -0.5204953551292419, 0.42937564849853516, -0.46548065543174744, 0.016577720642089844, -0.08492470532655716, -0.3790903687477112, 0.15793530642986298, 0.2871743440628052, -0.3170876204967499, -0.258510023355484, -0.1544511765241623, -0.2213388830423355, 0.08262717723846436, 0.12079738080501556, 0.2592616379261017, 0.4730377495288849, -0.5814446210861206, 0.20992161333560944, -0.059685349464416504, -0.1626702845096588, -0.5964391231536865], [-0.30524641275405884, 0.42764389514923096, 0.48271575570106506, -0.11579930782318115, 0.14887498319149017, 0.5044273734092712, 0.3568475544452667, -0.44900667667388916, 0.14835137128829956, 0.4613434374332428, 0.11423281580209732, 0.3074004352092743, -0.3556585907936096, -0.0896638035774231, 0.023080967366695404, -0.24935872852802277, 0.09325610846281052, 0.12913741171360016, 0.03579451143741608, 0.03080669231712818, -0.016735853627324104, -0.020000267773866653, 0.16469040513038635, 0.08071335405111313, -0.04335227981209755, -0.2186097502708435, 0.20761781930923462, -0.09554717689752579, 0.07272777706384659, 0.2645651400089264, 0.17810146510601044, -0.30280667543411255, 0.3697105646133423, -0.36653682589530945, 0.24523673951625824, 0.23923887312412262, -0.027297131717205048, -0.6318675875663757, -0.009490078315138817, 0.2004823237657547, -0.31182268261909485, 0.14007291197776794, 0.29352474212646484, 0.3407171964645386, -0.20036308467388153, -0.08960970491170883, 0.5068004131317139, 0.39383813738822937, -0.37705132365226746, -0.40234920382499695, -0.366733580827713, 0.0997612327337265, 0.3464355766773224, 0.15405330061912537, 0.4075116217136383, 0.6403120160102844, -0.6330199837684631, -0.21587064862251282, 0.35290470719337463, 0.3325114846229553, -0.19709987938404083, -0.1254357397556305, -0.1935402899980545, -0.03661033883690834, -0.28707531094551086, 0.5533632636070251, 0.004078384954482317, -0.37616315484046936, -0.3529527485370636, -0.37745603919029236, 0.0627470314502716, -0.020447740331292152, -0.3264673054218292, 0.07933623343706131, -0.13032405078411102, -0.2875773310661316, 0.4439769387245178, -0.10917599499225616, -0.11620230972766876, 0.11150357127189636, -0.04208087921142578, 0.02301514707505703, 0.5765091776847839, -0.40913280844688416, 0.0330532044172287, 0.3105691075325012, -0.046231064945459366, 0.2451305389404297, -0.31711435317993164, -0.14187845587730408, 0.0010060359491035342, -0.09149518609046936, -0.32485076785087585, -0.33607277274131775, -0.13699892163276672, -0.09815115481615067, -0.04463734105229378, -0.20415151119232178, -0.3264545798301697, -0.31459763646125793, 0.015785440802574158, 0.13215066492557526, 0.11346960812807083, 0.16270802915096283, -0.2695133686065674, -0.2530839443206787, -0.2756795287132263, -0.7059417963027954, 0.12135256081819534, 0.3876664340496063, 0.28210312128067017, -0.5211780667304993, 0.2357458919286728, 0.4464583694934845, 0.18776488304138184, -0.6461930871009827, -0.3685031533241272, 0.24366100132465363, -0.6824673414230347, 0.3224952816963196, -0.1316768378019333, -0.37395429611206055, -0.12448125332593918, -0.35629215836524963, 0.22625955939292908, 0.06817368417978287, -0.03425666317343712, 0.018886851146817207, 0.11483130604028702, -0.06855645775794983, 0.011310642585158348, -0.12673555314540863, 0.4135802984237671, 0.522680938243866, -0.3032418489456177, -0.2259311079978943, -0.6654348373413086, 0.05103342980146408, -0.02494039013981819, -0.15739533305168152, 0.14281411468982697, -0.3575606942176819, 0.13772602379322052, -0.4921242594718933, -0.32949700951576233, 0.053590696305036545, 0.17058514058589935, 0.29737719893455505, -0.24986043572425842, 0.3902404308319092], [0.19864875078201294, -0.49593716859817505, -0.49059024453163147, 0.3721736967563629, -0.01181344036012888, -0.3638101816177368, 0.3924626410007477, 0.39593321084976196, -0.26403361558914185, -0.32039448618888855, -0.10926507413387299, 0.2638944983482361, 0.23463322222232819, 0.08642208576202393, 0.3198342025279999, -0.30492305755615234, -0.4076594114303589, 0.12909623980522156, -0.4757274389266968, -0.1047968938946724, -0.058840204030275345, -0.5986133813858032, -0.1256304830312729, 0.1974273920059204, 0.1912480890750885, 0.17197562754154205, -0.3419763743877411, 0.3516317307949066, -0.09359065443277359, 0.2391263097524643, 0.00248132785782218, 0.017443260177969933, 0.305639386177063, 0.33250659704208374, -0.47246190905570984, -0.17144683003425598, 0.13320380449295044, 0.5759609341621399, 0.16048508882522583, -0.46736499667167664, 0.38733869791030884, 0.7172375917434692, -0.3060120940208435, 0.17789466679096222, -0.1325281411409378, -0.08163797855377197, 0.2096337527036667, 0.0021702037192881107, -0.21626973152160645, 0.17366714775562286, 0.10705547779798508, 0.37350955605506897, -0.5738480687141418, -0.46289676427841187, -0.17399883270263672, -0.43064695596694946, 0.44497230648994446, 0.2632021903991699, -0.28216707706451416, -0.12400949746370316, -0.3359198570251465, 0.30539488792419434, -0.17434577643871307, 0.021462231874465942, 0.6398223042488098, -0.3845159113407135, -0.22321204841136932, 0.11823885142803192, -0.32524025440216064, 0.40780311822891235, 0.14009921252727509, 0.07468876987695694, 0.1576407104730606, -0.16893182694911957, 0.07668937742710114, 0.08500123769044876, -0.2464102804660797, -0.14604775607585907, -0.2241729348897934, 0.08274533599615097, -0.35821351408958435, -0.48363128304481506, -0.6545003652572632, 0.807242751121521, 0.033016566187143326, -0.4233818054199219, -0.3735101819038391, -0.07521425932645798, 0.200689896941185, -0.18484312295913696, -0.11298652738332748, -0.2817787528038025, -0.20231346786022186, 0.3736325204372406, 0.11035437881946564, 0.19591431319713593, 0.15783695876598358, -0.2700115144252777, 0.10537916421890259, 0.3805607557296753, -0.28994908928871155, 0.027861518785357475, -0.3219989240169525, 0.29544660449028015, 0.015172370709478855, -0.30325543880462646, -0.0631018653512001, 0.2075817883014679, -0.5232489705085754, 0.16274185478687286, -0.26431804895401, -0.2657994329929352, -0.400221049785614, -0.2991742193698883, -0.7338375449180603, 0.17119689285755157, 0.20475831627845764, -0.32068565487861633, 0.40354564785957336, 0.24888718128204346, 0.288951575756073, -0.30253028869628906, 0.2605746388435364, -0.17699934542179108, 0.26258140802383423, -0.07468698918819427, -0.3344363272190094, -0.10968605428934097, 0.3165014386177063, 0.7489944696426392, -0.19291174411773682, 0.439174622297287, 0.014080225490033627, -0.32886701822280884, -0.31253501772880554, -0.4184264540672302, 0.11251460015773773, -0.40964725613594055, 0.11098787933588028, -0.279116690158844, 0.24784167110919952, 0.5028023719787598, -0.13360939919948578, 0.35658836364746094, 0.0818524956703186, 0.3594815731048584, -0.1370362639427185, -0.13612177968025208, 0.20204204320907593, 0.2875654697418213], [0.13861733675003052, -0.48963430523872375, 0.20178714394569397, -0.11352815479040146, -0.07094252109527588, 0.12362327426671982, 0.13485954701900482, -0.20971466600894928, -0.22877824306488037, -0.018301619216799736, -0.2840022146701813, 0.41126495599746704, 0.14001663029193878, -0.6313125491142273, -0.38371965289115906, 0.5628906488418579, 0.7045506238937378, 0.0861353874206543, -0.13461779057979584, -0.26339995861053467, 0.4683392643928528, 0.4731154143810272, -0.38347628712654114, -0.10228660702705383, 0.3066483736038208, 0.0035317495930939913, -0.027244271710515022, 0.23735056817531586, -0.2956155836582184, 0.08800694346427917, -0.15243873000144958, -0.11498234421014786, 0.1121009811758995, -0.25070706009864807, 0.48233553767204285, 0.46038123965263367, 0.22910939157009125, -0.3673171103000641, -0.10352462530136108, 0.3926204741001129, -0.023098189383745193, -0.6542829275131226, 0.12120446562767029, -0.3497416377067566, 0.20755603909492493, 0.41424795985221863, -0.3404140770435333, -0.27628278732299805, 0.12246999889612198, 0.37001243233680725, 0.47711196541786194, 0.20008468627929688, 0.21246427297592163, 0.5213838219642639, 0.44345638155937195, 0.09343153983354568, -0.11381823569536209, 0.09600245952606201, -0.09827755391597748, 0.4995974004268646, 0.2915373742580414, -0.32894575595855713, 0.5657390356063843, 0.16390074789524078, 0.10184983909130096, -0.1003618985414505, -0.23231308162212372, -0.2583175599575043, 0.2581634223461151, 0.5816488265991211, -0.1575411707162857, -0.13392089307308197, -0.2646511495113373, 0.31937411427497864, -0.1480521559715271, 0.46059542894363403, -0.04053127020597458, 0.22552801668643951, 0.15680021047592163, -0.2709793448448181, 0.43734434247016907, 0.5649007558822632, 0.24642135202884674, -0.1500529795885086, -0.16049332916736603, -0.14617949724197388, 0.2372649759054184, -0.5933564305305481, -0.030433153733611107, -0.3893507421016693, 0.3380686342716217, -0.10078185051679611, -0.13759911060333252, -0.21637995541095734, 0.22966368496418, -0.19248533248901367, 0.027016345411539078, 0.30356913805007935, 0.1739354431629181, -0.15008264780044556, 0.18803951144218445, 0.0006444987957365811, -0.16277576982975006, -0.2888033092021942, -0.5841197967529297, 0.18734513223171234, 0.35978755354881287, 0.08188925683498383, 0.22996371984481812, -0.43989497423171997, -0.014848681166768074, 0.4691776931285858, 0.18538060784339905, 0.004096084274351597, 0.027806347236037254, -0.006655738223344088, 0.12345177680253983, -0.17301321029663086, 0.3775489926338196, 0.39350682497024536, -0.4381037950515747, 0.18255829811096191, -0.10816078633069992, 0.1791984885931015, 0.29770031571388245, -0.17167818546295166, 0.3029417395591736, 0.04050863906741142, 0.211510568857193, 0.20339174568653107, 0.17817389965057373, -0.2509840726852417, -0.2953956425189972, 0.5800365805625916, 0.5162762403488159, 0.47723305225372314, 0.04025140032172203, 0.17656080424785614, 0.15963229537010193, 0.03012455813586712, -0.2933942675590515, 0.06631197780370712, 0.0031661088578402996, -0.03812975063920021, 0.030943069607019424, 0.03380635753273964, -0.04147800803184509, -0.5437397956848145, -0.7230473756790161, -0.4935716688632965], [-0.28707537055015564, 0.32172778248786926, 0.12062205374240875, 0.3294887840747833, -0.39787283539772034, 0.10717885941267014, -0.5907595753669739, -0.06200655177235603, 0.020787272602319717, -0.04945845156908035, 0.03383781760931015, -0.35764434933662415, 0.25486302375793457, 0.3397534191608429, 0.5621894001960754, -0.567391574382782, 0.06400845944881439, -0.5209918022155762, 0.3805225193500519, 0.6195084452629089, 0.18263450264930725, -0.18464381992816925, 0.4760604202747345, -0.044828493148088455, -0.2659304141998291, -0.1487598568201065, 0.43585336208343506, 0.05446242913603783, -0.06072341278195381, 0.2784908711910248, -0.22136655449867249, 0.0533374547958374, 0.4173887073993683, 0.09941916167736053, 0.1937471181154251, -0.13479091227054596, 0.16511283814907074, 0.11764591187238693, 0.25085610151290894, 0.011943120509386063, 0.14331437647342682, 0.3046753704547882, -0.2261926531791687, 0.3538440763950348, 0.7400572299957275, 0.04888828098773956, 0.04681437835097313, 0.555931568145752, 0.3143586814403534, -0.1065046563744545, -0.7454245090484619, -0.3682747483253479, 0.16567108035087585, 0.17294606566429138, -0.5753734707832336, 0.015898065641522408, -0.22040553390979767, 0.06798377633094788, -0.17568400502204895, -0.015546745620667934, -0.5440541505813599, 0.06739971041679382, -0.4225632846355438, -0.04177021235227585, -0.2349970042705536, -0.05162181332707405, 0.38106486201286316, -0.17020556330680847, 0.04375581815838814, -0.2274385690689087, 0.4475308656692505, -0.01615004986524582, -0.14950315654277802, -0.3106530010700226, 0.06901815533638, -0.1150614395737648, 0.039484649896621704, 0.2365148812532425, 0.0016381974564865232, 0.10406975448131561, -0.46441248059272766, -0.05956554785370827, -0.10659229010343552, 0.18045389652252197, 0.24128419160842896, -0.17072220146656036, -0.12489296495914459, 0.4582817256450653, -0.14842036366462708, -0.12657393515110016, 0.2687647342681885, -0.33290883898735046, -0.11848020553588867, -0.2771126329898834, -0.43419918417930603, -0.2055816650390625, -0.29080691933631897, -0.5077537894248962, -0.08613710105419159, -0.2497294396162033, 0.03162090852856636, -0.41976380348205566, 0.5885823369026184, 0.2674562335014343, 0.1935829222202301, -0.15038330852985382, -0.12051910907030106, -0.6908788084983826, -0.026730012148618698, 0.19699153304100037, -0.3977676331996918, 0.00889569241553545, 0.17794862389564514, 0.35315418243408203, 0.2097110152244568, -0.3224063813686371, 0.09385591745376587, -0.28965312242507935, -0.3508360683917999, -0.2766384184360504, 0.21115653216838837, 0.010746562853455544, 0.49580925703048706, -0.16808439791202545, -0.2992165684700012, 0.2675239145755768, 0.2334337681531906, 0.19649973511695862, -0.10738062113523483, -0.67635577917099, 0.14540861546993256, 0.13513526320457458, 0.0024942257441580296, -0.15751291811466217, -0.6024107336997986, -0.34069016575813293, -0.2508762776851654, 0.15172988176345825, -0.08061686903238297, 0.22572486102581024, -0.11532673239707947, -0.21701934933662415, 0.33319374918937683, 0.12340614199638367, 0.49592581391334534, -0.09667129814624786, -0.3849281370639801, 0.4537358283996582, 0.4269130527973175, -0.28847670555114746], [0.03406499698758125, 0.05092871934175491, -0.10128318518400192, -0.16532950103282928, 0.49751949310302734, -0.011510626412928104, 0.5955092906951904, -0.04622311145067215, 0.51032954454422, -0.28007590770721436, -0.1389569789171219, 0.36793339252471924, -0.25563380122184753, -0.17607657611370087, -0.06347940862178802, 0.10520720481872559, -0.4678192138671875, -0.21007169783115387, -0.38411369919776917, -0.19647616147994995, 0.35772114992141724, -0.2438460886478424, -0.1174938753247261, -0.32155704498291016, -0.35038691759109497, 0.20716695487499237, -0.3685412108898163, 0.007377077359706163, -0.5152109265327454, -0.34369274973869324, 0.43733707070350647, -0.3333870768547058, -0.08009807020425797, -0.255187451839447, -0.19788981974124908, 0.04290527477860451, -0.09370741993188858, 0.03485416993498802, 0.05318217724561691, -0.3323070704936981, 0.026770232245326042, 0.19714581966400146, 0.1905852109193802, 0.11456670612096786, -0.46894726157188416, -0.2753584384918213, 0.5347261428833008, -0.4179101586341858, -0.53105229139328, 0.05870676040649414, 0.2731039226055145, 0.40275368094444275, -0.31578484177589417, -0.18418674170970917, 0.14073380827903748, -0.01422141119837761, 0.23820887506008148, 0.2768431007862091, 0.4253517985343933, -0.2100597321987152, -0.10478208214044571, 0.5027762651443481, -0.15765194594860077, 0.40241190791130066, 0.47126755118370056, 0.18952886760234833, 0.23530352115631104, 0.2414526343345642, -0.5518484711647034, -0.10899785161018372, -0.46572768688201904, -0.15379130840301514, 0.06288599222898483, -0.0949002206325531, 0.16652758419513702, -0.08271199464797974, -0.1852547824382782, -0.16588103771209717, 0.22937852144241333, -0.30859944224357605, 0.1991596668958664, 0.0642646923661232, 0.4866364002227783, 0.40948471426963806, 0.42815276980400085, 0.5368086695671082, 0.18364980816841125, 0.24436140060424805, -0.06764759123325348, -0.06834156066179276, -0.5011376738548279, 0.34452128410339355, 0.038110509514808655, -0.018301641568541527, 0.07066093385219574, -0.22752152383327484, 0.15295128524303436, -0.2781076431274414, 0.38755786418914795, 0.22058948874473572, -0.220016747713089, -0.3903828561306, -0.38845402002334595, -0.3577771484851837, 0.0615631565451622, 0.03903186693787575, -0.6406479477882385, -0.10007912665605545, -0.4051632285118103, -0.10705355554819107, 0.3316439688205719, -0.06848060339689255, -0.31864434480667114, -0.27148035168647766, -0.34939128160476685, 0.01207688171416521, -0.13101400434970856, 0.5084366202354431, 0.3820009231567383, 0.4523361027240753, -0.25442272424697876, -0.16996970772743225, -0.2106477916240692, -0.014254451729357243, 0.07187175750732422, -0.39583897590637207, 0.33918121457099915, -0.04483569413423538, 0.09604659676551819, 0.42033514380455017, -0.15966567397117615, -0.12705089151859283, 0.12149930745363235, 0.42710480093955994, 0.18836620450019836, 0.092284195125103, 0.2164362072944641, -0.5976993441581726, 0.2720053493976593, 0.07093531638383865, 0.45435675978660583, 0.28841695189476013, -0.39352208375930786, -0.29983118176460266, -0.2873976230621338, -0.04201166704297066, 0.4776671826839447, -0.014253253117203712, 0.16128477454185486, 0.3519303798675537], [-0.019437627866864204, 0.06651443988084793, 0.005749152507632971, 0.10409564524888992, -0.047905731946229935, -0.2028554230928421, 0.1899225413799286, -0.208846315741539, -0.07732085138559341, -0.09426909685134888, 0.19265735149383545, 0.4115164875984192, -0.3910791277885437, 0.002176010049879551, 0.0330127514898777, 0.43569743633270264, 0.34729787707328796, 0.5808746814727783, 0.31808552145957947, 0.1964556872844696, -0.7070446014404297, 0.2584465444087982, -0.31177154183387756, 0.1605582982301712, 0.06523418426513672, -0.243825763463974, -0.041550468653440475, 0.04061291739344597, 0.5488827228546143, 0.23327983915805817, -0.5324081182479858, 0.05030074715614319, -0.2105289250612259, 0.2891111671924591, 0.26008424162864685, 0.20402462780475616, 0.20622070133686066, 0.03836644068360329, -0.43660828471183777, -0.2740139961242676, 0.6981757283210754, -0.2716531753540039, -0.25728487968444824, -0.5987045168876648, 0.1442651003599167, -0.5339692234992981, -0.05552741512656212, -0.003112743841484189, 0.38854289054870605, -0.1431678831577301, 0.37272316217422485, 0.2529187500476837, -0.1668665111064911, 0.19421516358852386, 0.039694350212812424, -0.007263449486345053, 0.08959201723337173, -0.13616901636123657, -0.1093854159116745, 0.496907114982605, -0.005528881214559078, -0.43990302085876465, -0.004317778628319502, -0.08355734497308731, 0.17228123545646667, -0.06733845174312592, -0.5745174288749695, -0.46800151467323303, 0.0971057340502739, 0.47662296891212463, 0.09617460519075394, 0.026820052415132523, -0.42968645691871643, 0.1478392630815506, -0.33941876888275146, 0.5839333534240723, 0.2820957899093628, 0.25728216767311096, -0.356132835149765, -0.01049286313354969, 0.34845882654190063, 0.26825201511383057, -0.32802054286003113, 0.2994408905506134, -0.6844760179519653, -0.966802716255188, -0.2961757183074951, -0.4080083668231964, -0.18749704957008362, -0.23631997406482697, 0.5181527733802795, -0.4515851140022278, -0.013044405728578568, -0.033084090799093246, 0.20780077576637268, 0.559883177280426, -0.6483449935913086, 0.16018743813037872, -0.12650056183338165, -0.06010202690958977, -0.2685231864452362, 0.21169857680797577, 0.21211190521717072, 0.36954522132873535, 0.3376294672489166, -0.23169465363025665, 0.5948132872581482, 0.24878422915935516, 0.2192300260066986, -0.09204133599996567, -0.2298709601163864, 0.09642163664102554, -0.0998757928609848, -0.15117235481739044, -0.4529249966144562, 0.26137226819992065, -0.12593722343444824, -0.5394282341003418, 0.0010295662796124816, -0.11055624485015869, 0.1664370447397232, -0.10699821263551712, 0.19813409447669983, -0.049371104687452316, -0.004199987277388573, 0.6682054400444031, -0.6103388667106628, 0.4789136052131653, 0.36276572942733765, 0.34524083137512207, -0.25288403034210205, -0.2283775955438614, -0.21559491753578186, -0.12723246216773987, -0.03351861983537674, -0.5244776606559753, 0.033382829278707504, 0.009468973614275455, -0.6520176529884338, 0.2442106008529663, -0.5488353967666626, -0.1394656002521515, -0.033541303128004074, 0.05444308742880821, 0.17488068342208862, -0.36556270718574524, -0.3107742667198181, -0.6197041273117065, -0.08368935436010361, 0.0023727761581540108], [-0.17951974272727966, -0.4767336845397949, -0.34452515840530396, 0.040631964802742004, -0.20446491241455078, 0.5959765315055847, -0.12575797736644745, 0.5399878621101379, -0.5256524085998535, 0.13366472721099854, -0.18645477294921875, -0.33307331800460815, 0.2732301354408264, -0.40720319747924805, 0.3147449493408203, -0.02317032963037491, -0.11624103784561157, -0.46932661533355713, -0.27478185296058655, -0.11757666617631912, 0.35031867027282715, -0.11084100604057312, 0.5289850234985352, -0.3838314712047577, 0.35096171498298645, 0.04223011061549187, 0.5060551166534424, -0.02345762960612774, -0.20572561025619507, 0.21752098202705383, -0.5525534152984619, -0.1570894867181778, 0.09406597167253494, 0.26618850231170654, 0.23770186305046082, 0.3027128577232361, 0.07859798520803452, -0.22073383629322052, 0.4857775866985321, 0.714581310749054, -0.3344252407550812, 0.2821764647960663, -0.020368192344903946, 0.3987565338611603, 0.20119577646255493, -0.09616907685995102, 0.43973466753959656, 0.08594771474599838, -0.2473779022693634, 0.27838435769081116, -0.26845645904541016, -0.12405256181955338, 0.3142460882663727, 0.07104124873876572, -0.2363916039466858, -0.008558141998946667, -0.3214297592639923, -0.18069569766521454, -0.0828113928437233, -0.3618350923061371, -0.3332865834236145, 0.3506762385368347, 0.24077463150024414, -0.2660394310951233, 0.3318960964679718, 0.14950981736183167, 0.48418155312538147, -0.2747887372970581, 0.4595804810523987, -0.023714374750852585, -0.027252549305558205, 0.37123745679855347, -0.043077584356069565, -0.16123229265213013, 0.3277316987514496, -0.38438764214515686, -0.16023904085159302, -0.22425663471221924, 0.17213252186775208, -0.225541889667511, -0.16294194757938385, 0.08917582035064697, 0.0576137900352478, -0.003280187491327524, 0.516989529132843, 0.14899751543998718, 0.25301727652549744, 0.03168115019798279, -0.23615705966949463, -0.013919916935265064, -0.05299137532711029, -0.13726575672626495, -0.132568821310997, 0.08775027096271515, -0.5185645818710327, -0.2755787670612335, 0.5298141241073608, 0.2313159555196762, -0.18138840794563293, -0.23141750693321228, 0.2801568806171417, 0.18466807901859283, 0.00046118174213916063, -0.232527956366539, 0.007174260914325714, 0.5015048384666443, -0.08712611347436905, -0.44315123558044434, -0.2552851736545563, -0.20608441531658173, -0.2703361213207245, 0.36949455738067627, 0.37627896666526794, -0.2267921268939972, -0.10670223832130432, 0.3524521291255951, 0.3977472186088562, -0.14634695649147034, -0.1490192711353302, 0.3994765877723694, -0.07209882140159607, 0.14734423160552979, 0.30986031889915466, 0.04555054381489754, -0.11964788287878036, 0.0049537899903953075, 0.6231306195259094, -0.2661397457122803, 0.23073886334896088, -0.128236785531044, 0.04118084907531738, 0.23355597257614136, 0.13585549592971802, 0.36598971486091614, -0.1491769701242447, 0.4774715304374695, -0.5418692827224731, 0.24322275817394257, 0.07247916609048843, -0.4459773004055023, 0.6260421276092529, -0.3285738229751587, 0.4603259265422821, 0.3779138922691345, -0.12290605157613754, 0.3825778365135193, 0.2913680970668793, -0.07299652695655823, -0.40788954496383667, -0.11861845850944519], [0.4676542282104492, -0.15105977654457092, 0.2946765422821045, 0.042708300054073334, -0.14094893634319305, -0.41583773493766785, -0.39384427666664124, -0.3855229914188385, 0.5548903346061707, 0.12673065066337585, -0.1237025260925293, 0.12746700644493103, 0.05418090149760246, 0.11597276479005814, -0.13216933608055115, -0.34786760807037354, 0.12150923162698746, -0.06482692807912827, 0.27927032113075256, 0.4486790895462036, 0.21610994637012482, 0.1530625820159912, 0.07881370186805725, 0.550807535648346, -0.2284385859966278, -0.20560099184513092, -0.29797491431236267, -0.40837210416793823, -0.02190590277314186, 0.16677021980285645, 0.3655572533607483, -0.01530513633042574, -0.06856352090835571, -0.01495299767702818, -0.031249236315488815, -0.2638918459415436, -0.2564089894294739, -0.17110010981559753, -0.3368867337703705, -0.41701632738113403, 0.2155901938676834, 0.2016381025314331, 0.21448688209056854, 0.2251976877450943, 0.27624109387397766, 0.19498106837272644, -0.37422841787338257, -0.22738079726696014, -0.20274001359939575, 0.16093209385871887, -0.28090181946754456, 0.19380465149879456, -0.5277626514434814, 0.18248048424720764, 0.29081591963768005, 0.015000416897237301, 0.27778977155685425, 0.02178885228931904, 0.008961254730820656, 0.6085795164108276, -0.7217289209365845, 0.2526177763938904, -0.45491620898246765, 0.6548537015914917, -0.19496548175811768, -0.3631775975227356, -0.11003071069717407, 0.2407023012638092, 0.05846112221479416, 0.0004655115189962089, 0.3295760452747345, 0.06121916323900223, -0.09666204452514648, 0.09305599331855774, 0.11141954362392426, 0.32479986548423767, 0.3879043459892273, 0.3048310875892639, -0.005735791753977537, -0.3547709286212921, -0.3938128352165222, -0.11871464550495148, 0.15074750781059265, 0.16235584020614624, 0.5131497383117676, 0.027045320719480515, -0.02531132847070694, 0.3728805184364319, 0.24541376531124115, 0.1222563162446022, -0.07133178412914276, 0.5222798585891724, 0.5148658156394958, 0.0416218526661396, 0.6138047575950623, -0.15658928453922272, 0.28770971298217773, -0.4123828113079071, 0.6490910053253174, 0.4089762270450592, -0.13961082696914673, -0.052190233021974564, 0.020813701674342155, 0.10611551254987717, -0.13454782962799072, -0.4693313539028168, -0.2979937195777893, -0.1494690328836441, -0.3333752751350403, -0.2793969511985779, 0.1988854557275772, -0.08112740516662598, -0.21986693143844604, 0.512294590473175, 0.08370506763458252, -0.3759574890136719, -0.010856429114937782, 0.20732413232326508, 0.3135939836502075, 0.307668000459671, -0.3464756906032562, 0.08305386453866959, -0.12356267124414444, 0.2969341576099396, 0.0006765409489162266, 0.2298526167869568, 0.04685386270284653, -0.33581867814064026, 0.18454782664775848, -0.1998203694820404, 0.2625505030155182, 0.3956182897090912, -0.32358235120773315, -0.30952897667884827, -0.2601170539855957, -0.29726850986480713, 0.24569326639175415, -0.7795199751853943, 0.12776222825050354, 0.5738648772239685, -0.13785985112190247, 0.5230419039726257, -0.5019432306289673, -0.32534196972846985, 0.3045631945133209, 0.010782375931739807, 0.2402219921350479, -0.154182568192482, 0.17219090461730957, -0.2845037877559662], [0.17122556269168854, -0.1337195187807083, -0.1345740258693695, -0.12830205261707306, 0.05790204182267189, 0.051091667264699936, -0.19221967458724976, 0.036282166838645935, -0.06850152462720871, -0.17260561883449554, -0.2572426497936249, 0.1092633530497551, -0.2993137538433075, -0.09196499735116959, 0.21370069682598114, -0.24560095369815826, -0.014893988147377968, -0.11267285794019699, 0.027804652228951454, 0.06129120662808418, 0.22104580700397491, -0.135507732629776, 0.06467707455158234, -0.15481244027614594, -0.15936757624149323, -0.256988525390625, -0.15430861711502075, 0.24541035294532776, -0.17333008348941803, 0.15306821465492249, 0.027010662481188774, 0.17995989322662354, 0.22493641078472137, 0.18462465703487396, 0.11122298240661621, 0.3210938572883606, 0.08653608709573746, 0.0003391445497982204, 0.036404047161340714, 0.050801318138837814, 0.09834853559732437, 0.08305712044239044, 0.2378489077091217, 0.019742919132113457, -0.007937286980450153, -0.22572140395641327, 0.05265653505921364, -0.13970617949962616, 0.061544910073280334, 0.045832131057977676, -0.17935208976268768, 0.0476391538977623, -0.013754165731370449, 0.28924813866615295, 0.12578308582305908, -0.2846023142337799, 0.11017218977212906, 0.19437313079833984, 0.22789379954338074, 0.014497037045657635, -0.20041167736053467, 0.060931283980607986, -0.028442425653338432, 0.046895600855350494, 0.27197080850601196, 0.2086690068244934, 0.10149994492530823, -0.10571382939815521, 0.05596097931265831, 0.3901517689228058, 0.09849947690963745, -0.03971374034881592, -0.28020623326301575, 0.10619105398654938, 0.05093144625425339, -0.1140940710902214, -0.07356301695108414, -0.004710450768470764, 0.02503839135169983, -0.1359957754611969, -0.14786124229431152, -0.06147684156894684, -0.048880621790885925, 0.32761436700820923, -0.05077814310789108, 0.03693893924355507, -0.02823575772345066, -0.19036701321601868, -0.2551288902759552, -0.05313951149582863, -0.04667041823267937, -0.09412040561437607, -0.1469280868768692, -0.20287565886974335, 0.08194978535175323, -0.07571325451135635, 0.02804996632039547, -0.1950034499168396, 0.29988405108451843, 0.14069123566150665, 0.050269775092601776, -0.09320180863142014, 0.2493859827518463, -0.06159904971718788, 0.03339049220085144, -0.06236403062939644, -0.09432327002286911, 0.13023161888122559, 0.0018481708830222487, 0.1411464363336563, 0.2254454642534256, 0.2295158952474594, -0.06136774644255638, 0.15458622574806213, 0.02596498839557171, 0.02014126256108284, -0.164518803358078, 0.1871577799320221, -0.0335429422557354, 0.1693260222673416, -0.06935713440179825, -0.047230564057826996, 0.3657245337963104, 0.017054134979844093, 0.17544107139110565, 0.21270160377025604, -0.04064437747001648, -0.07675965130329132, 0.06878381967544556, 0.09949930012226105, 0.1400458663702011, -0.13085882365703583, 0.005770145915448666, 0.11400309205055237, -0.20487357676029205, -0.2552494704723358, 0.14339931309223175, -0.11117564141750336, -0.23031499981880188, -0.24007968604564667, 0.20688621699810028, -0.043633364140987396, 0.11570680141448975, -0.0747956782579422, -0.12039273232221603, -0.08431115001440048, -0.13438622653484344, -0.17676423490047455, -0.2906967103481293, 0.036123327910900116], [0.024547161534428596, -0.02624405175447464, -0.017380189150571823, 0.2852247953414917, 0.07247237861156464, 0.2157483696937561, -0.034545619040727615, -0.06485644727945328, -0.0943935215473175, -0.04699449613690376, -0.01141866110265255, 0.1815982609987259, -0.017481820657849312, 0.09889120608568192, 0.24106363952159882, 0.06423794478178024, -0.029036041349172592, -0.1691340059041977, -0.0027478374540805817, 0.0695299431681633, 0.1851692795753479, 0.07442490011453629, 0.04787471517920494, -0.20037512481212616, -0.047450218349695206, 0.2820419669151306, -0.123367540538311, 0.019863788038492203, -0.2177259773015976, -0.1652667373418808, -0.07933440804481506, -0.0892484039068222, 0.1860082596540451, 0.16862891614437103, -0.05788047984242439, 0.11513859033584595, -0.12942171096801758, 0.12058661133050919, 0.06418030709028244, 0.02131471037864685, 0.16636930406093597, -0.015012357383966446, -0.044909972697496414, 0.057134732604026794, -0.05294394865632057, 0.1496495008468628, 0.17227548360824585, -0.05547128617763519, -0.10788421332836151, -0.05045890063047409, -0.18533186614513397, 0.13705287873744965, -0.026661576703190804, 0.06978566199541092, 0.05468721687793732, 0.21125482022762299, 0.05847658962011337, -0.00298268161714077, -0.049145203083753586, 0.1658104956150055, -0.06798587739467621, 0.03547914698719978, 0.22558611631393433, -0.0016859666211530566, 0.07027298212051392, -0.11353589594364166, -0.1967427134513855, -0.2536768317222595, 0.13845837116241455, 0.232994943857193, -0.15972019731998444, -0.035122063010931015, -0.12173902988433838, 0.13035818934440613, 0.03923406824469566, 0.04224572703242302, 0.019971616566181183, -0.3053361177444458, 0.20554476976394653, -0.029441194608807564, 0.047096580266952515, -0.0960180014371872, 0.009640374220907688, 0.16900525987148285, 0.17231051623821259, -0.049104440957307816, -0.17620529234409332, -0.011274373158812523, -0.14724396169185638, -0.21941138803958893, -0.05084957182407379, 0.032315708696842194, -0.021872984245419502, 0.08154288679361343, 0.02337905392050743, -0.10108263045549393, 0.03329433500766754, 0.006926443427801132, -0.07668221741914749, 0.018832841888070107, -0.0962778776884079, -0.09437938779592514, 0.13655243813991547, 0.11608737707138062, 0.09465780109167099, -0.011489136144518852, -0.043484173715114594, 0.053841039538383484, 0.006922818720340729, -0.04749435931444168, -0.0987597405910492, 0.2711891531944275, -0.0500580258667469, 0.05510137975215912, -0.05400146171450615, -0.1238233894109726, -0.06445375829935074, -0.0027563164476305246, 0.17438554763793945, 0.13958843052387238, 0.08592652529478073, 0.05698248744010925, 0.10084039717912674, -0.05545058473944664, 0.2783988118171692, 0.2488691359758377, 0.023779673501849174, 0.058663152158260345, 0.041760776191949844, 0.3097729980945587, 0.22017042338848114, -0.07295040786266327, -0.10987016558647156, 0.2741379141807556, -0.26908379793167114, -0.28470274806022644, -0.029143670573830605, -0.25313279032707214, -0.035926759243011475, -0.020114131271839142, 0.0017596331890672445, -0.10967116802930832, -0.10054744780063629, 0.010488688945770264, 0.13408204913139343, -0.16303475201129913, 0.11480506509542465, -0.13082629442214966, -0.24688619375228882, 0.09822162985801697], [0.06896784901618958, -0.12568239867687225, -0.24465014040470123, 0.17267876863479614, -0.284850150346756, 0.15475094318389893, 0.036645326763391495, 0.2281120866537094, 0.039968542754650116, 0.13716083765029907, 0.045415449887514114, 0.12922760844230652, -0.1733129322528839, -0.14227548241615295, -0.08432359993457794, 0.042744915932416916, 0.085425965487957, 0.16739429533481598, -0.04481034725904465, 0.14384019374847412, 0.10647488385438919, -0.1810087114572525, 0.11792860180139542, -0.06859984248876572, 0.022145774215459824, 0.13286378979682922, -0.15557914972305298, 0.11895832419395447, 0.14573556184768677, 0.04829990118741989, 0.13486798107624054, 0.1157708689570427, 0.3608393967151642, 0.14283029735088348, -0.01789943315088749, 0.0063811237923800945, -0.050459228456020355, -0.19562332332134247, 0.2071155309677124, 0.08514418452978134, 0.23830758035182953, 0.19735278189182281, 0.2097453474998474, 0.06700295954942703, 0.10975317656993866, -0.16246242821216583, 0.14193248748779297, -0.1707293540239334, -0.1204146072268486, -0.00447778170928359, -0.055038921535015106, 0.07214731723070145, 0.0850391834974289, 0.06611837446689606, -0.20505665242671967, -0.15125484764575958, 0.02707516774535179, 0.09900998324155807, -0.04117479920387268, 0.056660350412130356, -0.15519289672374725, -0.01224465575069189, -0.08901632577180862, 0.09075779467821121, 0.057333216071128845, -0.07112591713666916, 0.09397123754024506, -0.15332670509815216, -0.1028757244348526, 0.2703985273838043, -0.05258651077747345, -0.20100215077400208, 0.1474900245666504, 0.16197223961353302, 0.18794573843479156, 0.06805510818958282, 0.10202737897634506, -0.10803242772817612, 0.13030032813549042, 0.08557698875665665, -0.09162823110818863, 0.02364777959883213, 0.03034183196723461, 0.036228496581315994, -0.02428118698298931, -0.14566141366958618, 0.16529811918735504, -0.1737530678510666, -0.04320055618882179, -0.22656209766864777, 0.25233349204063416, 0.00853957049548626, -0.04650181531906128, -0.06707581877708435, -0.13258878886699677, 0.11742959171533585, -0.18500258028507233, 0.03628522902727127, -0.20192131400108337, 0.05884600430727005, 0.16980938613414764, 0.09375546127557755, -0.020007649436593056, -0.12824861705303192, 0.1934879571199417, 0.12447648495435715, -0.251458078622818, 0.06606971472501755, -0.07911046594381332, 0.013960524462163448, 0.23216314613819122, 0.17960192263126373, 0.0052901338785886765, 0.06948705017566681, -0.042918574064970016, 0.03869083151221275, -0.03727160394191742, -0.057061225175857544, -0.2210802286863327, 0.15869013965129852, -0.16323871910572052, 0.041434112936258316, 0.05126713588833809, 0.1504606306552887, 0.013156717643141747, -0.0029543680138885975, -0.04903973266482353, -0.04659825935959816, 0.06948304176330566, 0.013365606777369976, 0.183844655752182, -0.21047958731651306, 0.027498915791511536, -0.08690295368432999, -0.21937504410743713, -0.1403723508119583, 0.07503034174442291, -0.16302140057086945, -0.08379238098859787, 0.1381254345178604, -0.06739810854196548, -0.007157109212130308, 0.027922874316573143, 0.003179351333528757, 0.03955887258052826, 0.04221004992723465, 0.1859348863363266, -0.03830413520336151, 0.05889366194605827, 0.0013608898734673858], [-0.006322735454887152, 0.02355230413377285, -0.06283172219991684, 0.33681946992874146, 0.05954810976982117, 0.02650652639567852, -0.00018775601347442716, -0.030500052496790886, -0.06992610543966293, 0.1252734512090683, 0.07682592421770096, 0.17206278443336487, 0.0439961701631546, 0.11482212692499161, 0.2250942885875702, -0.18048495054244995, -0.04798092320561409, 0.1854553371667862, -0.16656538844108582, -0.13334429264068604, 0.35303229093551636, -0.025785304605960846, -0.11821136623620987, -0.08125046640634537, -0.08204304426908493, 0.060197509825229645, -0.09253202378749847, -0.07234127074480057, -0.2486790269613266, 0.012703483924269676, -0.08613551408052444, -0.2910269498825073, 0.009337092749774456, -0.019534388557076454, -0.02611042745411396, -0.07630542665719986, -0.13582493364810944, -0.14086300134658813, 0.17268583178520203, 0.11672856658697128, 0.28909578919410706, -0.06156427785754204, -0.18165063858032227, 0.026108551770448685, -0.022884469479322433, -0.22600437700748444, 0.08668281137943268, 0.26347699761390686, 0.015461299568414688, -0.0153206717222929, 0.05714696645736694, 0.08952628821134567, -0.19831150770187378, 0.018664982169866562, -0.07801505923271179, 0.22631455957889557, 0.18806631863117218, -0.07023607939481735, -0.05884766951203346, 0.03381551057100296, -0.05332500860095024, 0.12009727954864502, 0.18098734319210052, -0.12265592813491821, 0.1532726138830185, -0.07459406554698944, -0.18427753448486328, -0.004975937772542238, -0.07996414601802826, 