{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_4", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "hidden_1"}, "name": "hidden_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[-0.21098680794239044, -0.04473881423473358, 0.06763643026351929, 0.05447119474411011, -0.380939781665802, -0.28422462940216064, 0.000526521704159677, -0.10798361152410507, 0.20225699245929718, -0.01528979279100895, 0.4210978150367737, -0.09693360328674316, -0.006697089411318302, 0.23235899209976196, 0.08758188039064407, 0.3406086266040802, -0.07068493962287903, -0.10622672736644745, -0.10343465954065323, -0.10695543885231018, 0.28172171115875244, -0.213963583111763, -0.25515562295913696, 0.21783579885959625, -0.023257581517100334, 0.002434944035485387, -0.3873264491558075, 0.1684781163930893, -0.12723881006240845, 0.21351516246795654, 0.12598691880702972, -0.061178967356681824, 0.036557529121637344, -0.052258484065532684, -0.04903148114681244, -0.14070016145706177, -0.1297462433576584, 0.1682654768228531, 0.14697013795375824, 0.19258488714694977, 0.32197296619415283, -0.09003394842147827, -0.2342415302991867, 0.1684684157371521, 0.016732456162571907, -0.2786346673965454, -0.0561579093337059, 0.16124626994132996, -0.17562714219093323, -0.12850989401340485, -0.3135806620121002, -0.027847500517964363, -0.1108407974243164, 0.33742812275886536, 0.07167544960975647, -0.18225665390491486, 0.08614828437566757, 0.25765734910964966, 0.03789814934134483, 0.23315361142158508, 0.009645979851484299, -0.009783750399947166, 0.44345638155937195, 0.22227483987808228, 0.11628246307373047, -0.10484182834625244, 0.022646015509963036, -0.11201215535402298, -0.23477958142757416, 0.1428663730621338, 0.0717589259147644, 0.14192257821559906, -0.24668674170970917, -0.1154099702835083, 0.0009261237573809922, 0.10418915748596191, -0.1766267716884613, -0.23654799163341522, -0.04408806934952736, 0.0633632093667984, -0.05675314739346504, 0.000943578954320401, -0.013670730404555798, -0.4688875079154968, 0.08191145956516266, 0.01020923350006342, -0.007411096710711718, 0.05285682529211044, -0.20295944809913635, -0.13328905403614044, -0.34285953640937805, -0.01773601584136486, 0.058435287326574326, 0.2723346948623657, 0.012449157424271107, 0.04420509189367294, 0.008079800754785538, -0.09289568662643433, 0.20606915652751923, 0.17702420055866241, -0.03802156075835228, -0.16300462186336517, 0.008628127165138721, 0.016786443069577217, 0.2414100170135498, 0.01990288309752941, -0.19131138920783997, -0.07422791421413422, -0.16929787397384644, -0.08583444356918335, -0.04944494739174843, -0.2462863028049469, 0.1112484484910965, 0.2541850507259369, 0.1615026295185089, -0.16039317846298218, -0.03784187510609627, 0.05739544332027435, -0.1931675374507904, 0.16572383046150208, -0.1259635090827942, 0.03592860698699951, -0.11298935115337372, 0.058712467551231384, -0.3520137071609497, -0.017435045912861824, -0.06902997940778732, 0.27870431542396545, -0.06180433928966522, 0.012520958669483662, 0.310019850730896, -0.033049702644348145, -0.08680794388055801, -0.08553095906972885, 0.12575611472129822, 0.008264519274234772, -0.22564385831356049, 0.20268090069293976, -0.16617178916931152, -0.2726437449455261, -0.3102778494358063, -0.06739706546068192, 0.08736743777990341, 0.1568842977285385, -0.07441740483045578, 0.05916157364845276, -0.050061311572790146, -0.17836029827594757, -0.36035263538360596, -0.22536621987819672, 0.24178096652030945, -0.05185173451900482, -0.10467571765184402, -0.06370522081851959, 0.0007828693487681448, 0.2316332757472992, 0.141471266746521, -0.0998913049697876, -0.021411588415503502, 0.002173773944377899, -0.3834444284439087, -0.042367078363895416, -0.17187823355197906, -0.1331966072320938, -0.07023029774427414, 0.09329680353403091, -0.25237414240837097, -0.11043503135442734, -0.08140651136636734, 0.2681484818458557, -0.08096345514059067, -0.03182806447148323, 0.329983651638031, -0.04842698201537132, -0.09482450038194656, -0.15480530261993408, -0.20384955406188965, 0.18132217228412628, -0.2475716471672058, 0.255807489156723, -0.28557056188583374, 0.08959070593118668, -0.027358604595065117, 0.27174001932144165, 0.24137069284915924, -0.08179468661546707, 0.1303258091211319, 0.2907179296016693, -0.027459532022476196, -0.04187798500061035, 0.08732371777296066, -0.16724105179309845, -0.26253941655158997, 0.07105714827775955, -0.28198978304862976, -0.1880495697259903, -0.12151020020246506, 0.18485651910305023, 0.01798168569803238, 0.160800963640213, -0.1461334079504013, -0.0054037123918533325, 0.021566569805145264, 0.029022539034485817, 0.07423801720142365, 0.34606146812438965, 0.20816679298877716, 0.11787805706262589, 0.031225156038999557, -0.12768644094467163, -0.020942572504281998, -0.09633107483386993, 0.1617092788219452, -0.09243425726890564, -0.16219329833984375, -0.09345876425504684, 0.0920976996421814, 0.08202507346868515, -0.11552496999502182, 0.2146032750606537, 0.3028290569782257, 0.038343098014593124, 0.020092587918043137, -0.26675161719322205, -0.026326319202780724, 0.037066757678985596, -0.04849552363157272, 0.04056562855839729, -0.11603274941444397, -0.1327541470527649, -0.16110093891620636, 0.23124271631240845, -0.018113145604729652, -0.03876148909330368, 0.1237240731716156, -0.11879689991474152, -0.009076278656721115, -0.1110755130648613, -0.16100813448429108, -0.04419749975204468, -0.008244873955845833, -0.14397287368774414, -0.042311400175094604, -0.022509519010782242, 0.13437937200069427, 0.014498530887067318, -0.09813926368951797, 0.05983978137373924, -0.0031915190629661083, 0.18023379147052765, 0.09354995936155319, 0.0896725282073021, -0.009988456964492798, -0.14301562309265137, 0.0018027841579169035, -0.21125470101833344, -0.08992161601781845, 0.03729161620140076, 0.1919708400964737, 0.07557624578475952, 0.11040683835744858, 0.05046412721276283, 0.12717469036579132, 0.13639046251773834, 0.041893649846315384, -0.023313194513320923, -0.29438748955726624, 0.04690026119351387, 0.2517164349555969, 0.05171243101358414, -0.07165616750717163, -0.004194458480924368, -0.15056557953357697, 0.12051281332969666, 0.15234071016311646, -0.05413943901658058, -0.004375062882900238, 0.08760616928339005, 0.035091299563646317, -0.09643144905567169, 0.19679099321365356, -0.02420511655509472, 0.1622728854417801, -0.06983298808336258, 0.10084150731563568, -0.15647543966770172, -0.019562993198633194, -0.01876383274793625, -0.12395323812961578, 0.03210113197565079, 0.12084244936704636, 0.009794261306524277, 0.16473281383514404, -0.1027161031961441, 0.0649268627166748, -0.06456439197063446, -0.089157335460186, 0.06898421049118042, -0.08919014036655426, -0.0024164679925888777], [-0.2948366403579712, 0.17315660417079926, -0.1602822095155716, 0.02763121947646141, -0.14642687141895294, -0.07710731029510498, -0.09974843263626099, -0.11109434813261032, 0.003946435172110796, -0.2726786136627197, 0.035729341208934784, -0.06999801844358444, 0.06511765718460083, 0.07518485933542252, 0.3616505265235901, 0.05854002386331558, 0.014679724350571632, 0.036493320018053055, 0.18051239848136902, 0.09147932380437851, 0.09532538056373596, -0.031449463218450546, 0.08225909620523453, 0.1892254799604416, -0.3058619201183319, -0.060628823935985565, -0.08827682584524155, -0.12017668038606644, 0.041806306689977646, -0.3116872310638428, 0.08133170008659363, -0.08291392028331757, -0.04530220851302147, 0.03727307543158531, 0.08834239095449448, -0.4171225130558014, 0.0008088250760920346, -0.26740702986717224, 0.14838537573814392, 0.04648391902446747, -0.1205379068851471, -0.16342049837112427, -0.09370674192905426, -0.10973197221755981, -0.08030619472265244, -0.07196438312530518, -0.12388701736927032, -0.2103940099477768, -0.1464458405971527, 0.19261682033538818, -0.1566644310951233, -0.1859249323606491, 0.07202150672674179, 0.16977927088737488, 0.22079576551914215, 0.04024546220898628, -0.1180245503783226, -0.19229401648044586, 0.05307449400424957, -0.02385733462870121, -0.0759672150015831, 0.17806199193000793, -0.08651979267597198, -0.23958837985992432, 0.32422706484794617, 0.03750011324882507, -0.14585161209106445, 0.014034810476005077, -0.28230389952659607, 0.02538708969950676, 0.14249518513679504, 0.2066202163696289, -0.05082879215478897, -0.47609636187553406, -0.08454788476228714, -0.2220533788204193, -0.002405355451628566, -0.1845821887254715, -0.021543115377426147, 0.061081662774086, -0.012871123850345612, 0.14080050587654114, 0.12128743529319763, -0.1636030375957489, -0.19904698431491852, 0.18461985886096954, 0.45725664496421814, 0.06618668884038925, -0.21413546800613403, -0.04626644775271416, -0.4027734100818634, -0.023975485935807228, 0.05682088062167168, -0.1025383323431015, -0.06610703468322754, 0.07731106132268906, 0.12305796146392822, -0.0415622815489769, 0.09601570665836334, 0.2120097279548645, -0.17416632175445557, 0.004569724667817354, -0.018291963264346123, -0.30643230676651, 0.0454903170466423, 0.0019619883969426155, -0.034427642822265625, -0.06518105417490005, -0.23537899553775787, -0.32211729884147644, -0.3073960840702057, -0.14957602322101593, -0.1547793298959732, 0.059558093547821045, -0.0012683433014899492, 0.1190154105424881, -0.19040939211845398, -0.04772476479411125, -0.038389869034290314, -0.15981170535087585, 0.2715766727924347, -0.08433365076780319, -0.23576569557189941, -0.10604901611804962, 0.010992332361638546, 0.1476096361875534, -0.039411760866642, -0.1859929859638214, 0.37883618474006653, -0.08003272861242294, -0.32077550888061523, -0.07235682755708694, -0.019728604704141617, 0.023127758875489235, 0.0386476069688797, 0.014969691634178162, -0.2078501135110855, -0.36056622862815857, -0.005179757252335548, -0.1758759468793869, -0.030675116926431656, 0.14712318778038025, 0.17036321759223938, -0.08584588021039963, -0.17096973955631256, -0.5038096308708191, -0.14471861720085144, 0.2529282867908478, -0.07931225746870041, -0.07243721932172775, -0.08027425408363342, -0.3311299681663513, 0.0932655781507492, -0.17913229763507843, -0.08624708652496338, 0.04442599415779114, 0.40021175146102905, 0.04592125490307808, -0.16006579995155334, 0.002983521204441786, 0.15212413668632507, -0.028335003182291985, -0.05323607474565506, -0.13550351560115814, -0.3979426622390747, 0.0380777008831501, -0.14771409332752228, -0.04342276602983475, -0.08065187931060791, -0.1787017285823822, -0.25266462564468384, -0.1940169334411621, -0.003275904105976224, 0.028100671246647835, 0.3712120056152344, -0.1490149348974228, -0.030569346621632576, -0.23577749729156494, 0.08107385784387589, 0.004721490666270256, 0.07805062085390091, -0.07367810606956482, 0.07763057202100754, -0.026014216244220734, 0.13677173852920532, -0.09227684140205383, 0.25042325258255005, -0.17331799864768982, 0.10609062016010284, 0.182267427444458, -0.14659644663333893, -0.3287125527858734, -0.2588516175746918, 0.25437167286872864, -0.2471688836812973, 0.08729534596204758, 0.014585433527827263, -0.3245392143726349, -0.22522473335266113, 0.09348612278699875, 0.06244561821222305, -0.08783327788114548, -0.01096278429031372, 0.08322879672050476, 0.17118848860263824, -0.16155125200748444, 0.02319446951150894, -0.06090890243649483, 0.2787993252277374, -0.08203136920928955, -0.10782799869775772, -0.004244687035679817, 0.05176238715648651, -0.048737358301877975, -0.08720706403255463, -0.07398130744695663, -0.022783303633332253, 0.07466702163219452, -0.03350919857621193, -0.043874915689229965, -0.17235176265239716, -0.21705327928066254, 0.07949071377515793, -0.09209979325532913, 0.009846777655184269, 0.1502859741449356, -0.1745370775461197, 0.10785652697086334, -0.2885051369667053, -0.17361007630825043, -0.07130390405654907, -0.18666984140872955, -0.2559315860271454, 0.06627707183361053, 0.03346845135092735, -0.28579792380332947, -0.001992735080420971, -0.07352674752473831, 0.13044363260269165, -0.23038144409656525, -0.10323723405599594, 0.02385922521352768, -0.08134982734918594, 0.1892373263835907, -0.015721160918474197, -0.1423860639333725, 0.12725314497947693, -0.10494126379489899, 0.13359656929969788, -0.22132402658462524, -0.15050528943538666, -0.06632361561059952, -0.03344042971730232, 0.084264375269413, 0.02374078705906868, 0.03185757249593735, -0.19277887046337128, -0.1199752539396286, -0.17892706394195557, 0.0909929871559143, 0.10158651322126389, 0.06785256415605545, 0.3125542104244232, -0.17712128162384033, -0.03556997701525688, -0.10032733529806137, 0.1024102196097374, -0.04449445754289627, 0.055337030440568924, -0.058044206351041794, 0.017783813178539276, 0.22210876643657684, 0.03398914262652397, -0.288770467042923, -0.24816986918449402, 0.2532256245613098, -0.08658606559038162, 0.054850198328495026, 0.2744932174682617, 0.023707140237092972, 0.07033223658800125, 0.17358523607254028, 0.2168617695569992, -0.14780473709106445, 0.18362705409526825, -0.25492122769355774, -0.18313026428222656, -0.005402493756264448, -0.28089001774787903, -0.026618078351020813, -0.07361364364624023, 0.13654881715774536, 0.26428690552711487, 0.07688148319721222, 0.02629387564957142, 0.04171425476670265, -0.04028286784887314, -0.1674032360315323, 0.13113568723201752, -0.260225385427475], [-0.10741432011127472, 0.16507983207702637, 0.1125108152627945, -0.14913730323314667, 0.13636934757232666, 0.06884268671274185, 0.016048021614551544, 0.07029468566179276, 0.13511039316654205, 0.2057856023311615, 0.12078553438186646, -0.022036228328943253, 0.012401207350194454, -0.011064017191529274, -0.12786419689655304, -0.02522175945341587, 0.015317455865442753, 0.3082410395145416, 0.12645207345485687, -0.12642081081867218, -0.17874176800251007, 0.03017580136656761, -0.2031421810388565, -0.2509068548679352, 0.15998955070972443, 0.16684265434741974, -0.20612376928329468, -0.0308904517441988, 0.09553330391645432, -0.20679032802581787, -0.01181112788617611, 0.2841135263442993, 0.2610514163970947, 0.18525156378746033, 0.019302908331155777, 0.17201869189739227, -0.012582769617438316, 0.014269626699388027, 0.2120571881532669, -0.006784800440073013, -0.20547451078891754, 0.2979004979133606, 0.14999572932720184, -0.024224920198321342, 0.14155292510986328, 0.29069772362709045, -0.17582201957702637, 0.022106491029262543, 0.0597485713660717, 0.09507139772176743, -0.005742540117353201, 0.06315921247005463, 0.08412131667137146, -0.007081157527863979, 0.20515954494476318, -0.04422912746667862, -0.022293567657470703, 0.020168693736195564, 0.14561770856380463, -0.054458752274513245, 0.07465410232543945, -0.1376931071281433, 0.09926450252532959, 0.18698638677597046, -0.16779544949531555, -0.0760989785194397, -0.03568520396947861, 0.05193251743912697, 0.10819172114133835, -0.12764883041381836, -0.08169013261795044, -0.2980298697948456, 0.18612442910671234, 0.0840541422367096, 0.2682054936885834, -0.03519272431731224, 0.06268467754125595, 0.14471431076526642, -0.060162078589200974, 0.06237633526325226, 0.163702592253685, 0.07868750393390656, -0.10806254297494888, 0.1562652289867401, 0.39017853140830994, 0.07932306826114655, 0.07649064809083939, 0.16564488410949707, -0.04243100807070732, 0.15031448006629944, 0.16466523706912994, 0.03903200104832649, -0.07624020427465439, 0.08518151938915253, 0.01761164329946041, -0.08306936919689178, -0.06286395341157913, 0.17147596180438995, -0.08961908519268036, 0.046533096581697464, 0.12252172082662582, -0.12058216333389282, 0.01252360362559557, 0.03356163576245308, 0.004786267410963774, 0.06933747231960297, 0.036571092903614044, -0.07439430058002472, 0.2269831895828247, 0.11421002447605133, -0.01820642128586769, 0.10927485674619675, -0.08457784354686737, -0.04109962657094002, 0.20005734264850616, 0.0221345666795969, 0.1591152548789978, 0.07034002244472504, -0.05008663609623909, 0.240956649184227, 0.30484840273857117, 0.3059438467025757, 0.1122555285692215, 0.26550912857055664, -0.08493936061859131, 0.09165643900632858, 0.19484131038188934, 0.022212374955415726, -0.21789617836475372, -0.047498784959316254, -0.021798737347126007, 0.06457801908254623, -0.04831003397703171, 0.09370774030685425, -0.08076895028352737, 0.02308727242052555, 0.16040043532848358, 0.16763214766979218, 0.20526154339313507, 0.13232184946537018, 0.2519097924232483, -0.4350845217704773, 0.10626387596130371, 0.2200881391763687, 0.1407574862241745, 0.18413451313972473, 0.252689927816391, -0.00016435582074336708, -0.09081578999757767, -0.09572279453277588, 0.010174359194934368, 0.03352776914834976, -0.011098513379693031, 0.28541791439056396, -0.1571083962917328, 0.00611437764018774, -0.05204782262444496, -0.023263271898031235, -0.03847488760948181, 0.08929987996816635, 0.0551750510931015, 0.13879810273647308, -0.047513868659734726, 0.18973013758659363, 0.06247871369123459, -0.2779983580112457, -0.002889827825129032, 0.13684453070163727, -0.16137921810150146, 0.07368743419647217, 0.3031235337257385, 0.2660242021083832, 0.07137025147676468, 0.12895244359970093, -0.004294633865356445, 0.08933182060718536, 0.09159352630376816, 0.27832961082458496, 0.07436272501945496, 0.06096307933330536, 0.14714904129505157, 0.27406346797943115, 0.08090756088495255, -0.13594932854175568, -0.20727285742759705, 0.18160825967788696, -0.010675590485334396, -0.08826667815446854, -0.005987783893942833, 0.12506665289402008, 0.2059815227985382, 0.2165798395872116, 0.1158364936709404, 0.0008149631321430206, 0.3219883143901825, -0.030715566128492355, 0.09353151172399521, 0.15642735362052917, -0.003256021998822689, 0.04913215711712837, 0.025475025177001953, -0.15750417113304138, -0.15998393297195435, -0.053295936435461044, -0.1789708435535431, -0.025478728115558624, -0.06715644150972366, 0.14827139675617218, 0.11338017880916595, -0.33047765493392944, 0.25387752056121826, 0.016786588355898857, 0.11212581396102905, 0.11846622079610825, 0.1401180773973465, 0.011097414419054985, -0.015636343508958817, -0.09327968955039978, 0.18430115282535553, -0.02475128136575222, -0.1897117793560028, 0.0406741127371788, 0.16974157094955444, 0.09057582169771194, -0.1351414918899536, 0.009593753144145012, -0.04571482539176941, -0.14957305788993835, 0.041167281568050385, 0.04993026703596115, 0.024207307025790215, -0.06352629512548447, -0.03473472222685814, 0.10654721409082413, -0.11727089434862137, 0.01039682887494564, -0.01281063724309206, 0.03265073150396347, 0.20234698057174683, -0.021314119920134544, -0.106952004134655, 0.02871842496097088, 0.12149227410554886, 0.19246895611286163, 0.04924420639872551, -0.026507055386900902, 0.09681331366300583, 0.03392918407917023, -0.07792770862579346, -0.0254803579300642, -0.01096845231950283, -0.024972671642899513, -0.028105497360229492, 0.14515100419521332, -0.1013217642903328, 0.05950995534658432, -0.09609606862068176, 0.00827681366354227, 0.018011337146162987, -0.17295683920383453, -0.2940879464149475, 0.0703418180346489, 0.03881339356303215, -0.014024641364812851, -0.031162980943918228, -0.11813351511955261, 0.01997329667210579, 0.1480458378791809, -0.1121339201927185, 0.07083290815353394, 0.009013158269226551, 0.09826831519603729, 0.15180982649326324, 0.07168920338153839, -0.07961840182542801, 0.0755755752325058, 0.07451893389225006, -0.16185326874256134, -0.12091251462697983, -0.08179707825183868, 0.035772304981946945, 0.039322998374700546, -0.08022908121347427, 0.09306507557630539, 0.15448983013629913, 0.03774915635585785, 0.02498563565313816, -0.06301908195018768, -0.13417409360408783, -0.01824740134179592, -0.011507910676300526, 0.12934505939483643, -0.036355551332235336, 0.10246215015649796, 0.0959118902683258, 0.04334331303834915, -0.042295441031455994, 0.0624861903488636, -0.07222941517829895, 0.09249986708164215], [-0.1910727471113205, 0.16009081900119781, 0.009088486433029175, -0.005299478303641081, 0.12733972072601318, 0.08226242661476135, -0.025785354897379875, -0.1370747834444046, -0.048667360097169876, 0.04628441855311394, 0.16368655860424042, 0.13863539695739746, 0.1836186647415161, -0.09480015933513641, -0.0882904902100563, -0.0019152364693582058, 0.004381441045552492, 0.0522242896258831, 0.042981818318367004, -0.32591545581817627, -0.024221669882535934, 0.12495256960391998, 0.17274625599384308, 0.03920503705739975, -0.0729680135846138, -0.06464944034814835, -0.12903831899166107, 0.08164356648921967, 0.07455304265022278, -0.09204278886318207, -0.12334323674440384, 0.036649439483881, -0.1183551475405693, 0.03138241916894913, 0.027440089732408524, -0.24542854726314545, 0.052233677357435226, -0.007679968606680632, -0.02047174610197544, 0.18895049393177032, -0.004010690376162529, 0.041946470737457275, -0.07858892530202866, 0.05690723657608032, -0.12286520004272461, 0.09066003561019897, -0.0521521270275116, -0.02654552273452282, -0.0063307881355285645, 0.15959416329860687, 0.19782984256744385, 0.045807648450136185, -0.12852753698825836, -0.047360919415950775, 0.13640442490577698, 0.005784694571048021, 0.1729336380958557, -0.2968989610671997, 0.047665733844041824, -0.07156319916248322, -0.11964481323957443, -0.038740627467632294, -0.1110738217830658, 0.007531469687819481, -0.11406096816062927, -0.06686466932296753, -0.17912991344928741, 0.1507103443145752, -0.015120081603527069, 0.09308004379272461, 0.10544761270284653, -0.03111034259200096, -0.11587339639663696, -0.03417012095451355, -0.05669156461954117, -0.06023034080862999, -0.01744716428220272, 0.1435241997241974, 0.1997954100370407, 0.2094864696264267, -0.021366987377405167, 5.6291784858331084e-05, -0.41294118762016296, -0.06643256545066833, -0.014427377842366695, -0.07476742565631866, 0.12311197817325592, 0.061723705381155014, 0.06016067788004875, -0.2109047919511795, 0.12637066841125488, 0.01760162226855755, -0.07014292478561401, 0.029871799051761627, -0.07835526764392853, 0.05858379602432251, -0.16435681283473969, -0.09699337929487228, 0.09152746200561523, -0.033581338822841644, -0.15758153796195984, -0.14320498704910278, 0.041475724428892136, 0.08800759166479111, 0.1654028445482254, 0.13670367002487183, 0.0946575179696083, 0.17885398864746094, -0.15366534888744354, 0.21055394411087036, 0.10447357594966888, -0.16457749903202057, -0.10901791602373123, 0.08195585757493973, -0.08780103176832199, 0.06709803640842438, -0.14251098036766052, 0.01909569464623928, -0.05584823340177536, 0.18171365559101105, 0.23555125296115875, -0.15930114686489105, -0.1479061096906662, -0.17716459929943085, 0.013851694762706757, -0.01911027729511261, 0.14549919962882996, 0.12134317308664322, -0.11889134347438812, -0.061575766652822495, 0.1885472536087036, 0.19683359563350677, -0.023552894592285156, -0.11780146509408951, -0.05549541115760803, 0.12631046772003174, 0.08116962760686874, -0.19865559041500092, 0.08219446241855621, -0.14588375389575958, 0.1610667109489441, -0.0902637168765068, 0.26461490988731384, 0.30074357986450195, 0.06552223116159439, 0.032414600253105164, 0.14988762140274048, 0.2628259062767029, -0.221657395362854, -0.09441909193992615, -0.12080859392881393, 0.0018561474280431867, 0.013368293642997742, 0.0893252044916153, -0.3273469805717468, 0.1367834508419037, -0.0041390880942344666, 0.30766379833221436, -0.24895429611206055, 0.024537065997719765, 0.05783238261938095, 0.02606031484901905, -0.010122505947947502, 0.06002788990736008, 0.13349106907844543, -0.015551753342151642, 0.12301965802907944, -0.13158637285232544, 0.00010686372843338177, 0.013206563889980316, 0.14135117828845978, 0.04560178518295288, 0.2903212904930115, 0.23563453555107117, 0.26691222190856934, -0.24314235150814056, 0.154519185423851, -0.05594233423471451, -0.15331506729125977, 0.09933697432279587, -0.08567091077566147, 0.042162228375673294, -0.019629070535302162, 0.2730995714664459, 0.119217149913311, 0.07752320915460587, 0.09872924536466599, -0.0011584139429032803, 0.279741495847702, 0.05056527256965637, -0.02821989357471466, -0.029494401067495346, 0.05308828502893448, 0.07927855104207993, 0.13607841730117798, -0.21669214963912964, 0.2736603319644928, 0.07289763540029526, 0.239096999168396, 0.009205865673720837, -0.16415005922317505, 0.025550609454512596, 0.13531647622585297, -0.16480325162410736, 0.07607533782720566, 0.07194788008928299, -0.007917933166027069, 0.14011384546756744, 0.14167143404483795, 0.019839860498905182, -0.06220143660902977, 0.03898997977375984, 0.022001391276717186, -0.17573648691177368, 0.04115404561161995, 0.0002674488932825625, -0.1179899126291275, -0.10176222771406174, 0.06971954554319382, -0.03530187904834747, -0.0903472900390625, 0.15908026695251465, 0.1591612994670868, -0.04169295355677605, 0.18095555901527405, -0.036708150058984756, 0.04613671451807022, 0.0021464787423610687, -0.13194119930267334, -0.11887750774621964, -0.14014829695224762, 0.08736855536699295, -0.05481131002306938, -0.025550391525030136, 0.07254187017679214, -0.2034296840429306, -0.257735013961792, 0.06661202013492584, 0.14876680076122284, 0.09429950267076492, -0.2347915768623352, 0.0306131299585104, 0.06492980569601059, 0.23993448913097382, -0.03263352811336517, -0.04074450209736824, 0.08914996683597565, 0.11319844424724579, -0.04156896844506264, -0.14161866903305054, -0.07583467662334442, -0.21538245677947998, -0.24296201765537262, -0.08826819062232971, 0.017421213909983635, -0.23250101506710052, -0.08742478489875793, 0.04615510627627373, 0.2031993567943573, -0.18325738608837128, 0.02055744268000126, -0.058800868690013885, 0.05855181813240051, 0.04848610237240791, 0.012601605616509914, -0.18176297843456268, -0.10327810049057007, -0.40000680088996887, 0.06492310017347336, 0.04195955768227577, -0.3192601799964905, 0.047737449407577515, 0.0180327370762825, -0.2819356918334961, -0.05819167196750641, -0.02556891180574894, 0.022963818162679672, 0.02192600630223751, -0.004599887412041426, 0.028839634731411934, -0.28158414363861084, -0.22558759152889252, 0.18371549248695374, -0.09506015479564667, 0.10437775403261185, 0.23911410570144653, -0.033839207142591476, -0.04155798256397247, 0.02378007583320141, 0.028574226424098015, 0.08494450896978378, 0.35284435749053955, 0.1142139658331871, 0.03620827570557594, -0.03730568289756775, -0.06676041334867477, -0.2936556041240692, 0.04980291426181793, -0.22148878872394562, -0.05159810557961464], [-0.15178121626377106, 0.17974740266799927, 0.03281071037054062, 0.07618407160043716, -0.1300925612449646, -0.21858026087284088, -0.06776418536901474, -0.14794017374515533, 0.03967129439115524, -0.06358905881643295, 0.37027567625045776, 0.0028615507762879133, -0.14306725561618805, 0.12341660261154175, -0.0797167420387268, 0.04923855885863304, -0.1937330812215805, -0.0013991842279210687, -0.06478885561227798, -0.21429318189620972, -0.0735107883810997, -0.08808061480522156, -0.1958765685558319, -0.11328581720590591, -0.05082797631621361, 0.16993142664432526, -0.12861810624599457, 0.03673814982175827, -0.1311424970626831, -0.14985167980194092, 0.08966133743524551, 0.09297742694616318, 0.05359781160950661, 0.29946067929267883, -0.13732890784740448, -0.045178044587373734, -0.005219959653913975, -0.04899534583091736, 0.0463617704808712, -0.16314257681369781, 0.033121686428785324, 0.1852906346321106, 0.14186124503612518, -0.1146795004606247, -0.29166606068611145, -0.04354790598154068, -0.0324782133102417, -0.004420929588377476, -0.08162867277860641, -0.16178694367408752, -0.1759582757949829, 0.083281971514225, 0.06197507679462433, -0.07698994874954224, 0.13067908585071564, -0.10045576840639114, 0.02919803373515606, -0.034784410148859024, -0.0958261787891388, 0.17030730843544006, -0.09720820188522339, 0.05566369369626045, 0.22058677673339844, -0.08775167912244797, -0.14195860922336578, 0.06551958620548248, 0.047849394381046295, 0.11640829592943192, 0.016927719116210938, -0.0017559034749865532, -0.18025052547454834, 0.04949008300900459, -0.1126934140920639, -0.1143898218870163, -0.03397505357861519, -0.12215550988912582, -0.18701745569705963, 0.17845340073108673, -0.041590094566345215, -0.025550546124577522, -0.12088325619697571, -0.09257327020168304, -0.13927488029003143, -0.07568328082561493, -0.13928890228271484, -0.21117916703224182, 0.07180904597043991, -0.22838455438613892, 0.16678863763809204, -0.10616595298051834, 0.06728989630937576, 0.09719741344451904, 0.15092924237251282, -0.09907232969999313, -0.1391986459493637, -0.014539895579218864, -0.25947538018226624, 0.16355343163013458, 0.20179718732833862, 0.13260966539382935, 0.03018515557050705, -0.006609300617128611, 0.20836059749126434, 0.24539409577846527, 0.08360948413610458, 0.10826602578163147, -0.17595873773097992, 0.35532501339912415, 0.10733155906200409, -0.11193409562110901, 0.1387791931629181, 0.12645019590854645, 0.0009979592869058251, -0.22696420550346375, 0.03464290127158165, 0.09242074191570282, -0.022561192512512207, 0.0028227653820067644, 0.19448375701904297, 0.155282661318779, 0.14900293946266174, 0.1886892467737198, 0.24693727493286133, -0.00436723418533802, -0.03030582144856453, 0.1935633420944214, 0.10131709277629852, 0.03339747339487076, -0.17665298283100128, -0.055640630424022675, 0.10460500419139862, -0.025864996016025543, 0.005684869363903999, -0.007644928526133299, 0.05094233155250549, 0.03390322998166084, 0.03734660893678665, -0.22390401363372803, 0.0778903216123581, -0.03123624064028263, 0.10913527756929398, 0.12956327199935913, 0.09994716942310333, 0.14826884865760803, -0.030025959014892578, 0.11851813644170761, 0.3500300943851471, -0.06140240281820297, -0.1883680820465088, -0.01899305358529091, 0.2238042652606964, -0.1945274919271469, -0.10981032252311707, -0.034408602863550186, -0.3092738687992096, 0.2449648529291153, -0.1218392550945282, -0.0830388069152832, -0.2310364991426468, 0.03892602398991585, -0.08420281857252121, -0.009915372356772423, -0.14987492561340332, -0.016917956992983818, -0.16551487147808075, -0.34389975666999817, -0.05778837576508522, 0.10169503092765808, -0.18758125603199005, 0.062342818826436996, 0.013596671633422375, 0.11875568330287933, 0.09969931095838547, 0.0671500563621521, 0.06962554156780243, 0.08897314220666885, 0.023715591058135033, -0.04974715784192085, 0.06550751626491547, -0.017981620505452156, 0.008464965038001537, 0.06988241523504257, -0.023600157350301743, -0.035219885408878326, 0.3180709481239319, 0.009074423462152481, 0.12140380591154099, -0.13397692143917084, -0.06705200672149658, 0.1604681760072708, 0.0015696990303695202, -0.04833605885505676, 0.16531726717948914, 0.09154312312602997, 0.13424725830554962, 0.016002191230654716, -0.11007807403802872, 0.04841311648488045, -0.04630289599299431, 0.18573765456676483, 0.06602071970701218, -0.2120605707168579, 0.03667715936899185, 0.09561143815517426, -0.11371908336877823, -0.05569545924663544, -0.09038002789020538, 0.25202229619026184, 0.08064992725849152, 0.07566084712743759, -0.04160541668534279, -0.06422246992588043, 0.042532019317150116, 0.00528164254501462, 0.036673784255981445, 0.08769181370735168, -0.1889643669128418, 0.028612906113266945, -0.21447673439979553, -0.00018334240303374827, -0.033951256424188614, 0.12213603407144547, 0.09948812425136566, 0.13706937432289124, 0.21053718030452728, -0.08919554203748703, 0.018436746671795845, -0.10951529443264008, -0.013981470838189125, 0.0705774575471878, 0.1291254609823227, 0.013236320577561855, 0.04130658134818077, -0.06822006404399872, -0.006030502263456583, 0.15779562294483185, -0.21117740869522095, 0.02277677319943905, 0.18426695466041565, 0.17078639566898346, -0.028561584651470184, 0.15032939612865448, 0.22111767530441284, 0.08444449305534363, 0.043915897607803345, 0.05717536434531212, 0.08015655726194382, 0.015440492890775204, -0.13695019483566284, 0.0431554950773716, 0.08548910915851593, -0.08468407392501831, -0.11700636148452759, -0.03557771071791649, 0.039495475590229034, 0.026530027389526367, 0.07265961915254593, 0.10352054983377457, 0.28839191794395447, -0.0006877309060655534, 0.08172192424535751, 0.043710045516490936, -0.012798755429685116, 0.08123983442783356, 0.012814391404390335, -0.24023577570915222, 0.1138584241271019, -0.07655981183052063, 0.0566035732626915, -0.05337641015648842, -0.05946394056081772, -0.14035801589488983, -0.003237260039895773, -0.019276602193713188, -0.10963805764913559, -0.212675541639328, -0.0013485917588695884, 0.18612001836299896, -0.030662210658192635, -0.13619500398635864, 0.07314659655094147, -0.029753470793366432, 0.05642944574356079, 0.026021379977464676, -0.08796869218349457, -0.023839620873332024, -0.04619207605719566, -0.09954015165567398, -0.030048927292227745, -0.09035243839025497, -0.07438977062702179, 0.24350805580615997, 0.032322946935892105, 0.03485863283276558, 0.12905621528625488, -0.11931747198104858, 0.1478678435087204, 0.22515055537223816, 0.05773631110787392, 0.009509162046015263], [0.19606243073940277, -0.16670145094394684, -0.14400528371334076, -0.1606142222881317, 0.021854037418961525, 0.17905353009700775, 0.034716445952653885, 0.06962361931800842, 0.045084621757268906, -0.14444580674171448, -0.15109829604625702, 0.14217297732830048, -0.028538906946778297, -0.032054584473371506, -0.06462624669075012, 0.05527102202177048, 0.03044378198683262, 0.010442500934004784, 0.12812024354934692, -0.1414489895105362, 0.08197527378797531, 0.04887019470334053, 0.23216867446899414, -0.21365126967430115, -0.01600033789873123, -0.031125932931900024, 0.19266030192375183, 0.08547244966030121, -0.0253909882158041, 0.06630004197359085, 0.015914373099803925, -0.013440207578241825, 0.08053870499134064, 0.07789546251296997, -0.11805717647075653, 0.03651456907391548, 0.11971479654312134, 0.15903720259666443, -0.07386093586683273, 0.13327625393867493, -0.1266208440065384, -0.11529748141765594, 0.13148126006126404, -0.024843374267220497, 0.1290786862373352, 0.059039417654275894, 0.0459369532763958, 0.18246951699256897, 0.32132652401924133, 0.04862411692738533, -0.03539811819791794, 0.016545316204428673, 0.007891234010457993, 0.23490694165229797, -0.2232946902513504, 0.14386333525180817, 0.1337612420320511, 0.08159292489290237, 0.05886957794427872, 0.11454904079437256, 0.213257297873497, 0.09386882185935974, -0.059242118149995804, 0.0021851828787475824, -0.26046743988990784, 0.054719679057598114, 0.029581459239125252, 0.18932059407234192, -0.07480746507644653, -0.21106505393981934, 0.0900106206536293, 0.02446303889155388, 0.2519799470901489, 0.038367412984371185, 0.017675839364528656, 0.10309506952762604, 0.137404203414917, 0.2922992408275604, 0.18456953763961792, 0.08326785266399384, 0.100546695291996, 0.061011847108602524, -0.0037467293441295624, 0.12723609805107117, -0.020993242040276527, 0.3130263388156891, -0.27015894651412964, 0.05156819149851799, 0.06336994469165802, -0.020557455718517303, -0.041436485946178436, 0.0788097083568573, -0.11465316265821457, -0.029791392385959625, -0.05369595065712929, -0.05188319459557533, 0.10857784003019333, -0.13031359016895294, -0.189749076962471, -0.174950510263443, 0.15758077800273895, -0.1681077480316162, -0.05878322198987007, 0.08604509383440018, -0.02565893717110157, 0.013085335493087769, -0.04611745476722717, -0.012882731854915619, -0.17576564848423004, 0.014260376803576946, 0.034262947738170624, 0.006343925837427378, -0.12056031078100204, 0.1292772889137268, 0.10219262540340424, 0.056401874870061874, 0.03695358335971832, 0.009148990735411644, -0.14234645664691925, 0.1527007818222046, -0.20782484114170074, -0.06548856943845749, 0.055053263902664185, -0.1735236644744873, 0.1102995052933693, -0.04278714209794998, 0.04470544680953026, 0.12429539114236832, -0.017899638041853905, 0.13253940641880035, 0.15868976712226868, -0.04492293298244476, -0.06799931824207306, -0.15974850952625275, 0.11902410537004471, 0.00023293224512599409, -0.30733615159988403, 0.31524568796157837, 0.026727527379989624, 0.09720861911773682, -0.08846936374902725, -0.12861980497837067, -0.05324120819568634, 0.09158077090978622, 0.07188340276479721, 0.08261322230100632, -0.201185405254364, 0.14155296981334686, 0.03833101689815521, -0.12018908560276031, -0.06058279797434807, 0.38246628642082214, -0.04642549529671669, 0.1942218393087387, 0.21167361736297607, -0.03866581246256828, -0.24071787297725677, -0.04704294726252556, 0.14002463221549988, -0.028509603813290596, -0.1823950558900833, -0.08780831843614578, 0.2067902535200119, 0.16249291598796844, 0.1914030909538269, 0.058614861220121384, 0.02816445380449295, -0.05284180864691734, 0.01335627119988203, -0.25320741534233093, 0.038662225008010864, 0.1417134553194046, -0.22023026645183563, -0.04200183227658272, 0.023070547729730606, 0.18786953389644623, 0.2593138515949249, -0.16168297827243805, 0.0039158477447927, -0.452019602060318, 0.022606821730732918, -0.023763392120599747, 0.059473924338817596, -0.2986242473125458, -0.36607813835144043, 0.025440726429224014, 0.04853278398513794, 0.11760327219963074, 0.20169278979301453, 0.00511925108730793, 0.10139181464910507, -0.025250287726521492, 0.20963650941848755, -0.11094918102025986, 0.1091906949877739, -0.14736151695251465, -0.23402313888072968, -0.2883009910583496, 0.1685800701379776, -0.16700002551078796, -0.27537697553634644, 0.06439696997404099, -0.048699744045734406, 0.015034201554954052, 0.028019661083817482, -0.15280506014823914, 0.09198937565088272, 0.06890279799699783, -0.17005981504917145, -0.009831571951508522, -0.017645297572016716, 0.0884040966629982, 0.08040167391300201, 0.05521925911307335, -0.07026129215955734, 0.11120972782373428, 0.060940466821193695, -0.19240069389343262, 0.040878817439079285, -0.08180610835552216, 0.042962584644556046, -0.11210629343986511, 0.16834627091884613, 0.024845821782946587, 0.2560369372367859, 0.11175502091646194, -0.030032753944396973, 0.1078120544552803, 0.08882635831832886, 0.0759037509560585, -0.055112577974796295, -0.05057929828763008, 0.010220733471214771, -0.045109789818525314, -0.204631045460701, -0.05985139310359955, 0.15274769067764282, -0.09233026206493378, -0.09962382167577744, 0.22786545753479004, 0.10187438130378723, 0.16087649762630463, -0.04653623700141907, -0.09431357681751251, -0.06712362170219421, -0.1160396933555603, -0.13165532052516937, -0.00909179262816906, 0.024271653965115547, -0.05868498235940933, 0.00854829978197813, 0.19258828461170197, -0.015301822684705257, 0.018321717157959938, 0.015959884971380234, 0.20077846944332123, -0.06240605562925339, 0.024035146459937096, 0.02623869478702545, -0.060982029885053635, -0.01957838423550129, -0.05622066184878349, 0.028596181422472, 0.06390959769487381, -0.23687347769737244, 0.03995482996106148, 0.1818600296974182, -0.06842269003391266, -0.0028437641449272633, 0.2514333426952362, -0.031297847628593445, 0.017583979293704033, 0.016896720975637436, 0.03982063755393028, -0.05371975898742676, 0.13150560855865479, 0.08292283117771149, -0.08487530797719955, -0.12377310544252396, -0.027867309749126434, -0.06964423507452011, -0.1697174310684204, -0.1458643227815628, 0.08308529108762741, 0.09620948880910873, -0.06627579033374786, 0.08033936470746994, -0.0353364571928978, 0.0022839403245598078, 0.025034820660948753, 0.11258778721094131, -0.016205444931983948, -0.17386040091514587, -0.10069021582603455, -0.07230232656002045, -0.029291097074747086, -0.06540406495332718, -0.16608794033527374, 0.016939908266067505, -0.023387545719742775], [-0.07031708210706711, -0.0015946654602885246, 0.07728858292102814, 0.18236862123012543, 0.14690536260604858, -0.02178412303328514, 0.3694057762622833, 0.055514607578516006, 0.07566951215267181, 0.0036542052403092384, 0.12948691844940186, 0.05262104049324989, 0.008300113491714, 0.26931068301200867, 0.11186546087265015, 0.42546504735946655, 0.07284567505121231, -0.025555022060871124, -0.19740000367164612, -0.058751191943883896, 0.04340984299778938, -0.028853069990873337, -0.24914664030075073, -0.21180760860443115, 0.05842015892267227, 0.014903470873832703, 0.14269375801086426, 0.25020483136177063, -0.07279049605131149, 0.13095538318157196, 0.08554194867610931, 0.14219382405281067, 0.1179085299372673, -0.1038510650396347, 0.18336765468120575, 0.17030921578407288, 0.07124078273773193, 0.14682218432426453, 0.10259416699409485, 0.07137073576450348, 0.0912432000041008, 0.13188645243644714, -0.08220776170492172, 0.28577566146850586, 0.1370132565498352, -0.026530509814620018, -0.02773846872150898, 0.1761520802974701, -0.034605707973241806, -0.23862726986408234, -0.07927245646715164, -0.006065300200134516, -0.024482253938913345, -0.039492297917604446, 0.049448736011981964, -0.13639435172080994, 0.03752997890114784, 0.1310277283191681, -0.17479154467582703, -0.12117145955562592, 0.1026768907904625, 0.11770827323198318, 0.18832717835903168, 0.27042704820632935, -0.04720634967088699, -0.035029493272304535, 0.2964347302913666, -0.0881541520357132, 0.10023482888936996, 0.20271989703178406, 0.06705467402935028, -0.04735344648361206, 0.19215591251850128, 0.1196998581290245, -0.054673921316862106, 0.0043556345626711845, 0.06842217594385147, -0.0494929738342762, 0.25780513882637024, -0.13322663307189941, 0.15858778357505798, -0.09120750427246094, -0.024846846237778664, -0.09058480709791183, 0.2741318941116333, 0.02370455674827099, -0.03570553660392761, -0.040856052190065384, 0.07736506313085556, 0.037582725286483765, 0.3196322023868561, 0.1303371787071228, 0.01535432692617178, -0.18018768727779388, 0.11331282556056976, 0.20246589183807373, 0.2373327612876892, 0.250657856464386, 0.07188428193330765, 0.05461408570408821, 0.08847323805093765, -0.04745487868785858, 0.0658499151468277, 0.10196170955896378, -0.004355667624622583, 0.12208880484104156, -0.07664833217859268, -0.11856899410486221, -0.019096985459327698, 0.09448607265949249, -0.06026395410299301, -0.008916119113564491, 0.18492649495601654, 0.11653679609298706, -0.0822046622633934, -0.3249245285987854, -0.07099063694477081, -0.0758981928229332, 0.023468606173992157, 0.31447160243988037, 0.21788069605827332, -0.12186066806316376, -0.14878152310848236, -0.00857359729707241, 0.11661867797374725, -0.03406400606036186, -0.019003145396709442, -0.09996182471513748, -0.07265843451023102, 0.07181623578071594, -0.13729815185070038, 0.22351600229740143, 0.24167466163635254, 0.04960346966981888, 0.060792528092861176, -0.24817925691604614, 0.04318717122077942, 0.3024737536907196, 0.067921943962574, -0.09430254995822906, -0.21411895751953125, -0.009007617831230164, -0.0690777450799942, -0.11549737304449081, 0.006104066502302885, -0.01885569840669632, -0.14497853815555573, -0.05829963833093643, -0.09510102868080139, 0.039053332060575485, 0.14032143354415894, 0.055522967129945755, -0.18888349831104279, 2.635215969348792e-05, 0.08555970340967178, 0.0995311290025711, -0.07521504163742065, -0.028950531035661697, 0.17903657257556915, 0.042399149388074875, 0.15291550755500793, -0.19322843849658966, -0.1667562574148178, 0.04113670811057091, 0.11655637621879578, 0.03772956132888794, -0.0562240406870842, -0.06157810240983963, -0.09367641806602478, 0.1362677961587906, -0.030008841305971146, 0.12785331904888153, -0.2960786819458008, -0.21326030790805817, -0.078805111348629, 0.16156762838363647, 0.1382225900888443, 0.07828016579151154, 0.03913117200136185, 0.06631939858198166, 0.052267514169216156, -0.29265096783638, 0.13264642655849457, 0.21146465837955475, -0.053569238632917404, 0.1181771457195282, -0.142062246799469, 0.21918338537216187, -0.2212393432855606, 0.084383025765419, -0.1436903029680252, 0.2684817612171173, -0.005445140413939953, -0.021016668528318405, 0.12401749193668365, 0.18833404779434204, 0.0017648477805778384, -0.029127763584256172, 0.18721911311149597, 0.0635518729686737, -0.08903872966766357, 0.12683892250061035, -0.2467242032289505, 0.02885511703789234, -0.0069600483402609825, 0.08302182704210281, 0.10004331916570663, 0.016776306554675102, -0.10584275424480438, 0.12003473192453384, 0.10761553049087524, 0.04576680809259415, 0.08345293253660202, 0.09758310765028, -0.2129053771495819, 0.10625460743904114, -0.02558049000799656, 0.05694436654448509, -0.009449848905205727, 0.166086807847023, 0.38684388995170593, 0.006246823817491531, 0.012369181029498577, 0.1759221851825714, -0.017356792464852333, -0.06400546431541443, 0.059109997004270554, -0.06080424040555954, 0.012603851966559887, -0.0034098015166819096, -0.06912693381309509, 0.0444464385509491, -0.0038878077175468206, -0.08286622911691666, 0.014294562861323357, 0.22678500413894653, -0.2015635073184967, 0.08440978080034256, 0.0007064602104946971, 0.09565439820289612, -0.0923803374171257, 0.10496809333562851, 0.0190995242446661, -0.2123245745897293, -0.07251913100481033, -0.03945624455809593, -0.006426959298551083, 0.018025875091552734, 0.03504351153969765, -0.06365297734737396, 0.016190189868211746, 0.11889874935150146, -0.09350022673606873, -0.03500129282474518, 0.050595518201589584, -0.08309978246688843, -0.009988488629460335, 0.026423361152410507, 0.05687751993536949, -0.053804557770490646, 0.05179222300648689, -0.10282333940267563, -0.08741876482963562, -0.05563092231750488, 0.1183822900056839, -0.05433209612965584, 0.010182628408074379, 0.14447186887264252, 0.15966302156448364, -0.12817488610744476, 0.042229026556015015, -0.11365310102701187, -0.19222718477249146, 0.05053377151489258, 0.15680694580078125, 0.007678142283111811, 0.002383777406066656, -0.2746908366680145, -0.09497670084238052, -0.1474323570728302, 0.11012114584445953, -0.04133356362581253, 0.037430427968502045, 0.26403185725212097, -0.011072875000536442, 0.07661318778991699, -0.06391710788011551, -0.04112895578145981, 0.07171547412872314, -0.056796833872795105, 0.1138792484998703, 0.10392210632562637, 0.11280206590890884, 0.03947567939758301, -0.09064827859401703, 0.12803538143634796, -0.07102441042661667, 0.11542722582817078, -0.009607559069991112, 0.046057991683483124], [0.2692753076553345, -0.2041722983121872, 0.09723161160945892, -0.10623020678758621, 0.13814420998096466, 0.05516793206334114, 0.06299220025539398, 0.22034265100955963, 0.19860795140266418, 0.27562111616134644, -0.0064387996681034565, 0.3102428615093231, 0.1460171788930893, -0.10158532857894897, -0.04754051938652992, -0.07229191809892654, 0.09703792631626129, -0.25939658284187317, -0.17998187243938446, -0.27498096227645874, 5.24087154190056e-05, -0.13874584436416626, -0.07668451219797134, -0.08025266975164413, 0.2556830644607544, 0.057008206844329834, 0.14254775643348694, 0.34148144721984863, -0.2297864556312561, 0.26035264134407043, -0.23955008387565613, 0.01609276607632637, -0.12765108048915863, 0.07775682955980301, 0.13883844017982483, 0.03342834860086441, -0.02923554554581642, 0.03779724985361099, -0.22191637754440308, 0.022585269063711166, 0.1210421696305275, 0.20296710729599, -0.007830871269106865, 0.2198820412158966, 0.08589319884777069, 0.09530553966760635, -0.00630846805870533, 0.06090673431754112, -0.09671851247549057, -0.10979964584112167, 0.20882657170295715, 0.4472831189632416, -0.16277936100959778, -0.2059745192527771, -0.06559723615646362, -0.15463054180145264, 0.12956960499286652, 0.013646896928548813, -0.22406506538391113, 0.20945525169372559, -0.08718803524971008, -0.06573068350553513, -0.018808692693710327, 0.23900175094604492, -0.19228892028331757, 0.3219414949417114, -0.006850770674645901, 0.2046697437763214, 0.4019221067428589, 0.040549278259277344, 0.056928761303424835, -0.06269866973161697, -0.24394530057907104, 0.3756978213787079, 0.16657426953315735, 0.06559482961893082, -0.10730049014091492, 0.29039067029953003, -0.20083698630332947, -0.12196306139230728, 0.07829099148511887, -0.28293949365615845, 0.04745107144117355, 0.06509249657392502, -0.15094804763793945, 0.11701516807079315, -0.23235097527503967, -0.09018592536449432, 0.19575965404510498, -0.14288459718227386, -0.004126288462430239, 0.0768270418047905, 0.00290291546843946, 0.18777373433113098, 0.07687211036682129, 0.02229517698287964, 0.0010790182277560234, 0.15319684147834778, 0.1841905266046524, 0.030277954414486885, 0.08891528099775314, 0.23004893958568573, 0.22598710656166077, 0.14869262278079987, 0.20366881787776947, 0.2562260329723358, 0.18145784735679626, 0.22485150396823883, -0.06882546097040176, 0.08012130111455917, 0.06378638744354248, 0.06576051563024521, -0.18427488207817078, 0.1383095383644104, 0.10401150584220886, 0.13498222827911377, 0.02335619367659092, 0.29778853058815, 0.13770990073680878, 0.0907127782702446, 0.0424959696829319, 0.33939826488494873, 0.2782912254333496, 0.20687860250473022, 0.130615234375, 0.11665184795856476, 0.028979649767279625, 0.11674104630947113, -0.19205787777900696, 0.03304243087768555, 0.27980995178222656, 0.2077053040266037, 0.31040215492248535, 0.09030814468860626, -0.05358460918068886, 0.3736858665943146, 0.21915856003761292, 0.14736735820770264, 0.08441474288702011, 0.04898887872695923, 0.3157282769680023, -0.1310759037733078, 0.17392750084400177, 0.11001639068126678, 0.08460856229066849, 0.2339308112859726, -0.11564434319734573, 0.08498938381671906, 0.18922826647758484, 0.043570537120103836, 0.17262116074562073, 0.066435806453228, -0.02113424800336361, 0.13181756436824799, 0.08726130425930023, 0.3071645200252533, -0.01784888468682766, 0.22191734611988068, 0.3261107802391052, 0.005854338873177767, 0.12367809563875198, 0.11058107018470764, -0.08132991939783096, 0.18531844019889832, 0.3967246413230896, -0.06686516106128693, 0.130315363407135, 0.16251695156097412, -0.000980766606517136, 0.27127978205680847, 0.227981835603714, 0.278967946767807, -0.05417792871594429, -0.017194868996739388, 0.041539695113897324, 0.26353779435157776, 0.08384311944246292, 0.1379035860300064, 0.23059774935245514, -0.10997673869132996, -0.06506215780973434, 0.1064118891954422, 0.06546318531036377, 0.13706046342849731, 0.11053572595119476, 0.06354842334985733, -0.0974125787615776, 0.3437510132789612, -0.02608323283493519, 0.15011897683143616, 0.024869050830602646, 0.13519690930843353, 0.1657656878232956, 0.13402391970157623, 0.19190099835395813, 