{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_3", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "float32", "sparse": false, "ragged": false, "name": "embdsOutput"}, "name": "embdsOutput", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[-0.4420517683029175, 0.08589223772287369, -0.28723812103271484, 0.170699805021286, -0.07777132093906403, 0.3315282464027405, 0.14026516675949097, -0.2202201783657074, 0.2802529036998749, 0.25856027007102966, 0.22234345972537994, 0.018114350736141205, 0.07573401927947998, 0.03989037498831749, -0.2495458871126175, -0.29653194546699524, -0.019877750426530838, 0.24042637646198273, -0.08156358450651169, -0.17644761502742767, 0.19002141058444977, 0.025208251550793648, -0.08015810698270798, -0.1421716809272766, 0.23271328210830688, 0.5064806938171387, 0.047939054667949677, 0.06878453493118286, -0.18280360102653503, -0.01673354208469391, 0.0977458730340004, 0.015891283750534058, 0.18401388823986053, -0.34152841567993164, -0.12125115096569061, 0.2426065355539322, 0.03724461793899536, -0.08075946569442749, -0.0800250768661499, -0.11238805949687958, -0.21717989444732666, -0.009708808735013008, 0.3108317255973816, 0.22729448974132538, 0.17306265234947205, -0.0961245596408844, 0.08645691722631454, 0.01382689643651247, -0.08376533538103104, -0.1288253217935562, 0.2745119035243988, 0.12711398303508759, 0.03969551622867584, -0.20655064284801483, -0.08747952431440353, 0.3220311999320984, -0.059798143804073334, -0.043375298380851746, 0.10302052646875381, -0.15802685916423798, -0.040585581213235855, 0.1162082850933075, -0.013232839293777943, -0.0007227615569718182, -0.13912545144557953, -0.08266155421733856, 0.17812705039978027, -0.22886012494564056, -0.1844177097082138, 0.19176295399665833, -0.14281806349754333, 0.005402826704084873, 0.3469216823577881, -0.025559548288583755, -0.15312525629997253, -0.10504718869924545, 0.024320874363183975, -0.004348814021795988, -0.13174638152122498, -0.16255374252796173, -0.11511069536209106, -0.12939196825027466, -0.2361714243888855, 0.08726745843887329, 0.02328639104962349, -0.21398743987083435, 0.336343914270401, 0.14017346501350403, 0.22362692654132843, 0.0675804540514946, -0.15603122115135193, 0.19856533408164978, -0.19508838653564453, -0.2700149714946747, 0.30016276240348816, 0.024950368329882622, -0.20540307462215424, -0.27299565076828003, 0.011991060338914394, -0.0626504048705101, 0.19694769382476807, 0.09053505212068558, 0.3320505917072296, 0.13626457750797272, 0.10745463520288467, 0.04962385818362236, -0.015344813466072083, -0.09536464512348175, 0.23834121227264404, 0.0639980137348175, -0.09969984740018845, 0.06462559849023819, -0.23225142061710358, 0.19528068602085114, 0.009485723450779915, -0.2096310555934906, -0.0428936630487442, -0.08421424776315689, -0.011724566109478474, -0.06261757016181946, 0.12160700559616089, -0.1381232738494873, -0.2462531179189682, -0.02602768875658512, 0.263816773891449, 0.2614688575267792, -0.04321875050663948, -0.06116137653589249, 0.24099059402942657, 0.23769374191761017, -0.12473177909851074, 0.08847831934690475, 0.08317514508962631, 0.03960013762116432, -0.05179951712489128, -0.20659005641937256, 0.10224410146474838, 0.0347040556371212, -0.11783599853515625, -0.06985971331596375, 0.017245685681700706, 0.030247243121266365, 0.16966885328292847, 0.19751034677028656, 0.15766921639442444, 0.09499167650938034, 0.09792623668909073, 0.15875306725502014, -0.13424256443977356, 0.006500924937427044, -0.26835641264915466, -0.039982762187719345, -0.2504933774471283, -0.04517672210931778, 0.1563723087310791, 0.05421815440058708, 0.08007849007844925, 0.43022391200065613, 0.12979674339294434, -0.0897652804851532, 0.20080161094665527, -0.11368130892515182, -0.1014421284198761, 0.033347081393003464, -0.24877974390983582, 0.06860338896512985, 0.0616050586104393, -0.18239083886146545, 0.02641017735004425, 0.3799900710582733, 0.04511056840419769, 0.01797081157565117, 0.012769367545843124, -0.10952527076005936, 0.1631660759449005, 0.2126455008983612, -0.2216705083847046, 0.18799860775470734, 0.007184457033872604, -0.10899131745100021, -0.2167033851146698, -0.036109209060668945, 0.008685402572154999, -0.02093430608510971, 0.08613385260105133, 0.2368471324443817, 0.04495321214199066, -0.06086213141679764, -0.0007293876260519028, -0.47120553255081177, 0.21176820993423462, 0.189775288105011, -0.05095053091645241, 0.08414294570684433, 0.048304688185453415, 0.04388098046183586, -0.20433641970157623, 0.1601085513830185, -0.07449989765882492, 0.3514024019241333, 0.2038244903087616, -0.06336190551519394, -0.052020031958818436, 0.015761837363243103, 0.13811996579170227, -0.4756329655647278, 0.33830684423446655, 0.02551417239010334, -0.08191870152950287, -0.3260076642036438, 0.17933917045593262, -0.006585088558495045, 0.059185925871133804, 0.04991281405091286, 0.0723787397146225, 0.24951626360416412, 0.22173269093036652, -0.04601447656750679, -0.07136788964271545, -0.03692973405122757, 0.0008598253480158746, 0.14270153641700745, 0.15857398509979248, 0.2504144012928009, -0.09476131945848465, -0.08253967016935349, 0.11953838914632797, -0.10039576143026352, -0.1225103810429573, 0.07597903162240982, -0.22170068323612213, 0.08250564336776733, -0.12759725749492645, 0.07544642686843872, -0.04534336179494858, 0.001582827535457909, 0.27540141344070435, 0.008064182475209236, 0.041917700320482254, -0.0697004571557045, 0.09339673072099686, 0.02525094337761402, -0.21916872262954712, -0.042998332530260086, 0.1542203575372696, 0.05252205580472946, -0.015346057713031769, 0.07542966306209564, -0.02063657157123089, 0.029230771586298943, -0.370035856962204, 0.014479934237897396, 0.1876211166381836, -0.08496899902820587, 0.0047974251210689545, -0.18572571873664856, 0.020251650363206863, 0.08096226304769516, -0.07955307513475418, -0.10813549906015396, -0.10989554226398468, 0.28302469849586487, -0.1134139820933342, 0.0522950142621994, 0.022753216326236725, 0.11797501146793365, -0.06523629277944565, 0.10842185467481613, -0.11761878430843353, -0.10149295628070831, 0.15459510684013367, -0.009244216606020927, 0.08626506477594376, 0.06858787685632706, 0.04467027261853218, -0.05379324033856392, 0.05943477526307106, 0.02506503462791443, 0.15501712262630463, 0.09790118038654327, -0.01272457093000412, 0.031963735818862915, -0.0891289934515953, 0.019137931987643242, 0.1054886132478714, -0.1030275970697403, 0.04554203525185585, -0.022045012563467026, -0.07171813398599625, -0.017633885145187378, -0.18447861075401306, 0.08413787186145782, -0.1843176633119583, 0.029470203444361687, -0.04296887665987015, 0.004319685511291027, -0.04308903217315674, 0.17899350821971893, 0.16939769685268402, -0.01842688024044037], [-0.17281830310821533, 0.09800175577402115, 0.0674191415309906, -0.04660458490252495, 0.0314318910241127, -0.17587898671627045, -0.15436391532421112, 0.04159897193312645, -0.09551026672124863, 0.04576722905039787, -0.029492676258087158, -0.13463866710662842, 0.007363665383309126, 0.13451063632965088, -0.16392438113689423, -0.21280410885810852, -0.00509176030755043, 0.28445199131965637, 0.003096570959314704, -0.014337007887661457, -0.022038869559764862, 0.004136708565056324, -0.039663445204496384, -0.014571215957403183, -0.1648663580417633, -0.011652304790914059, -0.20060069859027863, 0.00541351642459631, -0.043183572590351105, -0.17844077944755554, 0.06705965846776962, 0.050642456859350204, 0.022505687549710274, 0.053294047713279724, 0.13107888400554657, 0.07275298237800598, 0.1505766659975052, -0.043138377368450165, 0.031485993415117264, 0.05565807968378067, -0.00824724044650793, -0.0032196512911468744, 0.05500887334346771, 0.05904783681035042, 0.06764940917491913, -0.25009459257125854, 0.09341582655906677, 0.06207076087594032, -0.1622212529182434, 0.03610454127192497, 0.028469307348132133, -0.22955243289470673, -0.031345006078481674, -0.09716397523880005, 0.025276120752096176, 0.054117120802402496, -0.18340842425823212, 0.06282874196767807, 0.11213512718677521, -0.12268353998661041, 0.049602627754211426, -0.10414954274892807, -0.07129403203725815, -0.16825008392333984, 0.020556701347231865, -0.1349390298128128, 0.30393800139427185, 0.22216476500034332, 0.08349842578172684, -0.19104240834712982, 0.042403433471918106, -0.11940579861402512, -0.11397989094257355, 0.16066735982894897, -0.12567250430583954, -0.11825305223464966, -0.07613998651504517, -0.23141878843307495, -0.20822761952877045, 0.06694802641868591, 0.049330659210681915, -0.07018577307462692, -0.10217483341693878, 0.06022652983665466, -0.009635353460907936, 0.002106632571667433, 0.04778807982802391, 0.09939073026180267, -0.031547557562589645, -0.019761178642511368, -0.010590269230306149, -0.16370461881160736, 0.07171124964952469, -0.02922837622463703, 0.07285186648368835, 0.09584939479827881, -0.0804358720779419, -0.012346583418548107, -0.1475881040096283, -0.10548707842826843, 0.16831642389297485, 0.14099210500717163, -0.006560424342751503, -0.08790946006774902, -0.006964773405343294, -0.12225830554962158, -0.02233291044831276, -0.03816220536828041, -0.007947192527353764, -0.15767395496368408, 0.14519505202770233, 0.13682474195957184, 0.1309538334608078, 0.014957143925130367, -0.01431211270391941, -0.050901442766189575, 0.055683594197034836, 0.03484269231557846, -0.2187492549419403, -0.09098432958126068, 0.04503406211733818, -0.05539131909608841, -0.15703347325325012, -0.12458527833223343, -0.23361465334892273, -0.2323630303144455, -0.00223676860332489, -0.08639030158519745, 0.016489818692207336, -0.026759104803204536, 0.042885828763246536, 0.018887486308813095, 0.1661132276058197, -0.11299073696136475, 0.2300390601158142, -0.09408799558877945, 0.08468092978000641, 0.24123094975948334, 0.24455168843269348, -0.12487765401601791, -0.019438361749053, -0.011178215965628624, -0.1121450737118721, 0.08955976366996765, -0.07884938269853592, 0.24967145919799805, 0.15090905129909515, -0.003742891363799572, 0.04399408772587776, -0.16155391931533813, -0.08821973204612732, -0.16259264945983887, -0.1396787464618683, 0.07515531778335571, 0.08712675422430038, -0.09413692355155945, -0.004094965290278196, 0.08847270160913467, 0.04182220995426178, -0.06621477007865906, 0.16549064218997955, -0.20687919855117798, -0.330770879983902, -0.001477929181419313, -0.182818204164505, 0.1812146157026291, -0.04826447367668152, -0.0999801829457283, 0.05809599161148071, 0.03968806192278862, -0.052864618599414825, 0.02714156173169613, -0.0748002678155899, -0.1369369924068451, -0.13603425025939941, -0.02314358949661255, -0.1901407539844513, 0.017056068405508995, 0.2710607945919037, 0.2619437277317047, -0.023647503927350044, -0.20093494653701782, 0.09824330359697342, 0.052281852811574936, -0.03533811867237091, -0.05195024237036705, -0.19133101403713226, 0.15996059775352478, 0.06367605179548264, 0.04222197085618973, -0.1806463897228241, 0.14304307103157043, -0.09752921760082245, -0.03450029343366623, 0.2163585126399994, 0.1847657859325409, -0.10223837941884995, -0.011098554357886314, 0.024468427523970604, 0.01444344874471426, -0.07549382746219635, -0.0632077157497406, 0.04851343110203743, 0.06689496338367462, -0.16538724303245544, 0.06477922201156616, -0.025319477543234825, -0.04565216600894928, 0.01660650596022606, 0.11676689982414246, 0.005063468124717474, 0.03157677873969078, 0.05471130087971687, -0.011874780990183353, 0.009487450122833252, -0.05583880469202995, -0.1348109394311905, -0.02345993183553219, -0.09164567291736603, -0.09269829839468002, -0.22372183203697205, 0.010933552868664265, -0.010616199113428593, 0.021791284903883934, -0.0485079325735569, -0.04528318718075752, 0.06045139953494072, -0.10046739876270294, -0.056278906762599945, -0.029356345534324646, 0.06755858659744263, -0.17034794390201569, 0.016392244026064873, -0.041975270956754684, -0.10345339775085449, -0.03572174161672592, -0.09113707393407822, -0.04642083868384361, 0.04280153661966324, -0.06864164024591446, -0.04615958407521248, -0.04607126861810684, -0.03499720245599747, 0.1808454990386963, -0.04766111448407173, -0.0006614451413042843, -0.35715916752815247, 0.005910848267376423, -0.023033294826745987, 0.06179901212453842, 0.0036121944431215525, 0.0831892117857933, 0.199430912733078, -0.08060736954212189, -0.04761740192770958, -0.028835434466600418, -0.025741705670952797, -0.07574082911014557, -0.0930948480963707, 0.0294386874884367, -0.04410068318247795, -0.02419591322541237, 0.006296266335994005, 0.027098726481199265, 0.00874684564769268, 0.11229176074266434, 0.0707014873623848, 0.026029951870441437, -0.12365647405385971, -0.25576815009117126, -0.03263479471206665, 0.02639833651483059, -0.0833907425403595, -0.15323051810264587, -0.08185683935880661, 0.014910784550011158, -0.06497886031866074, -0.02141629345715046, -0.050954725593328476, -0.03683561086654663, -0.015412090346217155, 0.05902690067887306, -0.0658443495631218, -0.10382308065891266, -0.0626615583896637, -0.0859624594449997, -0.06678013503551483, -0.029391657561063766, 0.0662897452712059, -0.0030733866151422262, 0.09156883507966995, -0.26812365651130676, -0.04954799264669418, -0.007349527906626463, -0.12959374487400055, -0.10375618934631348, -0.04774942994117737, 0.017263974994421005, -0.016896219924092293, 0.044295866042375565], [-0.038784559816122055, -0.38581833243370056, -0.05052027851343155, -0.09860334545373917, 0.015404455363750458, -0.021150153130292892, -0.04463796690106392, -0.21126537024974823, -0.22349083423614502, 0.005702016409486532, 0.058838967233896255, -0.26385730504989624, 0.13053569197654724, -0.05337879806756973, 0.11950398981571198, -0.039052367210388184, -0.21090207993984222, 0.04085443541407585, -0.23288439214229584, -0.2009199559688568, -0.07566192001104355, 0.047440990805625916, -0.24637213349342346, -0.21813984215259552, -0.33563855290412903, -0.313899427652359, 0.057459354400634766, -0.0695309117436409, 0.20913025736808777, -0.018874524161219597, -0.1195739135146141, -0.19019772112369537, -0.11524047702550888, -0.074315644800663, -0.011233885772526264, -0.41869819164276123, -0.04748429358005524, 0.14625278115272522, 0.035261496901512146, 0.04970641806721687, -0.1208784282207489, 0.29605334997177124, -0.09165257215499878, -0.01767674833536148, -0.10642145574092865, 0.11184622347354889, 0.1732558310031891, -0.07081359624862671, -0.08071934431791306, -0.16807515919208527, 0.12268635630607605, 0.017739126458764076, -0.22043703496456146, -0.12300647050142288, 0.18364019691944122, -0.23672820627689362, -0.01238641794770956, 0.05263248831033707, -0.14070740342140198, -0.2998131215572357, -0.054136503487825394, -0.010109505616128445, -0.1842970997095108, -0.27375876903533936, 0.0022124943789094687, 0.1994105726480484, -0.20650306344032288, -0.07411325722932816, -0.08645643293857574, -0.07625093311071396, -0.3734261691570282, 0.06460905820131302, -0.05357186868786812, -0.24296805262565613, 0.23902128636837006, -0.002273198449984193, -0.17037513852119446, -0.1531093865633011, 0.06451952457427979, -0.017109340056777, -0.08905547857284546, -0.1940612643957138, 0.16070617735385895, -0.1451868861913681, -0.33474332094192505, 0.061341699212789536, -0.2739429771900177, -0.15590621531009674, -0.25925198197364807, 0.011851505376398563, 0.06293977797031403, -0.3810981214046478, 0.21097663044929504, -0.08156903833150864, -0.24375687539577484, 0.23410338163375854, 0.0010215496877208352, 0.09732481092214584, 0.03826749697327614, 0.3062393367290497, -0.4358028471469879, -0.10109642148017883, -0.20263533294200897, -0.04366813600063324, -0.06034917011857033, -0.011542378924787045, -0.21567215025424957, 0.03602687269449234, 0.0544709786772728, -0.05827667936682701, -0.10304483771324158, -0.03721523657441139, 0.038044121116399765, -0.17278441786766052, 0.024387754499912262, 0.02358347922563553, 0.21344812214374542, -0.02867983840405941, -0.04844781383872032, -0.036178670823574066, -0.0551542304456234, 0.37056630849838257, -0.034072957932949066, -0.06727524846792221, -0.040089383721351624, -0.10705330222845078, -0.04404686018824577, -0.10576280206441879, 0.12057706713676453, -0.14909708499908447, 0.13105110824108124, -0.09747491031885147, -0.09564804285764694, -0.05254010111093521, 0.22931857407093048, 0.04754034802317619, -0.0678495392203331, -0.13608971238136292, -0.05873337760567665, -0.22239066660404205, 0.006825234275311232, 0.028618117794394493, -0.10025124996900558, -0.12722386419773102, -0.0883760079741478, -0.3034778833389282, 0.017407085746526718, 0.11173778027296066, -0.0247573833912611, -0.006793155334889889, -0.1482391655445099, -0.6155662536621094, -0.03392768278717995, -0.04495446756482124, 0.04179860278964043, -0.052662454545497894, -0.15241633355617523, -0.30946922302246094, -0.3383672535419464, -0.18763062357902527, -0.05867936834692955, -0.13608460128307343, 0.0031481804326176643, -0.30542099475860596, 0.10564393550157547, -0.09554200619459152, 0.048879362642765045, -0.06328196823596954, 0.19393856823444366, -0.411701500415802, 0.07719188928604126, -0.2814103662967682, -0.25215455889701843, 0.03673018142580986, 0.05855275318026543, -0.40232017636299133, -0.0170193649828434, -0.0880875512957573, 0.027236836031079292, 0.12319879233837128, 0.015278193168342113, -0.02859823778271675, -0.14851653575897217, 0.11449083685874939, 0.11630355566740036, -0.32726797461509705, 0.10884740203619003, -0.21750199794769287, -0.02381751500070095, 0.14202824234962463, -0.3335586190223694, -0.1830447018146515, 0.013353991322219372, 0.07010063529014587, -0.053459327667951584, 0.05933015048503876, -0.06331496685743332, -0.39585962891578674, -0.07395816594362259, -0.18290956318378448, 0.07503129541873932, -0.06465701013803482, 0.019565511494874954, 0.05121985077857971, 0.0708870142698288, -0.0028462985064834356, -0.02732735313475132, 0.09064226597547531, -0.0034353130031377077, -0.1640310138463974, -0.18622921407222748, -0.13781847059726715, 0.10664653778076172, -0.04779663681983948, 0.10788567364215851, -0.019962090998888016, 0.12904322147369385, 0.16197170317173004, 0.014117864891886711, 0.01625426672399044, 0.1648559272289276, -0.06682396680116653, -0.08524832129478455, 0.10776358842849731, 0.21381384134292603, -0.019525479525327682, 0.007588917389512062, 0.04306236654520035, 0.14013870060443878, -0.004498752765357494, 0.022771287709474564, -0.3031892478466034, 0.13612282276153564, 0.01625768654048443, -0.042117640376091, 0.06454598903656006, -0.1126781478524208, 0.052364837378263474, -0.00837227888405323, 0.11800183355808258, -0.06180882826447487, 0.018246864899992943, 0.03831556811928749, 0.008038810454308987, 0.017438014969229698, -0.026957087218761444, 0.1532784253358841, 0.08383800834417343, 0.07601457834243774, -0.04822300747036934, -0.03284724801778793, 0.07684355229139328, 0.1367354542016983, -0.10259339958429337, 0.10554243624210358, 0.0003645591496024281, -0.0952569767832756, 0.05737660452723503, -0.056145500391721725, -0.08650488406419754, 0.0731341689825058, 0.023433025926351547, -0.0038964056875556707, 0.05324433743953705, 0.017711106687784195, 0.04854455217719078, 0.0244914460927248, 0.11941678822040558, 0.08421649783849716, 0.04751208797097206, 0.06609157472848892, -0.08896981924772263, 0.06467515230178833, 0.07456163316965103, -0.20009975135326385, -0.05552569776773453, -0.16057661175727844, -0.01754065230488777, -0.08490955829620361, -0.008018440566956997, 0.021578289568424225, 0.1558755785226822, -0.025301387533545494, -0.010583201423287392, -0.05272114276885986, 0.1062011644244194, -0.004876986145973206, 0.02819017693400383, -0.14730454981327057, 0.12902569770812988, 0.24704331159591675, -0.017402533441781998, 0.0068746223114430904, 0.05911818891763687, 0.08631560951471329, -0.030565481632947922, 0.06531495600938797, -0.10520341992378235, 0.10082119703292847, -0.051799509674310684], [-0.036080531775951385, 0.1459450125694275, 0.051591817289590836, 0.35727131366729736, 0.11509829759597778, 0.16239309310913086, 0.10750148445367813, 0.03532496094703674, 0.08797737956047058, 0.14838416874408722, -0.03704458847641945, -0.023819735273718834, 0.0010489479172974825, 0.01353186834603548, 0.18816065788269043, 0.06644057482481003, 0.16270452737808228, -0.12811122834682465, 0.23837293684482574, 0.038407281041145325, 0.20775289833545685, 0.08800677210092545, 0.07884100824594498, 0.12783940136432648, 0.13590794801712036, 0.24157704412937164, 0.014719687402248383, 0.18380898237228394, 0.15502013266086578, 0.11978688836097717, 0.0364968404173851, 0.0503142848610878, 0.03399684280157089, 0.219461590051651, 0.030128182843327522, 0.20143283903598785, 0.2085156887769699, -0.02119273692369461, -0.044208843261003494, -0.009505745954811573, 0.10844067484140396, -0.15982075035572052, -0.08709141612052917, 0.01653982140123844, 0.18606437742710114, -0.0990520492196083, -0.05971115082502365, 0.014524615369737148, 0.06081312522292137, 0.07017527520656586, 0.15557178854942322, -0.02845614403486252, 0.1144481748342514, 0.012680154293775558, -0.1761619746685028, 0.06289535760879517, -0.19100305438041687, -0.16165609657764435, 0.12347552925348282, 0.1870967149734497, -0.21468821167945862, 0.17189651727676392, 0.08766338974237442, 0.3526376783847809, 0.06755921244621277, -0.0783744677901268, 0.011839778162539005, 0.017338667064905167, 0.012122041545808315, -0.05187172070145607, 0.15678134560585022, -0.02171928435564041, 0.016726722940802574, 0.03789646923542023, -0.19973042607307434, -0.04177336394786835, -0.08229575306177139, 0.062315087765455246, -0.033120203763246536, -0.03608410805463791, -0.016539135947823524, 0.10676950216293335, 0.1509992629289627, 0.1961684376001358, -0.0025051143020391464, 0.1456083357334137, -0.07856787741184235, 0.010933026671409607, -0.08127337694168091, 0.10244882851839066, 0.2408483773469925, 0.39793404936790466, -0.07394009828567505, 0.04246562719345093, 0.1078183725476265, -0.04045333340764046, 0.1193007230758667, -0.13856171071529388, 0.15100103616714478, -0.09086650609970093, 0.06637731939554214, 0.16390787065029144, -0.016557417809963226, 0.1830388754606247, 0.07870394736528397, 0.07455334812402725, 0.07592089474201202, 0.04284677281975746, 0.06614231318235397, 0.1918298751115799, 0.1089288666844368, 0.03298817202448845, -0.21659767627716064, 0.13791948556900024, -0.07393723726272583, 0.026414599269628525, -0.12500503659248352, 0.11435680091381073, -0.004925480578094721, 0.13486610352993011, -0.06708532571792603, -0.17218363285064697, -0.004892723634839058, 0.029698269441723824, 0.12228747457265854, -0.008067603223025799, 0.21391025185585022, 0.07476885616779327, -0.16519376635551453, -0.004803637973964214, -0.04850631207227707, 0.1730218380689621, 0.03802483528852463, 0.08429975062608719, -0.13267605006694794, 0.07978333532810211, -0.021366795524954796, -0.13467885553836823, 0.1571943312883377, 0.07778327167034149, 0.1828395277261734, 0.12195754796266556, 0.042726531624794006, 0.09771478176116943, 0.13158971071243286, 0.10873331874608994, 0.1384187787771225, -0.10395428538322449, 0.002667293418198824, -0.06502198427915573, 0.11158065497875214, 0.30262866616249084, -0.05964001640677452, -0.02582412026822567, -0.3522699177265167, -0.01783531717956066, 0.18702425062656403, -0.05553044378757477, 0.06037134304642677, 0.008455301634967327, -0.1379290074110031, 0.12622897326946259, 0.12639090418815613, 0.007276580668985844, -0.07125771790742874, -0.42135483026504517, 0.21900485455989838, 0.09484204649925232, -0.2899589538574219, 0.10347609221935272, 0.07356585562229156, -0.003584981430321932, -0.021791527047753334, 0.0015331646427512169, -0.2491309642791748, 0.0061975386925041676, 0.020343950018286705, 0.08889596164226532, 0.05348098650574684, -0.05935965105891228, 0.02529590018093586, 0.15746691823005676, -0.10462246835231781, 0.09678841382265091, 0.13251738250255585, 0.0665438324213028, -0.003853478003293276, 0.03828572854399681, 0.18416860699653625, 0.39556488394737244, 0.25098639726638794, 0.13982471823692322, 0.008970391936600208, -0.0558345653116703, 0.1212582066655159, -0.11003377288579941, 0.2173359990119934, 0.21076276898384094, -0.032472409307956696, 0.0882849469780922, -0.03201468661427498, 0.018969479948282242, -0.08861112594604492, 0.07619133591651917, -0.04291141778230667, 0.028000561520457268, -0.0852583646774292, 0.05037945136427879, 0.07988209277391434, -0.03872760385274887, 0.03134521096944809, 0.1838093250989914, -0.09343834966421127, 0.02597665786743164, -0.06625694036483765, -0.02966771461069584, -0.06619995832443237, 0.02438778057694435, -0.014716880396008492, -0.1482623815536499, -0.09848117083311081, -0.10766562074422836, 0.026381652802228928, 0.03028489276766777, 0.03524580970406532, 0.11055012047290802, 0.005819588899612427, 0.019630908966064453, -0.024380868300795555, 0.03798360005021095, 0.027629785239696503, 0.0742339938879013, -0.04196130484342575, 0.07161290943622589, 0.06547465920448303, -0.268950492143631, 0.06306765228509903, 0.002387264044955373, -0.06377942860126495, 0.06110068038105965, 0.048402830958366394, -0.08253873884677887, -0.022550398483872414, 0.08648315072059631, 0.03650958463549614, -0.018107689917087555, -0.03809468075633049, -0.06989014148712158, 0.06251441687345505, 0.048814043402671814, -0.012320932000875473, -0.05484049767255783, 0.06271956115961075, -0.056385867297649384, 0.13725514709949493, -0.005261116195470095, 0.021589262410998344, -0.07088950276374817, -0.023124171420931816, -0.03464773669838905, -0.05219092220067978, 0.13949047029018402, 0.14607086777687073, -0.10160278528928757, 0.03309730067849159, -0.011283245868980885, -0.06365872919559479, -0.039936941117048264, -0.03992839157581329, -0.04546341300010681, 0.007057728711515665, 0.08619847893714905, 0.003437997307628393, 0.00023853074526414275, -0.03565676882863045, -0.018987080082297325, -0.09048792719841003, 0.0443008728325367, 0.05282170698046684, -0.007188011426478624, 0.040158942341804504, -0.07730038464069366, 0.023222750052809715, -0.26040923595428467, -0.05036434903740883, -0.0899042934179306, -0.09882852435112, 0.00013603530533146113, -0.006184112746268511, 0.01423424482345581, -0.03306443244218826, -0.04219265282154083, 0.05158896744251251, -0.03373515233397484, -0.04899035766720772, 0.0009607000974938273, 0.0863448977470398, -0.06775268167257309, 0.020862242206931114, 0.10682003200054169], [-0.21737714111804962, -0.1557570993900299, 0.09108661115169525, -0.20102600753307343, 0.011461109854280949, -0.2298816740512848, -0.07945884019136429, -0.09453826397657394, -0.14219047129154205, -0.11050666868686676, 0.03542778268456459, -0.12866812944412231, 0.008088717237114906, -0.0721675381064415, -0.0034110895358026028, -0.1316348910331726, -0.05459847301244736, 0.10197177529335022, -0.1677064448595047, -0.0380108468234539, -0.1991366446018219, 0.019445722922682762, -0.05908481404185295, -0.1864323616027832, -0.12279610335826874, -0.42225924134254456, -0.20425213873386383, -0.23418273031711578, 0.1233106404542923, -0.06550677865743637, 0.02799820713698864, -0.19269230961799622, -0.015015129931271076, -0.08211871981620789, -0.007736900821328163, -0.09916448593139648, -0.2527521550655365, -0.03310969099402428, -0.06560078263282776, 0.0045681484043598175, -0.18002933263778687, 0.25474902987480164, -0.270298033952713, 0.0010495939059183002, -0.19341979920864105, -0.0698058009147644, 0.12832504510879517, -0.05933847278356552, -0.006013556383550167, 0.12029983848333359, -0.014952610246837139, -0.14142672717571259, -0.0006371255149133503, -0.14978525042533875, 0.21425914764404297, -0.17279550433158875, -0.15762421488761902, -0.05246416851878166, -0.1446133702993393, -0.22874848544597626, 0.2785826325416565, -0.021349335089325905, -0.2904355823993683, -0.4335884153842926, 0.027368873357772827, 0.1422259509563446, -0.0013317061820998788, -0.10521672666072845, 0.06474996358156204, 0.02829982154071331, -0.17816169559955597, -0.09173306077718735, 0.06702622026205063, -0.23522908985614777, -0.1151905357837677, -0.06367427855730057, -0.1612653136253357, -0.38184571266174316, -0.027875440195202827, -0.0544012114405632, -0.4077421724796295, -0.11338235437870026, -0.005148229654878378, -0.14443601667881012, -0.1507306843996048, -0.13898931443691254, -0.07709724456071854, -0.0836796760559082, -0.09977658838033676, -0.08191318809986115, -0.038940757513046265, -0.3339044749736786, -0.136295884847641, -0.2795206904411316, -0.19283926486968994, -0.00814859475940466, -0.21588850021362305, -0.04796596243977547, 0.03423134982585907, 0.186807781457901, -0.114814393222332, 0.06034577265381813, -0.09707298874855042, -0.041199326515197754, 0.08494435250759125, -0.20356498658657074, -0.05254824087023735, 0.02883676066994667, -0.012009009718894958, -0.17109428346157074, -0.19261091947555542, -0.05307716876268387, 0.19401903450489044, -0.09548724442720413, -0.12473129481077194, -0.25022387504577637, 0.10915809124708176, -0.2075924128293991, -0.07980161160230637, -0.11119990795850754, 0.09323308616876602, 0.1977265626192093, -0.014632127247750759, 0.016126736998558044, -0.3988285958766937, -0.1065034344792366, -0.2211959809064865, -0.175603985786438, 0.06967023760080338, -0.13733848929405212, 0.13015981018543243, -0.12037259340286255, 0.06975182890892029, -0.2517789602279663, 0.38270026445388794, -0.27859118580818176, -0.042414430528879166, -0.0777602344751358, 0.12992234528064728, -0.25437065958976746, -0.21300619840621948, 0.048956528306007385, -0.04699185863137245, 0.014613930135965347, -0.2108338475227356, -0.10538925230503082, 0.07383173704147339, 0.10275571793317795, -0.20704540610313416, -0.16743607819080353, -0.07577326893806458, -0.3362264037132263, -0.06490053236484528, -0.12007290124893188, -0.009469160810112953, 0.009812326170504093, -0.10937900841236115, -0.1657763421535492, -0.35018306970596313, 0.14636598527431488, 0.0627470463514328, 0.015123770572245121, -0.13097113370895386, -0.09206816554069519, -0.060822829604148865, 0.11416864395141602, 0.1318507343530655, -0.16019725799560547, 0.2199663668870926, -0.04551706463098526, -0.2212315797805786, 0.09563236683607101, -0.15126430988311768, -0.07749442756175995, 0.07481429725885391, -0.24578915536403656, -0.2402641773223877, -0.004911824129521847, -0.027629269286990166, 0.1524164229631424, -0.29720339179039, -0.15711526572704315, 0.016917482018470764, 0.02723623812198639, -0.02173123136162758, -0.1688310205936432, -0.05201767385005951, 0.06034781411290169, -0.1471942812204361, -0.05934761464595795, -0.06358729302883148, 0.0657355934381485, -0.1232573539018631, -0.06961703300476074, -0.05796194449067116, 0.14986646175384521, -0.19570940732955933, -0.1615777164697647, -0.022204943001270294, -0.1419413536787033, -0.03499549999833107, -0.029708830639719963, 0.0587209053337574, 0.1057341992855072, 0.08553638309240341, 0.007686614524573088, 0.05702892690896988, 0.03137319162487984, 0.0669402927160263, 0.06965997815132141, 0.03841875493526459, -0.050767991691827774, -0.06512382626533508, 0.05448632687330246, 0.06515031307935715, -0.03263670578598976, -0.04412934184074402, 0.019263941794633865, -0.03732886165380478, -0.10491282492876053, 0.002110525965690613, -0.03730707988142967, -0.057467926293611526, 0.05368419364094734, 0.026688776910305023, -0.09678782522678375, -0.08724066615104675, -0.045934662222862244, 0.04261552542448044, -0.04832346364855766, 0.018595537170767784, -0.06560210138559341, 0.07288169860839844, -0.11376677453517914, -0.03776416927576065, -0.06259891390800476, -0.04611635208129883, 0.017962653189897537, 0.07366055995225906, 0.04644578695297241, 0.10977505147457123, -0.03274683654308319, -0.020349398255348206, 0.010759714059531689, 0.00190554594155401, 0.03064921125769615, -0.013322396203875542, 0.1141100823879242, 0.010119377635419369, -0.04405002295970917, -0.09358590096235275, -0.03329245746135712, -0.026518763974308968, 0.1681961566209793, 0.053840555250644684, -0.023098403587937355, -0.06992132216691971, -0.03073268197476864, -0.06265487521886826, 0.10665461421012878, 0.009195071645081043, -0.0006353207863867283, -0.025158165022730827, -0.11146590113639832, -0.06205621361732483, 0.14128601551055908, 0.09186091274023056, -0.011942742392420769, -0.10252659767866135, 0.06504181772470474, -0.016285786405205727, -0.02622632123529911, -0.017728237435221672, -0.04464558884501457, -0.1098046749830246, 0.13223201036453247, -0.029668761417269707, 0.037633053958415985, -0.05105122923851013, -0.029312241822481155, 0.1283142864704132, 0.06424225866794586, -0.1066330075263977, 0.006903081201016903, 0.022932976484298706, -0.007735952269285917, -0.15625301003456116, 0.07383894920349121, -0.03195377439260483, 0.2083997279405594, -0.0574612095952034, 0.009013915434479713, 0.03615402430295944, -0.0017020009690895677, 0.09241044521331787, 0.007095580454915762, -0.11574655026197433, -0.01852944865822792, -0.0009441807633265853, 0.06022730842232704], [0.2380543053150177, -0.03787573426961899, 0.2885191738605499, 0.11284787207841873, -0.0904056504368782, -0.008489792235195637, -0.057833511382341385, 0.1268475204706192, -0.08312684297561646, 0.21712757647037506, -0.024208541959524155, 0.15903830528259277, -0.1928384006023407, 0.09297015517950058, -0.009708276949822903, 0.11236900836229324, -0.011927134357392788, -0.03360861539840698, 0.015878360718488693, 0.1426146924495697, -0.004706539213657379, -0.10298578441143036, -0.00766358757391572, 0.02451331540942192, -0.058869220316410065, -0.06698346883058548, 0.14984582364559174, 0.11423420161008835, -0.1825900375843048, 0.12585432827472687, -0.12730801105499268, -0.04862594977021217, -0.13068397343158722, 0.23326057195663452, -0.05229775607585907, -0.07621107995510101, 0.13087283074855804, 0.2179686427116394, -0.00723146740347147, 0.005356649402529001, 0.15970011055469513, -0.06070277467370033, -0.11030928790569305, 0.07461090385913849, 0.1098560318350792, 0.015595882199704647, -0.005740629509091377, 0.041600536555051804, 0.21851490437984467, 0.13800181448459625, -0.06756885349750519, 0.13744312524795532, 0.11184030026197433, 0.10099709033966064, 0.0398511067032814, 0.0015080127632245421, 0.03837090730667114, -0.08026314526796341, -0.05336498096585274, -0.00891147367656231, -0.0620717816054821, 0.04150886833667755, 0.12759335339069366, 0.20784516632556915, -0.03204198554158211, 0.01767987571656704, -0.13211902976036072, 0.18982544541358948, 0.042386800050735474, 0.023440755903720856, 0.09463250637054443, 0.16956216096878052, -0.05087992176413536, 0.024319883435964584, 0.20589891076087952, 0.13028578460216522, 0.1290738433599472, 0.11090996861457825, 0.11796502023935318, -0.007019835524260998, 0.22814880311489105, 0.14070859551429749, 0.12486029416322708, 0.05083800479769707, -0.0647851973772049, 0.1333770900964737, -0.1511898636817932, 0.1033722311258316, -0.03462543338537216, 0.11895810067653656, 0.09587207436561584, 0.23856103420257568, 0.034185733646154404, 0.020546698942780495, -0.026370957493782043, -0.04302835091948509, 0.19494715332984924, -0.004264078103005886, 0.055168334394693375, -0.14385853707790375, 0.013720301911234856, 0.13483738899230957, 0.04272865131497383, 0.14154042303562164, 0.11011956632137299, 0.1346348077058792, 0.1165798157453537, 0.03884380683302879, 0.04488661140203476, 0.08705739676952362, 0.12927258014678955, 0.048818547278642654, -0.06941425800323486, 0.044658511877059937, 0.1270904392004013, 0.2894039452075958, -0.01232517696917057, 0.03539304807782173, 0.14579418301582336, 0.10991927981376648, 0.009351088665425777, 0.03401528298854828, 0.013611163944005966, 0.1721329689025879, 0.1669316291809082, 0.11666607111692429, 0.20291103422641754, 0.07982616871595383, -0.13307684659957886, 0.12806928157806396, -0.026484638452529907, 0.1668950766324997, -0.040118541568517685, 0.05218963325023651, -0.33260399103164673, 0.21563991904258728, 0.21276728808879852, 0.12171417474746704, -0.066981740295887, 0.137660413980484, 0.33365345001220703, 0.09840042144060135, 0.04754452407360077, -0.07087084650993347, 0.1195749044418335, 0.010975017212331295, -0.06927532702684402, -0.05914560332894325, 0.047473032027482986, 0.011843678541481495, 0.24113665521144867, 0.16599157452583313, 0.25373679399490356, 0.10926669836044312, -0.28710412979125977, 0.07717747986316681, 0.14365333318710327, -0.15381240844726562, 0.08130356669425964, 0.07011304795742035, -0.04253154620528221, 0.25697213411331177, 0.30834734439849854, 0.01890658773481846, 0.2369903326034546, -0.3134844899177551, 0.012198696844279766, 0.13077770173549652, -0.1796833723783493, 0.06283275783061981, 0.23442292213439941, 0.2718104124069214, -0.025858445093035698, 0.17792050540447235, -0.08308382332324982, 0.09539715200662613, 0.17403508722782135, 0.20136208832263947, -0.04137898609042168, -0.12039776146411896, 0.22402985394001007, 0.23350116610527039, 0.05033005028963089, 0.029459204524755478, 0.10886435955762863, 0.01710045337677002, 0.13402125239372253, 0.014303535223007202, -0.00425933301448822, 0.12525412440299988, 0.22267772257328033, 0.0042018224485218525, -0.01663075014948845, -0.13944250345230103, 0.010008085519075394, -0.0702647715806961, 0.3123520612716675, 0.0072054192423820496, 0.1379159390926361, -0.0632827877998352, 0.005511402152478695, -0.06243614852428436, -0.08358871191740036, -0.041187167167663574, 0.007305758073925972, 0.07617466896772385, -0.08131862431764603, -0.06397034972906113, 0.07914120703935623, 0.1226855143904686, -0.04674210399389267, 0.033391427248716354, 0.05919811502099037, -0.008550530299544334, 0.09622999280691147, 0.00592913618311286, 0.015966366976499557, 0.04029269143939018, 0.08044236898422241, -0.015344575047492981, 0.12542501091957092, 0.027068041265010834, 0.1838495433330536, -0.03147190436720848, 0.08477310091257095, -0.03096790984272957, -0.03216378390789032, 0.12086623907089233, 0.0033674919977784157, 0.04759941250085831, -0.0394161194562912, -0.0850994810461998, -0.00781472958624363, 0.04085597023367882, 0.1121644377708435, -0.018898529931902885, -0.13999977707862854, -0.060034412890672684, -0.01002536341547966, 0.017620548605918884, -0.02769477665424347, 0.05176258459687233, -0.05320579186081886, -0.07657960057258606, -0.05800500139594078, -0.14915937185287476, 0.15545865893363953, 0.012870485894382, -0.06566701829433441, -0.08567969501018524, 0.15327689051628113, -0.06807841360569, -0.06896235048770905, 0.07547657191753387, -0.05088154599070549, 0.01361758727580309, 0.05691558122634888, -0.07182036340236664, 0.05286165326833725, 0.08686944097280502, -0.05067792534828186, -0.017364604398608208, 0.0865856260061264, 0.03341880440711975, 0.06814993917942047, -0.11321837455034256, 0.02611108124256134, -0.032557643949985504, -0.05229562148451805, 0.20429591834545135, 0.0022312705405056477, -0.078252874314785, -0.206876739859581, 0.0071539487689733505, 0.08183219283819199, 0.07561158388853073, 0.04543589428067207, -0.023375635966658592, -0.019283806905150414, -0.14482015371322632, 0.02067435160279274, 0.00979072879999876, -0.02543395198881626, 0.025865966454148293, 0.003733848687261343, 0.09996946156024933, 0.026613151654601097, -0.10291197896003723, 0.09218764305114746, -0.003599913790822029, 0.17540243268013, 0.059034187346696854, -0.03488130867481232, 0.006872120313346386, 0.06440155953168869, 0.030744871124625206, 0.018183637410402298, -0.10639950633049011, -0.0811217725276947, -0.12540408968925476], [-0.038996078073978424, -0.08845656365156174, 0.0636863261461258, -0.024480491876602173, 0.07536128163337708, 0.2448822259902954, -0.05826972797513008, 0.1987362653017044, 0.10116659104824066, 0.06542888283729553, 0.2572802007198334, 0.09152708202600479, -0.12469102442264557, -0.2773649990558624, 0.10037267953157425, 0.15587514638900757, 0.03998243436217308, -0.2200179249048233, -0.22435665130615234, -0.08032403886318207, -0.24091842770576477, -0.08805010467767715, -0.1703576147556305, 0.10917863994836807, -0.02912326715886593, -0.24722832441329956, 0.026765918359160423, 0.039529282599687576, 0.08298701792955399, 0.2544989585876465, -0.06288150697946548, -0.074708953499794, 0.0998338982462883, 0.20090077817440033, 0.021334609016776085, -0.031599994748830795, -0.09535074979066849, 0.28629493713378906, 0.07275519520044327, -0.16377006471157074, -0.1430404633283615, -0.08643036335706711, -0.13297158479690552, 0.1639249175786972, 0.11445607990026474, 0.271413117647171, 0.018989987671375275, 0.0837034210562706, -0.10726221650838852, -0.19449245929718018, 0.2834949493408203, -0.04949488863348961, -0.38485023379325867, 0.013959688134491444, 0.09770859777927399, -0.1766592264175415, 0.015588006004691124, 0.1401234120130539, -0.08844656497240067, 0.08214935660362244, 0.04506443440914154, 0.12177321314811707, -0.040139805525541306, -0.04120837524533272, -0.2550015151500702, 0.16612228751182556, 0.02368287928402424, -0.1825227290391922, -0.06978680938482285, 0.19900280237197876, -0.04095042124390602, 0.24740195274353027, -0.0736534371972084, -0.01853579841554165, 0.03134948015213013, -0.00947762280702591, -0.007565524894744158, 0.1335781365633011, 0.08258451521396637, 0.1630006581544876, 0.08107016980648041, -0.06158655509352684, 0.17850829660892487, 0.1455291360616684, 0.038389623165130615, 0.1999342441558838, -0.04740089923143387, 0.2259543538093567, 0.022304454818367958, -0.08356951922178268, 0.11963896453380585, -0.21818210184574127, 0.10691705346107483, 0.08802489191293716, -0.32485508918762207, -0.03639562427997589, -0.15986190736293793, 0.057886529713869095, 0.25893402099609375, -0.2038954645395279, -0.14667287468910217, -0.17772145569324493, -0.10601389408111572, 0.0503968708217144, -0.03226660564541817, 0.2519381046295166, 0.012901239097118378, -0.09713725745677948, -0.1980518102645874, 0.10795719176530838, -0.11118539422750473, -0.13203784823417664, -0.19177763164043427, 0.008374800905585289, -0.027107272297143936, 0.08612910658121109, 0.17903649806976318, 0.0945315957069397, 0.1358041763305664, 0.009442945010960102, -0.13113726675510406, -0.09739135950803757, 0.2629657983779907, 0.10776770859956741, -0.09258531033992767, -0.2631065547466278, 0.05547511950135231, 0.02017059177160263, -0.09365007281303406, -0.19534620642662048, 0.1857646256685257, -0.02139316126704216, 0.04226353392004967, -0.00711048673838377, -0.06395909935235977, 0.0692373663187027, -0.07772035151720047, -0.23166291415691376, -0.04698405787348747, -0.012569300830364227, -0.05208136886358261, 0.016088809818029404, 0.12179935723543167, -0.31075018644332886, 0.14892901480197906, -0.17563246190547943, -0.0061503523029387, 0.09803681820631027, 0.20390684902668, 0.12261824309825897, -0.013408534228801727, 0.17480506002902985, 0.13769568502902985, 0.03924111649394035, -0.080719493329525, 0.09277763217687607, 0.005729845724999905, -0.32216784358024597, -0.1000475063920021, 0.2982660233974457, -0.19860625267028809, -0.04767395183444023, 0.05344456061720848, -0.08972664922475815, 0.127037912607193, -0.11110146343708038, 0.02463982068002224, -0.0621042400598526, -0.13035784661769867, -0.04151353985071182, 0.0475635826587677, 0.1746702641248703, -0.05810193717479706, 0.11813589930534363, -0.011857636272907257, 0.02598247490823269, -0.14638076722621918, 0.037877555936574936, -0.12396164238452911, -0.13302898406982422, -0.06591355055570602, 0.2521677017211914, 0.09109731763601303, -0.08102638274431229, 0.12622110545635223, -0.06155375391244888, 0.02269790880382061, -0.017308440059423447, -0.2097015082836151, 0.033591195940971375, -0.1921389400959015, -0.08400414884090424, 0.1681814044713974, -0.05307837575674057, -0.0534709133207798, -0.04899563267827034, -0.018350377678871155, -0.15676811337471008, 0.21686068177223206, 0.08505647629499435, -0.00857531651854515, -0.005340388976037502, 0.013074451126158237, 0.10694807767868042, 0.255315363407135, 0.08355676382780075, -0.18115219473838806, -0.018787024542689323, 0.017420461401343346, 0.18235629796981812, 0.03934858739376068, 0.09598197788000107, -0.06411416083574295, 0.1844286173582077, 0.00707700802013278, -0.052567850798368454, -0.10155561566352844, 0.08202025294303894, 0.25181204080581665, 0.02703244425356388, 0.19362375140190125, -0.05353759601712227, -0.04183179512619972, -0.08470476418733597, -0.24296893179416656, 0.02957971952855587, -0.09608147293329239, 0.07868710160255432, 0.10604740679264069, -0.06924871355295181, 0.03820247948169708, 0.005541608203202486, 0.12953147292137146, -0.15712545812129974, 0.08449257165193558, 0.01959625631570816, -0.04404652491211891, 0.03589679300785065, -0.09133865684270859, -0.06972954422235489, 0.107761450111866, 0.0518912710249424, -0.013728552497923374, -0.12096912413835526, 0.06944560259580612, -0.08101481944322586, 0.04961968958377838, 0.07750660926103592, 0.08853856474161148, -0.09393975138664246, -0.04523264244198799, -0.12038074433803558, -0.03835954889655113, 0.026370106264948845, 0.11065161973237991, 0.006640051957219839, 0.00777794374153018, -0.06847541779279709, -0.18051990866661072, 0.1440402865409851, 0.039194256067276, 0.030419928953051567, -0.10015647113323212, -0.17250722646713257, -0.10633374750614166, -0.09080017358064651, -0.07104194909334183, 0.023163625970482826, -0.007799148093909025, 0.1853330284357071, -0.01628894917666912, -0.18795377016067505, -0.05959143489599228, 0.018002476543188095, -0.002750003943219781, 0.0956834927201271, -0.05032191425561905, 0.1560216248035431, -0.0702788382768631, -0.046597518026828766, 0.04494331032037735, 0.05185191333293915, -0.11403860151767731, -0.16065475344657898, 0.08653445541858673, 0.06222507730126381, 0.06438542902469635, 0.2725805640220642, 0.02069542184472084, 0.01178207527846098, 0.11598694324493408, 0.10923328995704651, 0.04013846069574356, -0.1179102286696434, -0.0798833891749382, -0.055257901549339294, -0.11308874934911728, -0.06995100528001785, 0.013634290546178818, 0.2294577658176422], [0.005254210904240608, 0.034182947129011154, -0.1119762435555458, -0.08553502708673477, -0.09368032962083817, -0.06268271803855896, 0.01508126687258482, 0.18429526686668396, 0.22735077142715454, -0.31741228699684143, -0.19858579337596893, 0.11192541569471359, 0.045905325561761856, 0.025428086519241333, -0.11695226281881332, 0.23319634795188904, 0.1297355443239212, -0.07575720548629761, 0.2590002119541168, -0.0677751749753952, -0.01646215096116066, -0.21898256242275238, 0.15917880833148956, 0.02703189291059971, 0.24973224103450775, 0.2809557318687439, 0.1303911805152893, -0.013110484927892685, -0.11562998592853546, 0.17899450659751892, -0.03065519407391548, 0.23595596849918365, -0.1328936368227005, 0.1115003153681755, 0.09658101946115494, 0.14938664436340332, -0.08319438993930817, 0.1576807051897049, 0.15941506624221802, -0.03629001975059509, 0.12634122371673584, -0.062352925539016724, 0.07756465673446655, 0.02099229209125042, 0.12156878411769867, 0.2784320116043091, 0.07890168577432632, 0.030134081840515137, -0.04041406884789467, 0.04013167694211006, -0.08063195645809174, 0.09582176059484482, -0.16747668385505676, -0.009672125801444054, 0.02611500583589077, 0.1539144665002823, 0.07824293524026871, 0.009143364615738392, -0.19561348855495453, -0.19621513783931732, 0.032701510936021805, 0.1319349706172943, 0.21458972990512848, 0.21905602514743805, -0.05278738960623741, 0.03211948275566101, 0.025573724880814552, -0.2607737183570862, -0.02432042546570301, 0.19936135411262512, 0.019961755722761154, 0.11124956607818604, -0.11071325093507767, 0.10090373456478119, 0.15060172975063324, -0.013574942946434021, 0.0971602350473404, 0.18195770680904388, -0.01604468934237957, 0.03514042869210243, 0.13071787357330322, -0.11052340269088745, -0.046146050095558167, 0.05075448006391525, 0.059759464114904404, 0.07270823419094086, 0.16259941458702087, 0.06749273091554642, 0.09542863070964813, -0.08475490659475327, 0.06936189532279968, -0.16244450211524963, -0.02510656788945198, -0.014105803333222866, -0.017959333956241608, -0.0060413312166929245, 0.05098231881856918, 0.053745560348033905, -0.09070152789354324, -0.0186020415276289, 0.0657014548778534, -0.13659997284412384, 0.04634561389684677, -0.29364708065986633, -0.0078356321901083, 0.07631710916757584, 0.0812327042222023, -0.041557881981134415, -0.2084798365831375, -0.05426449701189995, -0.11904420703649521, -0.16368842124938965, 0.2493692934513092, 0.022653894498944283, 0.2033449113368988, 0.09191469103097916, -0.018110526725649834, -0.14232945442199707, 0.09183263778686523, 0.041746415197849274, -0.2504744827747345, -0.20420318841934204, 0.07151659578084946, -0.09790580719709396, 0.02801758423447609, 0.08751832693815231, 0.01361939124763012, -0.007954752072691917, 0.03168003261089325, -0.033166129142045975, 0.15053921937942505, -0.04798024892807007, -0.2751828730106354, 0.07466451823711395, 0.08414079993963242, 0.014750639908015728, -0.22845138609409332, -0.24193039536476135, -0.32310861349105835, 0.20472685992717743, 0.014349128119647503, 0.0788760855793953, -0.11497277766466141, -0.23638692498207092, 0.04882914572954178, -0.11894288659095764, -0.1919592320919037, 0.11336864531040192, 0.1624448150396347, -0.012507697567343712, 0.12966881692409515, 0.1743236780166626, 0.22336985170841217, -0.04539960250258446, 0.16581980884075165, 0.06094334274530411, -0.09356287121772766, 0.03151653707027435, 0.05801556259393692, 0.07129217684268951, 0.022601312026381493, -0.04176647961139679, 0.07764478772878647, -0.028488602489233017, 0.09392142295837402, 0.17347654700279236, -0.12539616227149963, 0.011598444543778896, -0.06144699081778526, -0.1751444935798645, -0.045861050486564636, -0.10146649926900864, 0.17917616665363312, -0.07089968025684357, 0.11089091747999191, 0.15111663937568665, 0.14633974432945251, 0.059959765523672104, -0.2080731838941574, 0.12608668208122253, 0.15388153493404388, 0.02202671393752098, -0.07988390326499939, -0.1074964851140976, -0.017882248386740685, 0.16533163189888, -0.18751679360866547, 0.042460910975933075, 0.04361343756318092, 