{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_11", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "ragged": false, "name": "onset_out_1"}, "name": "onset_out_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[0.2305973321199417], [0.22741301357746124], [-0.16576747596263885], [-0.17800173163414001], [-0.16767187416553497], [0.20915305614471436], [-0.12602826952934265], [-0.1531979739665985], [0.2813473343849182], [-0.2009928971529007], [-0.1240682601928711], [-0.17176836729049683], [0.1952071189880371], [-0.13384701311588287], [-0.18931931257247925], [-0.1623833328485489], [0.23650643229484558], [0.2911047041416168], [-0.1687258780002594], [0.21422149240970612], [-0.12808288633823395], [-0.18548989295959473], [-0.1638481616973877], [-0.1936371773481369], [0.19474756717681885], [0.2080802470445633], [-0.14667809009552002], [-0.16305021941661835], [0.24574272334575653], [0.2512187063694], [-0.15989306569099426], [0.18949772417545319], [-0.13137516379356384], [0.2230653166770935], [0.19097600877285004], [0.20635603368282318], [-0.13111110031604767], [0.28959864377975464], [0.2294032722711563], [0.16751301288604736]]}}, "bias_initializer": {"class_name": "Constant", "config": {"value": [-0.20495037734508514]}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["onset_out_1", 0, 0, {}]]]}], "input_layers": [["onset_out_1", 0, 0]], "output_layers": [["dense_11", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_11/kernel", "shape": [40, 1], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [1], "dtype": "float32"}]}]}