{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_9", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "y2"}, "name": "y2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 40, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[-0.09722205251455307, -0.2550964653491974, -0.3405611515045166, -0.3147364854812622, -0.06012789532542229, -0.07782948762178421, -0.21429091691970825, -0.12800233066082, 0.012617988511919975, -0.19648011028766632, -0.039543282240629196, -0.005088167265057564, -0.0189127828925848, -0.06877931207418442, 0.07391083985567093, -0.1392376720905304, 0.07203499227762222, 0.06456173956394196, -0.16645805537700653, 0.22574761509895325, -0.22897519171237946, -0.1225585862994194, -0.30040496587753296, 0.05158691108226776, 0.02475862391293049, 0.0667577013373375, -0.165829598903656, -0.0956001877784729, 0.0648842453956604, 0.09800257533788681, -0.07845442742109299, 0.11202876269817352, -0.18257826566696167, -0.024639012292027473, 0.19847692549228668, 0.21483206748962402, -0.1898318976163864, -0.07016046345233917, 0.20346879959106445, 0.18353106081485748], [-0.11403223872184753, -0.06192263588309288, -0.03466314822435379, 0.04756162315607071, 0.20427721738815308, 0.009938535280525684, -0.11510366946458817, -0.08207482099533081, -0.09732668846845627, 0.10934732854366302, -0.14265801012516022, 0.16106024384498596, 0.16007374227046967, 0.0027919914573431015, -0.14173623919487, -0.049223147332668304, -0.07450758665800095, -0.061180852353572845, 0.005966206546872854, -0.14888949692249298, 0.03197447210550308, -0.04457155242562294, -0.052811384201049805, -0.0063029262237250805, 0.11777541786432266, 0.15803563594818115, -0.055714014917612076, -0.07447361946105957, 0.06890276819467545, 0.012522092089056969, -0.049729008227586746, 0.06269171833992004, -0.14002779126167297, 0.061163660138845444, 0.10189856588840485, 0.05052357167005539, 0.14368589222431183, -0.18854211270809174, -0.06219117343425751, 0.16355524957180023], [-0.0009098267764784396, 0.004279599525034428, -0.1511661559343338, -0.07571490854024887, 0.04323037713766098, -0.13586010038852692, 0.06261595338582993, -0.12857583165168762, -0.07368215918540955, 0.01941344514489174, -0.030399993062019348, -0.23279479146003723, -0.22849814593791962, -0.06275635212659836, -0.003927765879780054, -0.15687230229377747, 0.1741890013217926, 0.10360443592071533, -0.07358567416667938, 0.13336214423179626, 0.012478245422244072, -0.2178770899772644, -0.12858590483665466, -0.08266567438840866, -0.1361132115125656, -0.19203318655490875, -0.09500107914209366, 0.14808005094528198, -0.024338092654943466, 0.1301613599061966, 0.04844081029295921, -0.06592611968517303, 0.020769787952303886, -0.07459863275289536, -0.07970041781663895, -0.080315500497818, -0.12755520641803741, 0.15299281477928162, 0.05568598955869675, -0.07002796232700348], [0.023456212133169174, -0.04139227047562599, 0.07323985546827316, -0.1988941878080368, -0.09479603171348572, 0.2549404799938202, -0.06817415356636047, -0.1453736424446106, -0.054145634174346924, -0.05683565139770508, -0.09985155612230301, -0.05044203996658325, 0.11396697908639908, -0.052406251430511475, -0.050601374357938766, 0.01160904299467802, -0.04336538910865784, 0.04170813784003258, -0.0747557207942009, 0.07520920783281326, -0.01606207899749279, -0.037740640342235565, -0.2094040811061859, -0.05199092626571655, 0.12002207338809967, 0.17011603713035583, -0.042978208512067795, 0.07137339562177658, 0.060676898807287216, -0.15720731019973755, 0.04427211731672287, -0.09289446473121643, -0.01133808959275484, 0.04355321452021599, 0.07117265462875366, -0.03310500457882881, 0.04195481911301613, -0.026272974908351898, -0.04006774723529816, -0.09923139214515686], [-0.30534273386001587, -0.36690986156463623, 0.2530476152896881, -0.14271382987499237, 0.1422763168811798, -0.044415660202503204, -0.28795844316482544, -0.07263647019863129, -0.12899404764175415, -0.08160898089408875, -0.004235454834997654, 0.008727500215172768, -0.1658324897289276, 0.09344560652971268, -0.03915874660015106, -0.026224646717309952, -0.004121361766010523, -0.11288192123174667, 0.2052914798259735, -0.09337248653173447, 0.022638853639364243, -0.12794935703277588, 0.155709907412529, -0.14527247846126556, -0.2368161529302597, 0.04991180822253227, -0.12160304188728333, -0.24183246493339539, -0.0074616060592234135, -0.10407330095767975, 0.07896137982606888, -0.15861599147319794, 0.34430262446403503, -0.013453046791255474, 0.017486795783042908, -0.056477587670087814, 0.17033059895038605, 0.15232831239700317, -0.14369554817676544, -0.19667917490005493], [0.007077098358422518, -0.04394354671239853, -0.3548169434070587, 0.027994222939014435, -0.017137646675109863, 0.06544255465269089, -0.2817709147930145, -0.10987439006567001, 0.1490229070186615, 0.03266961872577667, -0.09065717458724976, 0.025259383022785187, 0.10288915783166885, -0.06264650821685791, 0.010139677673578262, -0.12077421694993973, 0.07490956038236618, 0.027207903563976288, -0.11650492995977402, 0.022322574630379677, -0.23585055768489838, -0.06757089495658875, -0.07587780058383942, -0.11305376142263412, 0.14233724772930145, 0.074332095682621, -0.13359923660755157, -0.05074397847056389, 0.0010345927439630032, 0.08623874187469482, -0.07810578495264053, 0.07699166238307953, -0.0704454854130745, 0.14781895279884338, 0.03757622838020325, 0.20173846185207367, -0.30002105236053467, 0.12290549278259277, 0.008854270912706852, 0.016868004575371742], [0.01924639381468296, 0.016778916120529175, 0.06003546714782715, -0.06128222867846489, -0.34302252531051636, -0.06519271433353424, -0.2582843005657196, -0.2666776776313782, -0.03889074549078941, -0.38051697611808777, 0.009318666532635689, -0.17286932468414307, 0.21897198259830475, -0.4771607220172882, -0.24772828817367554, -0.12351846694946289, 0.0026972240302711725, 0.05833462253212929, -0.039293091744184494, -0.04325288534164429, -0.13489490747451782, -0.3135828673839569, -0.12042209506034851, -0.200730100274086, 0.1719641536474228, 0.11093292385339737, -0.1381310373544693, -0.34217751026153564, 0.1536279320716858, 0.16188478469848633, -0.13758587837219238, 0.1957480013370514, -0.09760496020317078, 0.04790860414505005, 0.15198267996311188, 0.016701344400644302, -0.22263754904270172, -0.14661285281181335, 0.05175397917628288, 0.2760201394557953], [-0.07218087464570999, 0.09535201638936996, 0.11399108171463013, -0.1401696354150772, 0.2023221254348755, -0.004893519449979067, 0.29809340834617615, 0.08663448691368103, 0.04991063103079796, 0.09462736546993256, 0.08266575634479523, -0.048268213868141174, 0.021352045238018036, -0.1837702989578247, -0.0008177681593224406, 0.2013578563928604, 0.020974386483430862, 0.036662306636571884, -0.07796495407819748, -0.006455353461205959, -0.032978277653455734, 0.2665722072124481, 0.06889862567186356, -0.08224305510520935, 0.07909764349460602, -0.022509317845106125, 0.08455784618854523, -0.033576600253582, -0.0025319820269942284, 0.13638362288475037, 0.06430475413799286, 0.09747733175754547, -0.09393293410539627, 0.17361657321453094, 0.13102340698242188, 0.1050168126821518, 0.08824557811021805, 0.022985732182860374, -0.27102580666542053, 0.025060636922717094], [0.15615810453891754, -0.007270938716828823, 0.0644623190164566, 0.16463841497898102, 0.36464783549308777, -0.23570020496845245, 0.07077690958976746, -0.030347086489200592, 0.11673758178949356, 0.060975149273872375, -0.020979052409529686, 0.02311336249113083, -0.1369660496711731, 0.1075172871351242, -0.01999928243458271, 0.04423268511891365, -0.033670976758003235, 0.17300108075141907, 0.1609473079442978, 0.14564521610736847, 0.05257043242454529, -0.057399727404117584, 0.07539147138595581, -0.06706134229898453, 0.012532518245279789, 0.001903692027553916, 0.087314672768116, 0.147987499833107, -0.07804758101701736, 0.050503674894571304, -0.15421628952026367, -0.09775730967521667, 0.18814319372177124, -0.06471193581819534, -0.16343188285827637, -0.12854155898094177, 0.0004337072023190558, 0.11086083948612213, -0.00047654713853262365, -0.030988313257694244], [0.0792618915438652, -0.1642964780330658, 0.23561766743659973, -0.05199985206127167, 0.10844946652650833, -0.16732436418533325, 0.2274630218744278, -0.023450003936886787, -0.07819394022226334, 0.0894712284207344, 0.23193828761577606, 0.0049869040958583355, -0.2335495948791504, 0.06666360050439835, 0.08025871217250824, 0.028725696727633476, -0.17216099798679352, 0.007501955144107342, 0.16918444633483887, -0.029841367155313492, 0.0415601022541523, 0.1470395028591156, 0.024389375001192093, 0.07695328444242477, -0.18266862630844116, -0.08812129497528076, 0.077874094247818, 0.05613945797085762, -0.1520971953868866, -0.22825567424297333, 0.11206642538309097, -0.32761189341545105, 0.20482362806797028, -0.036600515246391296, -0.30103299021720886, -0.3891863524913788, 0.1974446326494217, -0.02883589267730713, 0.03332145884633064, -0.08522520214319229], [-0.03961273655295372, 0.013133672066032887, -0.09984176605939865, -0.12490881979465485, 0.10746496915817261, -0.08245687186717987, -0.07867635041475296, -0.3235287070274353, 0.00736750103533268, -0.21505631506443024, 0.05009141191840172, -0.2758893668651581, 0.004628611262887716, -0.35699713230133057, -0.11799883842468262, -0.1598580777645111, 0.09390489012002945, 0.12275040149688721, -0.13995574414730072, 0.05199921876192093, -0.22628207504749298, -0.14968235790729523, -0.08830173313617706, -0.01839931681752205, -0.06968729197978973, 0.021009938791394234, -0.028411736711859703, 0.004687515553086996, 0.048912424594163895, 0.0602654293179512, -0.30016300082206726, 0.015081587247550488, -0.20713810622692108, 0.1486414074897766, 0.07888106256723404, 0.06248264014720917, -0.22985394299030304, 0.049833059310913086, 0.16802527010440826, -0.13194920122623444], [0.1676529049873352, 0.17239490151405334, -0.02510303072631359, 0.07924060523509979, 0.08663016557693481, 0.1888793259859085, -0.0675233006477356, 0.012531699612736702, -0.06208012253046036, 0.004534272011369467, -0.054828010499477386, -0.19978411495685577, 0.30726686120033264, -0.07561259716749191, -0.1567547470331192, -0.12344758957624435, -0.010661120526492596, 0.08720307797193527, -0.0975273847579956, 0.15454868972301483, -0.028065703809261322, -0.019372757524251938, 0.009157463908195496, -0.17475497722625732, 0.10133302211761475, 0.08432015031576157, -0.04114345833659172, -0.11332648247480392, 0.059552066028118134, 0.0018289777217432857, -0.040925804525613785, 0.11464705318212509, 0.12002278864383698, -0.3472684621810913, 0.004588377196341753, 0.16942550241947174, -0.11358102411031723, -0.3240416944026947, -0.0006922204047441483, -0.08512108772993088], [-0.07725216448307037, -0.24084483087062836, 0.024177344515919685, -0.03859774023294449, -0.05284694582223892, -0.1844315379858017, 0.002238502260297537, 0.06486479938030243, -0.2164667248725891, 0.04496872052550316, 0.027958961203694344, 0.23145075142383575, -0.03603482246398926, -0.08289788663387299, -0.07536648213863373, 0.13412846624851227, 0.023000918328762054, -0.2000804841518402, -0.11128818243741989, 0.07373266667127609, 0.06813471019268036, 0.07449072599411011, -0.18486374616622925, -0.1779651790857315, -0.11592710763216019, -0.10640570521354675, -0.152139350771904, -0.002350711729377508, -0.17343124747276306, -0.2399260401725769, -0.1981218159198761, -0.1185227558016777, -0.06310684978961945, -0.2145465463399887, -0.11296679079532623, 0.01972103863954544, -0.010791785083711147, -0.12302778661251068, 0.006144452840089798, -0.26077592372894287], [-0.10936339199542999, -0.2057284712791443, 0.3708871603012085, 0.2756234109401703, 0.35161852836608887, -0.08259580284357071, 0.5191435813903809, 0.32289454340934753, -0.1328243762254715, 0.20663736760616302, 0.421633243560791, 0.1550242006778717, -0.06896375864744186, 0.32224756479263306, 0.33653953671455383, 0.27434098720550537, -0.1575356274843216, -0.17035533487796783, 0.35930919647216797, -0.3046247065067291, 0.3076455891132355, 0.12367615848779678, 0.22213073074817657, 0.21688494086265564, -0.18079739809036255, -0.1569610983133316, 0.1944476217031479, 0.2544137239456177, -0.15429706871509552, -0.06821282207965851, 0.3226599395275116, -0.03939982131123543, 0.4224107265472412, -0.20834922790527344, -0.08831993490457535, -0.2574250102043152, 0.28534847497940063, -0.13957345485687256, -0.13008715212345123, -0.09882185608148575], [-0.7520994544029236, -0.5551299452781677, -0.07291360199451447, 0.41525837779045105, 0.2868688702583313, -0.3346025347709656, 0.29170674085617065, 0.24562567472457886, -0.5952610373497009, 0.09942425787448883, 0.3145510256290436, 0.29010385274887085, -0.25649043917655945, 0.2239403873682022, 0.245788112282753, 0.34301233291625977, -0.4155341386795044, -0.43833106756210327, 0.3909071683883667, -0.3153667449951172, 0.24377016723155975, 0.12734535336494446, 0.19972750544548035, 0.41405513882637024, -0.2240062654018402, -0.11846189945936203, 0.2459881752729416, 0.30486977100372314, -0.36962342262268066, -0.28234168887138367, 0.3600744903087616, -0.2298022210597992, 0.2739087641239166, -0.06005369499325752, -0.11753412336111069, -0.06161881238222122, 0.2937566041946411, -0.4766170084476471, -0.40660762786865234, -0.13945098221302032], [0.06483634561300278, 0.152290940284729, -0.04204397648572922, -0.26742443442344666, -0.1565031111240387, 0.016325077041983604, -0.04045557230710983, -0.26961463689804077, 0.02132928930222988, -0.0203818641602993, -0.05874915048480034, -0.04285001382231712, 0.3392832577228546, -0.017170673236250877, 0.053160469979047775, -0.0234104972332716, 0.015412464737892151, 0.17623934149742126, 0.062402140349149704, 0.12449370324611664, -0.12096758931875229, 0.0813433825969696, -0.053671788424253464, 0.18933053314685822, 0.21199865639209747, 0.19198045134544373, -0.1412186473608017, 0.04081517830491066, 0.14975404739379883, 0.09595126658678055, 0.016413962468504906, -0.14110030233860016, -0.21506746113300323, -0.03837168216705322, 0.10142917186021805, 0.08554638922214508, 0.052096493542194366, 0.00693365978077054, 0.1668221354484558, -0.01879827119410038], [0.15981730818748474, 0.2952462136745453, -0.22792141139507294, -0.06173417717218399, 0.2372211515903473, 0.3571719825267792, -0.09245742857456207, 0.034765273332595825, 0.06238942965865135, 0.04911023750901222, 0.09415007382631302, -0.12948240339756012, 0.18163791298866272, 0.16940531134605408, 0.05094081535935402, -0.03481217846274376, 0.06150054931640625, 0.16572600603103638, 0.19420196115970612, 0.23456214368343353, 0.020013069733977318, 0.07104187458753586, 0.0708998516201973, 0.09995253384113312, 0.1534932553768158, 0.10938573628664017, 0.20645764470100403, -0.006656457670032978, 0.23998340964317322, 0.13894709944725037, -0.04437398910522461, 0.17384828627109528, 0.16114097833633423, 0.2719486951828003, 0.09351738542318344, -0.023805756121873856, -0.05339382216334343, 0.4998583495616913, 0.23386047780513763, 0.32236912846565247], [0.028669320046901703, 0.07944805175065994, -0.017662815749645233, -0.10065385699272156, -0.25403454899787903, -0.03676501289010048, 0.2089085429906845, -0.04207592457532883, -0.06514719873666763, 0.011701058596372604, -0.10803455859422684, 0.011223133653402328, 0.0990174412727356, -0.05217844620347023, -0.11422187834978104, 0.05766747519373894, 0.14776985347270966, 0.07584743201732635, -0.05881257727742195, 0.12322969734668732, -0.04950413480401039, 0.03002827800810337, -0.016505040228366852, 0.0007111856248229742, 0.005419611465185881, 0.24376533925533295, -0.00879425648599863, -0.1596888303756714, 0.039268627762794495, -0.11049234867095947, -0.06438525021076202, 0.07569950819015503, -0.009954426437616348, -0.0013823838671669364, 0.06391780823469162, 0.10361970961093903, -0.04714464768767357, -0.031363364309072495, -0.008637822233140469, 0.03843136504292488], [-0.13434083759784698, -0.23773035407066345, -0.08873701095581055, 0.0890883207321167, 0.17117582261562347, 0.056446466594934464, 0.08811354637145996, 0.15930381417274475, 0.01834142953157425, 0.034183841198682785, 0.058772068470716476, 0.11551664769649506, 0.029520872980356216, 0.12294158339500427, 0.10583652555942535, -0.10964448750019073, -0.07924558967351913, -0.13802464306354523, 0.009456361643970013, -0.13603097200393677, 0.17374835908412933, -0.0010204239515587687, 0.03455429524183273, 0.11758237332105637, -0.06314724683761597, 0.015500159934163094, -0.0062357415445148945, -0.024013176560401917, 0.025678014382719994, -0.12472070008516312, -0.026701126247644424, -0.08097739517688751, 0.2574812173843384, 0.08205565065145493, 0.11198814958333969, 0.154628187417984, -0.012704096734523773, -0.04436958208680153, -0.012332139536738396, -0.25905171036720276], [0.10113608092069626, 0.12734057009220123, -0.0728941559791565, -0.03168235346674919, 0.13595527410507202, 0.002502409042790532, 0.3033621311187744, -0.0032965587452054024, 0.09748435765504837, 0.16771185398101807, 0.21373304724693298, 0.1444186121225357, -0.05119270831346512, 0.011305766180157661, 0.19059522449970245, 0.047988392412662506, 0.04170600697398186, 0.0890112891793251, 0.025410011410713196, 0.09206888824701309, 0.16055934131145477, 0.019452188163995743, -0.11005319654941559, 0.2938605844974518, -0.06382090598344803, 0.10801049321889877, 0.16984333097934723, 0.09935125708580017, -0.02710701711475849, -0.02797625958919525, 0.02749357931315899, 0.14694719016551971, -0.14204932749271393, -0.07359755039215088, -0.07830700278282166, -0.03608774021267891, -0.0032301016617566347, 0.06410229951143265, -0.07427411526441574, -0.03886944055557251], [-0.14474543929100037, 0.08433003723621368, -0.18771015107631683, -0.23009663820266724, -0.14260783791542053, -0.041849106550216675, -0.17511433362960815, -0.051880814135074615, -0.02804720029234886, -0.13516081869602203, -0.17614981532096863, -0.22360441088676453, 0.17422622442245483, -0.2730909287929535, -0.2857262194156647, -0.20061205327510834, 0.05765599012374878, 0.11488892138004303, -0.1035400927066803, -0.0901341512799263, -0.17401531338691711, -0.21501228213310242, -0.056155551224946976, -0.16613967716693878, 0.057692356407642365, 0.09851839393377304, -0.36447131633758545, -0.22352789342403412, 0.019226418808102608, 0.005528623703867197, -0.2078336626291275, 0.09684769064188004, -0.18011397123336792, 0.2373233437538147, 0.023578321561217308, 0.24688249826431274, 0.021248120814561844, -0.0863494873046875, 0.06178903579711914, 0.30866390466690063], [0.0772765576839447, 0.2521139681339264, 0.0814354419708252, 0.06490090489387512, -0.19909101724624634, -0.028671925887465477, -0.015696249902248383, -0.0587005577981472, -0.06152962148189545, 0.06591232866048813, 0.05907854437828064, -0.03937601298093796, 0.20578059554100037, 0.04073040932416916, 0.006049401592463255, 0.026923716068267822, 0.0687384381890297, 0.03216705098748207, -0.14117984473705292, 0.014449297450482845, -0.0441540889441967, 0.06990863382816315, -0.08187004178762436, -0.08477198332548141, 0.09339793026447296, -0.040295448154211044, 0.021096566691994667, 0.050203051418066025, -0.01211027055978775, 0.14610671997070312, -0.02230355702340603, 0.006514339707791805, -0.17634999752044678, 0.16060537099838257, 0.14058177173137665, 0.028940005227923393, -0.08192584663629532, 0.17192873358726501, 0.09266649186611176, 0.1505298614501953], [-0.283282071352005, 0.018699156120419502, 0.0423637256026268, 0.012515325099229813, 0.12030178308486938, -0.13441404700279236, 0.08876267075538635, 0.11181149631738663, 0.10366462916135788, 0.17416001856327057, 0.0821949765086174, 0.1625877469778061, -0.1536567658185959, 0.0615755058825016, 0.07417090982198715, 0.11363059282302856, -0.030574776232242584, 0.015115139074623585, 0.08258730173110962, -0.19035673141479492, 0.038569241762161255, -0.028992706909775734, 0.06829303503036499, -0.09807316213846207, -0.34155645966529846, -0.18179725110530853, 0.1483806073665619, -0.11063379794359207, -0.03180059790611267, 0.0257868655025959, 0.16786697506904602, -0.21704399585723877, 0.08634047955274582, -0.16601914167404175, -0.08968832343816757, -0.11633088439702988, 0.20148514211177826, -0.22660492360591888, -0.1258774697780609, -0.16732393205165863], [-0.13123594224452972, 0.13894103467464447, 0.06984096020460129, -0.06501810252666473, -0.11344042420387268, 0.03912299871444702, -0.037941478192806244, 0.20219844579696655, -0.06174561753869057, 0.0784466490149498, 0.0812116488814354, -0.04638071358203888, 0.10155817866325378, 0.08694247901439667, 0.1110929399728775, -0.018367018550634384, 0.13713902235031128, 0.027467770501971245, -0.01672476902604103, -0.015974223613739014, 0.18090388178825378, -0.0064207203686237335, 0.055688243359327316, 0.03125429525971413, 0.22021792829036713, 0.0537450909614563, 0.06071009859442711, -0.1166047677397728, 0.18772383034229279, 0.0466909185051918, 0.047704651951789856, 0.2189645767211914, 0.0225512832403183, -0.0010974773904308677, 0.24030537903308868, 0.2894117832183838, 0.08155366778373718, -0.029281172901391983, 0.03631417080760002, 0.18223929405212402], [-0.07619018107652664, 0.0923900306224823, 0.0348779559135437, 0.11866838485002518, 0.10958975553512573, -0.36019426584243774, 0.15753419697284698, 0.04151151701807976, -0.1818920224905014, 0.13825148344039917, -0.01317957229912281, 0.11814147979021072, 0.0834302008152008, 0.3485574424266815, 0.2631572186946869, 0.21538211405277252, -0.03629404678940773, 0.0014812977751716971, 0.16225796937942505, -0.11612056940793991, 0.1886245459318161, 0.19203250110149384, 0.035157185047864914, 0.037367768585681915, -0.24083122611045837, -0.09999147802591324, 0.20694279670715332, 0.06577181816101074, -0.08496985584497452, -0.03449369966983795, 0.09529522806406021, -0.16401110589504242, 0.16105765104293823, -0.21885432302951813, -0.24815583229064941, -0.12031649798154831, 0.012502496130764484, -0.2305707037448883, -0.15492820739746094, -0.1419372856616974], [-0.07172588258981705, -0.19698016345500946, 0.010316475294530392, -0.20823165774345398, -0.08962830156087875, -0.1983281821012497, 0.154831662774086, 0.2364010512828827, -0.08480747044086456, 0.23049381375312805, 0.22898365557193756, -0.11892727017402649, -0.24686990678310394, -0.2156658172607422, 0.16817398369312286, -0.03239579498767853, -0.12367017567157745, -0.034344594925642014, 0.08347351849079132, -0.08410128951072693, -0.10128683596849442, -0.021388741210103035, -0.14275498688220978, 0.29323458671569824, -0.12065891176462173, -0.08607325702905655, 0.07287276536226273, -0.030876081436872482, -0.13125193119049072, -0.13996845483779907, 0.07908382266759872, -0.29480794072151184, -0.02116357535123825, -0.08563347160816193, -0.2491433322429657, -0.18058094382286072, 0.09912315756082535, -0.1984463930130005, -0.15067759156227112, -0.15633156895637512], [-0.07964525371789932, -0.1993410885334015, 0.15542103350162506, 0.041042510420084, -0.013098287396132946, -0.12549526989459991, -0.014714210294187069, -0.09231027960777283, -0.21089553833007812, 0.04407181218266487, 0.21598629653453827, 0.17551584541797638, -0.10021395236253738, -0.17129434645175934, -0.1031370759010315, 0.06421907246112823, -0.005049943458288908, -0.24943113327026367, 0.22198061645030975, -0.10283312946557999, -0.06747357547283173, -0.0694970041513443, 0.09670573472976685, 0.25471195578575134, -0.1549444943666458, -0.043214134871959686, 0.03756018355488777, -0.02174651250243187, -0.029136745259165764, -0.17076827585697174, -0.043999288231134415, -0.16481773555278778, 0.24869826436042786, -0.016791509464383125, -0.02138306014239788, -0.03590133413672447, 0.28507065773010254, -0.40089693665504456, 0.026589250192046165, -0.2518015503883362], [0.060898929834365845, 0.07676766812801361, 0.02900298498570919, 0.057003557682037354, 0.08478744328022003, -0.0014078618260100484, 8.476508082821965e-05, 0.0038056729827076197, -0.09768042713403702, 0.028492584824562073, -0.05825982987880707, -0.01946033351123333, 0.11147592961788177, 0.08875896781682968, -0.19998863339424133, -0.2135535031557083, 0.228430837392807, 0.05297050625085831, 0.18866971135139465, -0.03203922137618065, -0.15252986550331116, 0.16281120479106903, -0.015317094512283802, 0.14360131323337555, -0.012637775391340256, 0.21909630298614502, 0.2539803683757782, -0.19182898104190826, 0.08801151067018509, -0.011148941703140736, -0.028172343969345093, 0.1894424855709076, 0.1295556277036667, 0.03576087951660156, -0.008600553497672081, -0.019861949607729912, -0.12048980593681335, -0.05479721352458, 0.07171043753623962, 0.1634044498205185], [0.07883939892053604, 0.2193363755941391, -0.18120679259300232, 0.09401065856218338, 0.14314505457878113, -0.029697291553020477, -0.010240999050438404, -0.15911129117012024, 0.02444959059357643, 0.10996752977371216, 0.06104184314608574, 0.10296176373958588, 0.10207419097423553, 0.003516992088407278, -0.05689122527837753, 0.00831266026943922, 0.08226674795150757, 0.11641882359981537, 0.08009788393974304, 0.17912980914115906, -0.005985476076602936, -0.03649343177676201, 0.11676865816116333, -0.16773387789726257, 0.2417641431093216, 0.04465321823954582, -0.10784848779439926, -0.1920398324728012, 0.10518156737089157, 0.2425456941127777, 0.08465848118066788, 0.003352520288899541, 0.06691156327724457, 0.11115971952676773, 0.037939757108688354, 0.23344959318637848, -0.04273545369505882, 0.10015054792165756, 0.023469043895602226, 0.13865362107753754], [0.04495149105787277, 0.14814552664756775, 0.07104124128818512, 0.09446873515844345, 0.25748443603515625, 0.07306893914937973, 0.05722649395465851, 0.029762566089630127, -0.04604435712099075, 0.0931394100189209, -0.054108019918203354, 0.16954413056373596, 0.20120400190353394, 0.16007207334041595, -0.09177461266517639, 0.03261374309659004, 0.01696380414068699, 0.1267407387495041, 0.13349346816539764, 0.02232566848397255, 0.16904868185520172, 0.06519920378923416, 0.001429211930371821, 0.010467765852808952, 0.1566297709941864, -0.1490180790424347, -0.007841670885682106, 0.11524825543165207, 0.16426730155944824, 0.2667768597602844, 0.09390813112258911, 0.33944159746170044, -0.04707802087068558, -0.1875462681055069, 0.15679830312728882, 0.09843350946903229, 0.3160204589366913, -0.06573604792356491, -0.04466017708182335, 0.1940174251794815], [0.09293781220912933, 0.07597097754478455, 0.04503035545349121, 0.0959838256239891, -0.07852307707071304, 0.2656805217266083, 0.18930289149284363, -0.052932173013687134, -0.0011391380103304982, -0.0901484563946724, -0.02167198434472084, 0.09722509980201721, -0.021499408408999443, -0.08730035275220871, 0.013844279572367668, 0.11641525477170944, 0.05363107845187187, 0.09456988424062729, -0.07113239169120789, 0.18883934617042542, -0.08531428128480911, -0.05811535567045212, -0.20534290373325348, -0.01311003603041172, 0.07053395360708237, 0.03130471333861351, -0.05063977465033531, -0.020362187176942825, -0.03342577442526817, -0.01205070037394762, -0.1470339149236679, 0.10169372707605362, -0.0838334709405899, -0.0016715106321498752, 0.09464145451784134, -0.004030402284115553, -0.32549357414245605, 0.07156822085380554, 0.0717325359582901, 0.0757358968257904], [-0.046817079186439514, -0.015537895262241364, 0.2170836478471756, 0.20132723450660706, 0.05538475885987282, -0.1135772094130516, 0.06585362553596497, -0.016596758738160133, 0.009224390611052513, 0.015402470715343952, 0.22528307139873505, 0.17528797686100006, -0.14553187787532806, 0.16134993731975555, 0.17214840650558472, 0.13628342747688293, 0.10270475596189499, 0.026837460696697235, 0.05285080894827843, -0.1500343680381775, 0.15180198848247528, -0.06744546443223953, 0.05722881108522415, 0.3092877268791199, -0.15164867043495178, -0.05790584534406662, 0.07366499304771423, 0.15686044096946716, 0.014029596000909805, -0.16715669631958008, 0.20184651017189026, -0.03231729194521904, 0.14635422825813293, -0.15252439677715302, -0.23626117408275604, -0.2658604681491852, 0.046319566667079926, -0.1142784133553505, -0.031031223013997078, -0.020078524947166443], [-0.1312817633152008, -0.13563524186611176, -0.09278048574924469, 0.019925162196159363, -0.0751175582408905, -0.10121256113052368, -0.06894627958536148, -0.15126553177833557, -0.1174168735742569, 0.006369082722812891, 0.11754831671714783, -0.057451825588941574, 0.09594747424125671, -0.0015837752725929022, 0.07946546375751495, -0.10432504862546921, 0.02804008312523365, 0.013249422423541546, 0.023137111216783524, 0.020266013219952583, 0.036704376339912415, -0.06639162451028824, 0.09963588416576385, -0.03345198929309845, 0.007463454268872738, 0.018996059894561768, -0.10456710308790207, 0.17622628808021545, 0.005752642638981342, 0.03244367986917496, 0.06628020107746124, -0.1294810026884079, -0.20487827062606812, 0.02135024219751358, 0.08007412403821945, 0.12056099623441696, 0.2174702286720276, -0.18964025378227234, -0.0944850966334343, -0.21470411121845245], [-0.19344647228717804, 0.22064843773841858, 0.07896694540977478, -0.11828785389661789, -0.12872309982776642, -0.2234858274459839, 0.08559194207191467, 0.04679698497056961, -0.127510666847229, -0.06567711383104324, -0.05736937001347542, 0.059307485818862915, 0.08844964951276779, -0.09575970470905304, 0.03600790724158287, -0.16317710280418396, 0.13135743141174316, -0.04773135483264923, -0.10814031213521957, -0.09214294701814651, -0.12424435466527939, 0.06659223139286041, -0.1469833105802536, -0.19353772699832916, 0.07786032557487488, -0.06524039059877396, -0.1814929097890854, -0.036809291690588, 0.001833941088989377, 0.20390215516090393, -0.057828638702631, -0.12808173894882202, 0.042138539254665375, -0.06205341964960098, 0.3296172022819519, -0.0846799835562706, 0.00965746957808733, -0.294551283121109, 0.1246371939778328, 0.15923458337783813], [0.19062401354312897, -0.055551573634147644, -0.1124236062169075, 0.01873951405286789, 0.07025119662284851, 0.16430170834064484, -0.11215974390506744, 0.059824615716934204, -0.09085637331008911, 0.015467647463083267, 0.10589628666639328, 0.045177094638347626, 0.0053766570053994656, -0.08467872440814972, -0.01631472446024418, -0.05378187075257301, -0.03012469783425331, 0.13850733637809753, -0.04208381474018097, 0.06538689881563187, 0.14495058357715607, -0.03498739004135132, -0.15282641351222992, -0.006421572528779507, 0.0937580093741417, 0.022342417389154434, 0.05522152781486511, -0.19719183444976807, 0.15529334545135498, 0.09316368401050568, 0.12235800176858902, 0.03019024059176445, 0.030714334920048714, -0.06450295448303223, 0.07635211199522018, 0.07579877972602844, -0.04171708598732948, -0.03231142833828926, -0.014812670648097992, 0.09071191400289536], [-0.11544138938188553, -0.11297222226858139, 0.1752558797597885, 0.29555341601371765, -0.09768585115671158, -0.05033925175666809, 0.16031795740127563, 0.03917640820145607, -0.1898259073495865, 0.08702553063631058, -0.15387605130672455, 0.02396283857524395, -0.13815878331661224, -0.03806443139910698, -0.22737741470336914, 0.03665923327207565, 0.09007138013839722, -0.0772571936249733, -0.03769788518548012, 0.06360534578561783, 0.14541013538837433, 0.1591588854789734, 0.11662496626377106, 0.04663383960723877, -0.041841451078653336, 0.00949408020824194, 0.09093541651964188, 0.01240519154816866, -0.12700065970420837, -0.24605993926525116, 0.018497182056307793, -0.17529280483722687, 0.04627889022231102, -0.08757496625185013, -0.007714875042438507, 0.1461622267961502, 0.19730858504772186, -0.289029985666275, 0.016445156186819077, 0.06484251469373703], [-0.10582966357469559, 0.08518627285957336, 0.002710646251216531, 0.0999893918633461, 0.18620537221431732, -0.08776694536209106, 0.006501680240035057, 0.14476826786994934, -0.07784178107976913, -0.01422106847167015, 0.09372161328792572, 0.09209619462490082, -0.05108373239636421, -0.07783354818820953, 0.04270496964454651, -0.0817563533782959, 0.018563851714134216, -0.07451470196247101, -0.032923564314842224, -0.00677712494507432, 0.12453439086675644, -0.21868112683296204, -0.03652846813201904, 0.09107786417007446, 0.041141122579574585, 0.09300842881202698, 0.028482357040047646, 0.24172960221767426, -0.10719732195138931, -0.005240812432020903, 0.024297574535012245, -0.22873909771442413, -0.041690893471241, -0.038752276450395584, 0.039861179888248444, 0.035054076462984085, -0.10867539048194885, 0.04337409883737564, -0.03765563294291496, -0.0172918438911438], [0.08244194090366364, -0.047659654170274734, -0.032476797699928284, 0.07601065188646317, 0.09708890318870544, -0.16561073064804077, 0.021170439198613167, 0.026180831715464592, -0.05048203840851784, -0.02507500909268856, -0.16619601845741272, 0.2163059413433075, 0.21120701730251312, 0.06966546177864075, -0.025507094338536263, 0.14988736808300018, -0.07404030859470367, 0.06279904395341873, -0.019901594147086143, 0.028329484164714813, -0.025408435612916946, -0.04977141320705414, 0.03253617137670517, -0.07194340974092484, -0.010367206297814846, 0.11356475204229355, -0.12704746425151825, -0.016677845269441605, -0.07030799984931946, -0.055365968495607376, -0.03445525839924812, -0.005021857563406229, 0.13921169936656952, -0.09853370487689972, -0.06617356091737747, 0.13674697279930115, 0.030436230823397636, -0.19632387161254883, -0.11523958295583725, -0.22616054117679596], [-0.09119190275669098, -0.0983610451221466, -0.09884387254714966, -0.06015385687351227, 0.0745900496840477, -0.02759386971592903, 0.28130778670310974, -0.009390968829393387, -0.07232727110385895, 0.004432748071849346, -0.043084029108285904, -0.05042252317070961, 0.036997199058532715, 0.04728197306394577, -0.010843973606824875, -0.02573322132229805, -0.022277042269706726, -0.0653756707906723, 0.14644549787044525, -0.10138304531574249, 0.13245540857315063, 0.05281699821352959, 0.05292632058262825, 0.07582074403762817, 0.03347424417734146, -0.09552401304244995, -0.01661611720919609, -0.33235418796539307, -0.07727116346359253, 0.01226488035172224, -0.10950625687837601, -0.2142350822687149, 0.07206279039382935, -0.2408229559659958, 0.049512218683958054, -0.030865538865327835, 0.12949238717556, -0.17805695533752441, -0.10015875101089478, -0.021514859050512314], [-0.04042934626340866, 0.11241589486598969, -0.07552366703748703, 0.2767215073108673, 0.007474557962268591, -0.07474122196435928, -0.11376989632844925, 0.06632565706968307, -0.06945234537124634, 0.00537960696965456, 0.17172051966190338, 0.2809871435165405, -0.13371208310127258, -0.027357114478945732, -0.04671873524785042, 0.010491940192878246, -0.1536675989627838, 0.052492305636405945, -0.04112225025892258, 0.058089300990104675, 0.023013275116682053, -0.01532098837196827, -0.04435515031218529, -0.07121092081069946, 0.021979056298732758, 0.030959518626332283, -0.0633639469742775, -0.03665836155414581, -0.10238712280988693, 0.049153778702020645, 0.0991232693195343, -0.04422147572040558, 0.2637322247028351, -0.14160962402820587, -0.20120671391487122, -0.1968570053577423, -0.009315967559814453, 0.31837087869644165, -0.07111361622810364, -0.16649191081523895], [0.010998823679983616, -0.11982987076044083, 0.034841250628232956, -0.08802948892116547, 0.10001926124095917, -0.15320119261741638, -0.07738864421844482, 0.11482511460781097, 0.03403690829873085, 0.01861710660159588, -0.09303958714008331, -0.07018774002790451, -0.013022016733884811, -0.0764123871922493, -0.1504177749156952, -0.04777732491493225, -0.040529973804950714, -0.03300999850034714, 0.09248543530702591, 0.05198949575424194, 0.14640925824642181, 0.1040642261505127, 0.09961143881082535, 0.1607804000377655, 0.07611925899982452, -0.044997166842222214, 0.19019350409507751, 0.048243165016174316, 0.03627613186836243, 0.17742140591144562, 0.06403546035289764, 0.21244357526302338, 0.04619390144944191, 0.11434751749038696, 0.2347734421491623, 0.10737284272909164, -0.0746859461069107, -0.06703342497348785, -0.005967600736767054, 0.0716998279094696], [-0.04339144378900528, 0.028537046164274216, -0.19509276747703552, 0.05680988356471062, -0.054362162947654724, -0.11076998710632324, -0.29384469985961914, -0.003749170573428273, 0.03414199873805046, -0.10496562719345093, -0.07198093086481094, -0.05640796944499016, -0.04546966031193733, -0.06918090581893921, -0.17200210690498352, -0.2984841763973236, -0.023068370297551155, 0.05431891605257988, -0.07522492110729218, -0.011727915145456791, 0.06907717883586884, -0.08016854524612427, 0.00015341097605414689, -0.13369855284690857, -0.10691597312688828, 0.07665441185235977, -0.07659627497196198, -0.18606600165367126, 0.08968989551067352, -0.014732269570231438, -0.09661737829446793, 0.011707901023328304, 0.06399513781070709, -0.007060980889946222, -0.07246913015842438, -0.135895237326622, 0.005037943832576275, 0.1282503455877304, 0.03341153264045715, -0.13256822526454926], [-0.06468890607357025, -0.09045492112636566, 0.007150611374527216, 0.04037032648921013, 0.2029394805431366, -0.21089868247509003, -0.014111427590250969, -0.02056710235774517, -0.11084400117397308, 0.020497485995292664, 0.31172648072242737, 0.38818928599357605, -0.3128291070461273, 0.20899905264377594, 0.08900199830532074, 0.023512637242674828, -0.14837996661663055, -0.09065843373537064, 0.30372700095176697, -0.23362129926681519, 0.0960964784026146, 0.22936402261257172, 0.05357008054852486, 0.1881769597530365, -0.09847013652324677, -0.052688706666231155, 0.06800326704978943, 0.0654892772436142, -0.181966170668602, -0.22906649112701416, 0.23567627370357513, -0.17431971430778503, 0.1301090568304062, -0.2668610215187073, -0.13868184387683868, -0.2274366170167923, 0.21867544949054718, -0.09721231460571289, -0.19842740893363953, -0.2975509762763977], [-0.1271401345729828, -0.1945781409740448, 0.1782131791114807, -0.02976798638701439, -0.015829218551516533, -0.16482950747013092, 0.04674309864640236, 0.009310916997492313, -0.07849366962909698, -0.0910792201757431, -0.04153449833393097, 0.07868735492229462, 0.006228375714272261, -0.13658198714256287, -0.08867664635181427, 0.26079532504081726, -0.10706362128257751, 0.039731211960315704, -0.03361216560006142, -0.08391663432121277, 0.1271132081747055, -0.0004306708287913352, -0.06995929777622223, 0.054767414927482605, -0.003589120926335454, 0.10537553578615189, 0.07876889407634735, 0.06249120831489563, 0.03725213184952736, -0.13243548572063446, -0.028719421476125717, -0.26735615730285645, -0.22654445469379425, -0.11676771193742752, -0.21013198792934418, -0.18861857056617737, 0.09620488435029984, -0.11244494467973709, -0.10425566136837006, -0.018483970314264297], [0.30061042308807373, 0.186447411775589, -0.221750408411026, -0.2873905301094055, -0.038049325346946716, 0.23745988309383392, -0.15304256975650787, 0.17938849329948425, 0.06690461933612823, -0.08542865514755249, -0.05296981334686279, -0.05452681705355644, 0.21892130374908447, 0.13293051719665527, 0.16279920935630798, -0.23240548372268677, 0.15006136894226074, 0.13553749024868011, 0.16191814839839935, 0.2623516023159027, 0.19297374784946442, -0.14097003638744354, 0.19926080107688904, 0.1045866385102272, 0.11235439777374268, 0.060176510363817215, -0.08515799045562744, 0.008586844429373741, 0.1612045168876648, 0.235429584980011, -0.1380649209022522, 0.2126961648464203, 0.10592390596866608, 0.11174499988555908, 0.16136839985847473, 0.044499803334474564, -0.11358252912759781, 0.2713905870914459, 0.3377527892589569, 0.26678264141082764], [-0.04890425503253937, 0.09715993702411652, -0.03638939559459686, 0.26067569851875305, 0.09939053654670715, -0.005044376477599144, 0.04374050348997116, 0.2289191037416458, -0.01710730418562889, 0.12665338814258575, -0.13083837926387787, 0.14935527741909027, -0.14092859625816345, -0.12048444151878357, 0.019480202347040176, 0.23447181284427643, 0.0581463947892189, -0.00691587571054697, 0.0736074447631836, 0.031580667942762375, 0.19435669481754303, -0.1228991225361824, -0.09361815452575684, 0.13541041314601898, -0.04101386293768883, 0.03718801215291023, 0.033991746604442596, -0.0545918233692646, 0.002913158852607012, -0.0005520989652723074, 0.014842326752841473, 0.06750060617923737, -0.08638753741979599, -0.06668787449598312, -0.09060858190059662, 0.12475226074457169, -0.012941473163664341, 0.05556645616889, -0.02730550244450569, 0.07036697864532471], [0.010884439572691917, -0.03369781747460365, -0.0848667249083519, -0.046271875500679016, -0.2933928072452545, 0.3128860890865326, -0.21448862552642822, -0.288001149892807, 0.014907296746969223, -0.12657418847084045, -0.021629683673381805, -0.10269308090209961, 0.19753162562847137, -0.23646575212478638, -0.0005774275632575154, -0.033033426851034164, 0.00596891762688756, 0.009325970895588398, -0.13035492599010468, 0.19812841713428497, -0.1842035949230194, -0.1447431594133377, 0.016396503895521164, 0.014029241167008877, 0.06814493983983994, 0.20886211097240448, -0.09149082005023956, 0.0074355723336339, 0.07542303949594498, -0.04330737516283989, -0.2716801166534424, 0.2094399780035019, -0.23946376144886017, 0.24754518270492554, 0.39087140560150146, 0.23571635782718658, 0.010095024481415749, 0.15997284650802612, 0.019149428233504295, 0.028817545622587204], [-0.03313280642032623, -0.02398267574608326, -0.15319497883319855, -0.13364872336387634, -0.0005648332298733294, 0.030598314478993416, 5.2241415687603876e-05, -0.03462490811944008, -0.24746906757354736, 0.16502493619918823, -0.13231055438518524, 0.1542683243751526, -0.025787634775042534, 0.009288731962442398, -0.04040108248591423, -0.03112664818763733, -0.07960116118192673, -0.057696837931871414, -0.010819616727530956, -0.25445008277893066, 0.004266252741217613, 0.06151435524225235, -0.01974128559231758, 0.004701801110059023, -0.011576552875339985, -0.039348796010017395, -0.03704516962170601, 0.11856433749198914, 0.005788262002170086, 0.04776323214173317, -0.1102951318025589, 0.158103346824646, -0.17031273245811462, 0.06669851392507553, -0.026808595284819603, -0.04089794680476189, 0.1339649260044098, -0.14083431661128998, -0.06728632003068924, -0.11287668347358704], [-0.11510865390300751, -0.10816368460655212, -0.1268635243177414, 0.10872992873191833, 0.13292726874351501, 0.13621710240840912, 0.2228468507528305, 0.0477621965110302, -0.11708976328372955, 0.09001049399375916, 0.024173066020011902, -0.1208329051733017, -0.04465173929929733, 0.05483326315879822, -0.061007507145404816, -0.2220125049352646, 0.042462218552827835, -0.1551625281572342, -0.10994050651788712, -0.07983053475618362, -0.0020734108984470367, -0.07072871178388596, 0.11050441861152649, -0.07631753385066986, 0.09933262318372726, -0.09194965660572052, -0.11947502195835114, 0.08767325431108475, 0.11854302138090134, -0.2405060976743698, -0.050963230431079865, 0.13256128132343292, 0.033377449959516525, 0.07396009564399719, 0.10507034510374069, 0.16292451322078705, -0.0797005221247673, 0.008289188146591187, 0.015591624192893505, 0.10917987674474716], [0.3520629405975342, 0.09866172075271606, -0.2901146113872528, -0.10534961521625519, -0.126203253865242, 0.1715514063835144, -0.4266337752342224, -0.3467273414134979, 0.14140315353870392, -0.27081602811813354, -0.15092241764068604, -0.38778334856033325, 0.264586478471756, -0.044693559408187866, 0.11467039585113525, -0.09023347496986389, 0.15904222428798676, 0.20777909457683563, -0.17296892404556274, 0.08064527064561844, -0.2675554156303406, -0.4299497902393341, -0.2554178237915039, -0.08134853839874268, 0.1795610934495926, 0.11257225275039673, -0.21252894401550293, -0.07247292995452881, 0.18794994056224823, 0.20257820188999176, -0.292194664478302, 0.17403455078601837, -0.05571071058511734, -0.04648542404174805, 0.06447558104991913, 0.008291608653962612, -0.1128394603729248, -0.13241036236286163, 0.06852304190397263, -0.001773195224814117], [-0.1966969519853592, -0.14803490042686462, 0.29853737354278564, 0.19779780507087708, 0.17123769223690033, 0.07167820632457733, 0.12001500278711319, 0.004736317787319422, -0.03148476034402847, 0.18469339609146118, -0.0035850889980793, 0.3007551431655884, -0.10677864402532578, -0.06831313669681549, 0.11475633084774017, 0.021848374977707863, 0.011235706508159637, -0.12717024981975555, -0.08727455139160156, 0.0648748129606247, 0.05301208049058914, 0.03362593799829483, 0.26874396204948425, -0.10086778551340103, 0.028957447037100792, 0.020458417013287544, 0.16707435250282288, 0.1713477075099945, -0.12932497262954712, -0.03215242922306061, 0.09685507416725159, 0.2635374963283539, -0.15226922929286957, 0.2748786509037018, 0.04011308029294014, 0.07359953224658966, -0.1730497032403946, -0.186931312084198, -0.019346902146935463, -0.030562466010451317], [0.004568427335470915, 0.039306558668613434, -0.1058882474899292, -0.03877970576286316, 0.24789291620254517, -0.12276905030012131, 0.13973195850849152, 0.23092491924762726, 0.01868322491645813, -0.1554286926984787, -0.02918517403304577, 0.031872060149908066, -0.015314601361751556, -0.08869075775146484, -0.17175275087356567, -0.1924867182970047, 0.1442251056432724, 0.1311327964067459, 0.08851472288370132, 0.012174641713500023, -0.10106611251831055, -0.0738535225391388, 0.01993175968527794, 0.01948176883161068, -0.13312432169914246, -0.10519978404045105, -0.06503748893737793, 0.0060472809709608555, -0.05274325981736183, 0.1391727328300476, -0.043480273336172104, 0.045831575989723206, 0.05725325271487236, 0.03851836174726486, -0.06845347583293915, 0.05590352043509483, 0.07010497897863388, -0.1322356015443802, 0.0234714075922966, 0.04003514349460602], [-0.10491254925727844, -0.025040138512849808, -0.140091672539711, 0.04096582904458046, 0.3425547182559967, -0.027067679911851883, 0.12194006145000458, 0.17827627062797546, -0.015160072594881058, 0.14454101026058197, 0.284645140171051, 0.0640813559293747, 0.034068405628204346, -0.0018270107684656978, 0.24557527899742126, 0.09449952840805054, -0.014457449316978455, -0.21187862753868103, 0.02950732409954071, -0.3021255433559418, -0.08981871604919434, -0.09603966027498245, -0.11348354816436768, 0.2054748386144638, -0.03921613469719887, 0.03947706148028374, 0.27547526359558105, 0.1452360302209854, 0.09664416313171387, 0.05864861607551575, 0.1832965463399887, 0.04379724711179733, 0.03547719493508339, -0.2051578164100647, 0.03069394640624523, -0.04871320351958275, 0.030305951833724976, -0.3076632022857666, -0.13116854429244995, 0.030059466138482094], [-0.06898527592420578, -0.05812196433544159, 0.02827792428433895, 0.18030060827732086, 0.011647513136267662, -0.06786807626485825, 0.015324953012168407, -0.07010038942098618, 0.005768548231571913, 0.06437687575817108, 0.04516318812966347, 0.04752358794212341, -0.1001601368188858, 0.16134501993656158, -0.03743759170174599, 0.037221554666757584, 0.07020620256662369, -0.10302874445915222, 0.22625094652175903, -0.14027529954910278, 0.1918300837278366, 0.09489955008029938, -0.039553508162498474, 0.07471217960119247, -0.010930659249424934, -0.061539143323898315, -0.08750957250595093, 0.09236162900924683, -0.02938622422516346, -0.14702485501766205, 0.021547218784689903, -0.047482680529356, -0.15413518249988556, -0.09731665253639221, 0.04927786812186241, 0.14837278425693512, -0.06878799945116043, -0.16198615729808807, -0.05335963889956474, -0.005042971111834049], [-0.18188025057315826, -0.23815008997917175, -0.1541893184185028, 0.18195010721683502, -0.049892157316207886, -0.2462281733751297, 0.20898932218551636, -0.11237562447786331, -0.10845650732517242, 0.1283235251903534, 0.030556384474039078, 0.23377835750579834, -0.18665435910224915, 0.14620018005371094, -0.08193603903055191, 0.1638011932373047, 0.09429566562175751, -0.19320686161518097, -0.01749715954065323, -0.11058475822210312, 0.2957219183444977, 0.18565621972084045, -0.17659848928451538, -0.016913210973143578, -0.1515045315027237, -0.19254088401794434, 0.10233409702777863, 0.27745378017425537, -0.09089459478855133, -0.19276602566242218, 0.0504494309425354, -0.1530497521162033, -0.032179538160562515, 0.06494366377592087, -0.11016581207513809, -0.10373003035783768, 0.04668959230184555, -0.30307474732398987, -0.12343893945217133, -0.08090980350971222], [-0.05906389653682709, -0.09901950508356094, -0.09921493381261826, 0.11975720524787903, 0.04238620027899742, 0.11200609058141708, 0.11531674861907959, 0.10364571958780289, 0.14643166959285736, 0.05261185020208359, -0.1357084959745407, 0.017622681334614754, 0.09498292207717896, 0.11834288388490677, -0.0966649278998375, -0.00400492874905467, 0.06585700064897537, -0.02932228334248066, 0.057330019772052765, 0.0873430147767067, 0.07576654106378555, 0.020489532500505447, 0.09006783366203308, 0.00284231873229146, 0.1374504566192627, 0.15971539914608002, -0.05325889214873314, -0.030315369367599487, -0.020481962710618973, -0.00470018433406949, -0.013648098334670067, -0.06175746023654938, 0.029747288674116135, 0.19878414273262024, 0.19331389665603638, 0.13651005923748016, -0.07406730949878693, 0.0527472198009491, -0.11981629580259323, -0.10405247658491135], [0.07176722586154938, -0.16398748755455017, 0.08741621673107147, 0.21212682127952576, 0.16842801868915558, 0.18349507451057434, 0.02969994954764843, -0.16731376945972443, -0.08726366609334946, 0.09885044395923615, -0.044339317828416824, 0.09341927617788315, -0.0188906267285347, -0.09569459408521652, -0.04743752256035805, 0.10972829908132553, -0.1459364891052246, 0.06272193044424057, -0.08212918788194656, -0.10063687711954117, 0.0729186087846756, 0.13108743727207184, 0.049691345542669296, -0.10500970482826233, -0.05871608108282089, -0.10831965506076813, -0.08387985825538635, -0.007790843956172466, 0.00901973806321621, -0.16510136425495148, -0.07190511375665665, -0.17418457567691803, 0.15777255594730377, -0.20714335143566132, -0.10767526179552078, -0.10968048870563507, -0.004570238292217255, 0.010279253125190735, 0.12306094914674759, -0.09641725569963455], [-0.044274263083934784, -0.0231975968927145, 0.10305317491292953, -0.12943193316459656, 0.14890143275260925, -0.0251545999199152, -0.10244721174240112, 