{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_7", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "hidden_2"}, "name": "hidden_2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": [[0.10990588366985321, 0.01268772128969431, -0.06133531779050827, 0.2459878772497177, 0.015517592430114746, 0.01748865284025669, 0.14707794785499573, 0.0758894830942154, -0.1265009194612503, 0.13059589266777039, -0.1709057241678238, -0.07039157301187515, -0.03633369877934456, 0.08579825609922409, -0.04707840457558632, 0.05936909839510918, -0.013498914428055286, -0.10201346129179001, 0.07811500877141953, 0.09499239921569824, -0.11622573435306549, 0.29825061559677124, -0.2984822690486908, -0.1771702915430069, -0.061788953840732574, 0.10742069035768509, -0.010673384182155132, 0.31637004017829895, 0.07084464281797409, -0.05272074043750763, -0.06991461664438248, -0.20551873743534088, -0.18027347326278687, 0.16307829320430756, 0.017541632056236267, 0.049306437373161316, 0.0471164844930172, -0.0696987584233284, -0.18131504952907562, -0.17900025844573975, -0.14774452149868011, 0.04981685429811478, -0.013165879994630814, 0.0793587937951088, -0.05556289106607437, 0.2979596257209778, 0.20145384967327118, 0.08624874800443649, -0.29220855236053467, 0.07664725184440613, 0.12213331460952759, -0.14844460785388947, 0.09840599447488785, 0.0348307229578495, 0.24940311908721924, -0.0761338621377945, 0.09219978749752045, -0.17773555219173431, 0.009113860316574574, 0.24586156010627747, 0.40804368257522583, 0.18729835748672485, -0.3166094124317169, -0.027385788038372993, 0.09053821116685867, -0.059359725564718246, 0.2554170489311218, -0.057617321610450745, -0.049988728016614914, 0.21818844974040985, -0.26777178049087524, -0.020563028752803802, 0.14265631139278412, -0.03159355744719505, -0.10595058649778366, -0.03204150125384331, -0.27925950288772583, -0.03727041557431221, -0.17687201499938965, 0.15155434608459473, 0.0012692718300968409, 0.1504126340150833, -0.30176374316215515, 0.1873103827238083, -0.07811494916677475, 0.053947821259498596, -0.053642310202121735, -0.008974325843155384, -0.0866457000374794, 0.19846542179584503, 0.159977525472641, 0.15827444195747375, 0.06121421232819557, -0.2753508388996124, -0.05949576571583748, 0.25608503818511963, 0.23082603514194489, 0.14823444187641144, 0.13310016691684723, -0.07462549209594727, -0.044657204300165176, -0.16518355906009674, -0.012572366744279861, -0.0757027119398117, -0.10473106801509857, 0.13160939514636993, -0.08647048473358154, -0.1722947657108307, -0.10599420964717865, -0.13328996300697327, -0.12361660599708557, 0.115794338285923, -0.05807681381702423, 0.1055103987455368, 0.08293632417917252, 0.024066172540187836, -0.06580724567174911, 0.09315226972103119, 0.2759237289428711, 0.05868351086974144, -0.03892914950847626, 0.11334563791751862, -0.18348747491836548, -0.052238527685403824, -0.02014969475567341, -0.03531268984079361, -0.3091619908809662, 0.2392471432685852, 0.040627311915159225, 0.2875414192676544, 0.2196788340806961, 0.09891287982463837, 0.05196158215403557, -0.26717668771743774, 0.148172065615654, 0.09114182740449905, 0.057860419154167175, -0.11252584308385849, 0.061098385602235794, -0.005246328189969063, 0.1777588129043579, 0.12172409147024155, -0.3667806088924408, -0.006307098548859358, -0.006282884627580643, -0.1569974273443222, 0.14564630389213562, -0.2962178587913513, -0.1308096945285797, 0.13102573156356812, -0.0957314595580101, 0.1077260673046112, -0.10899678617715836, 0.2304995059967041, 0.09098458290100098, 0.00044653512304648757, 0.03082796186208725, 0.0010228314204141498, -0.13140735030174255, -0.040604785084724426, 0.004752191714942455, 0.06274934113025665, -0.01844344288110733, 0.13576030731201172, 0.17315322160720825, -0.29980024695396423, 0.1171107292175293, -0.16398397088050842, -0.19471848011016846, 0.2898504137992859, 0.0878428965806961, -0.16237470507621765, 0.04086173698306084, -0.09836095571517944, 0.04240982234477997, 0.23748961091041565, 0.045250218361616135, -0.01833561807870865, 0.026226548478007317, -0.15885239839553833, -0.2808263599872589, 0.03413258492946625, -0.1489967703819275, -0.12336820363998413, 0.020242655649781227, -0.11882869154214859, 0.03431808575987816, 0.034362103790044785, 0.17659175395965576, -0.10040540248155594, -0.016820700839161873, 0.035665113478899, 0.08024733513593674, -0.00492315785959363, 0.054626982659101486, -0.055044304579496384, -0.03079199232161045, -0.012055465951561928, 0.23142139613628387, -0.16070379316806793, -0.10086093097925186, 0.12525483965873718, -0.28781089186668396, 0.00980003084987402, -0.15804336965084076, -0.25618603825569153, -0.1457899659872055, 0.027787446975708008, 0.05812448635697365, 0.22163589298725128, -0.07255198061466217, -0.11312410980463028, -0.11330443620681763, -0.01627373695373535, 0.09771054238080978, -0.03352303057909012, 0.0813179463148117, -0.3212372660636902, 0.17714561522006989, 0.05181116238236427, -0.093909353017807, -0.2031928300857544, -0.45041435956954956, 0.08027558028697968, 0.06547600030899048, -0.0445362813770771, -0.021112998947501183, -0.0018267026171088219, -0.2529350221157074, -0.17514926195144653, -0.06366631388664246, -0.08123758435249329, 0.15497258305549622, -0.09666050970554352, 0.06313996762037277, 0.015843482688069344, -0.22791896760463715, 0.03079632669687271, -0.05419183522462845, 0.27346786856651306, -0.12393948435783386, 0.14173895120620728, -0.13412554562091827, -0.19902008771896362, 0.06204742193222046, 0.12822677195072174, 0.0284657534211874, 0.056647107005119324, -0.04672277346253395, -0.15611103177070618, -0.017951248213648796, 0.01751828007400036, -0.15585356950759888, 0.13471460342407227, 0.22201105952262878, -0.18618498742580414, 0.15885856747627258, -0.047314878553152084, -0.03959568217396736, 0.08610449731349945, 0.05745876207947731, 0.015590919181704521, -0.15514549612998962, -0.078982412815094, -0.0485006682574749, 0.0421755276620388, 0.23023439943790436, 0.022625219076871872, -0.038391899317502975, 0.08676464110612869, -0.31677037477493286, -0.3457573354244232, 0.16773100197315216, 0.17346243560314178, 0.04860323294997215, -0.03601137176156044, 0.0828644335269928, -0.057906847447156906, 0.03169472515583038, -0.08542361110448837, 0.19438007473945618, -0.06943412125110626, -0.04918907582759857, -0.1899215281009674, -0.10902155190706253, 0.16378112137317657, -0.016373690217733383, 0.03478072211146355, -0.06394386291503906, -0.17829875648021698, -0.12508046627044678, 0.04207582026720047, -0.16507242619991302, 0.27339643239974976, -0.2584468722343445, 0.013225696049630642, -0.17862115800380707, 0.2532922327518463, 0.27266615629196167, 0.11293446272611618], [-0.06272561848163605, 0.09069988131523132, -0.19433382153511047, 0.2883608937263489, -0.18880221247673035, 0.18200966715812683, 0.19256022572517395, 0.07044591009616852, 0.09070802479982376, -0.008811005391180515, 0.03812939673662186, -0.3135816156864166, 0.13838575780391693, -0.008798670023679733, -0.30350762605667114, -0.24206972122192383, -0.024927781894803047, -0.1913384050130844, -0.1210884377360344, 0.26293879747390747, -0.12465265393257141, 0.16856101155281067, -0.028077028691768646, 0.00017094863869715482, -0.03729983791708946, 0.05111610144376755, 0.27113011479377747, 0.04541436582803726, 0.07296212762594223, -0.35543128848075867, -0.05049087479710579, -0.23318436741828918, 0.02037670463323593, -0.2132178694009781, -0.09123275429010391, -0.21403634548187256, 0.0730811208486557, -0.09439391642808914, -0.07122819870710373, -0.12593020498752594, 0.3163154423236847, -0.05224480852484703, 0.30042505264282227, 0.14139001071453094, 0.051461584866046906, 0.000348247674992308, -0.030076054856181145, -0.08295455574989319, -0.07495563477277756, 0.022713491693139076, -0.08730287849903107, 0.30827051401138306, -0.3672492206096649, -0.08670658618211746, -0.05488822981715202, -0.044400524348020554, 0.16943952441215515, -0.03359796851873398, -0.13688527047634125, -0.3314380347728729, 0.025855204090476036, -0.1064949557185173, -0.03657698258757591, 0.05538726598024368, 0.05535347759723663, -0.08029805123806, -0.22581718862056732, 0.17158254981040955, -0.09587027132511139, -0.16455747187137604, -0.21586726605892181, -0.08198977261781693, 0.10887038707733154, -0.02826778218150139, 0.05199790000915527, -0.051973383873701096, 0.08498714864253998, 0.07862447947263718, -0.010773740708827972, 0.1652131974697113, -0.14043737947940826, -0.2049281895160675, -0.07305586338043213, 0.04769162833690643, -0.013090411201119423, -0.07326364517211914, -0.244798481464386, 0.007565848529338837, -0.07716664671897888, -0.13699084520339966, 0.004582305438816547, 0.186128169298172, -0.2035023272037506, -0.02695167437195778, 0.0786936804652214, -0.0221540667116642, 0.2380436211824417, 0.042396727949380875, 0.06062149628996849, -0.03619661554694176, 0.24575714766979218, -0.04861441254615784, 0.09260261058807373, 0.10023125261068344, -0.02582240290939808, 0.059026915580034256, -0.13708539307117462, 0.09705833345651627, -0.12864848971366882, 0.13338197767734528, -0.19689145684242249, 0.09203407168388367, 0.1672217696905136, 0.18901337683200836, 0.12793156504631042, -0.12251906096935272, 0.05061154067516327, -0.3872304856777191, -0.11884240061044693, 0.02658187970519066, 0.0828818753361702, 0.25742074847221375, 0.022128410637378693, 0.27795514464378357, 0.055468540638685226, 0.17247597873210907, 0.09887140989303589, 0.15298637747764587, 0.19133280217647552, 0.10003788024187088, -0.033495593816041946, 0.10955148190259933, -0.01351258810609579, 0.2055136114358902, -0.011102776043117046, 0.10631188005208969, -0.005912031512707472, -0.17682254314422607, 0.04044552147388458, 0.11112483590841293, -0.1634172648191452, 0.10549365729093552, -0.13660338521003723, 0.11414781212806702, -0.09034090489149094, 0.10038327425718307, 0.09564746916294098, -0.015748705714941025, -0.18478599190711975, 0.02035640925168991, -0.08025737851858139, 0.14563855528831482, 0.03789679706096649, -0.004304538015276194, -0.0856274962425232, -0.0016568232094869018, 0.37139642238616943, 0.0988641232252121, -0.0607888400554657, -0.11283931136131287, 0.12755979597568512, 0.024431604892015457, 0.008886704221367836, 0.27094802260398865, 0.13813664019107819, -0.12156885117292404, -0.08527755737304688, -0.000893916585482657, 0.09820368140935898, 0.17398318648338318, 0.02444722317159176, 0.010096759535372257, -0.01300622895359993, -0.20267026126384735, 0.16764463484287262, 0.10791558772325516, -0.03919697552919388, -0.06775055825710297, 0.0969560295343399, 0.1594720035791397, -0.03709592670202255, -0.13143643736839294, -0.19205382466316223, 0.0005143966409377754, 0.07595964521169662, 0.05583454295992851, 0.08506960421800613, 0.17308224737644196, -0.12595553696155548, -0.09447240084409714, 0.13932360708713531, -0.03995446860790253, -0.052211347967386246, -0.22986264526844025, -0.1897081881761551, 0.0334235355257988, -0.018946101889014244, 0.21608249843120575, 0.19361691176891327, 0.0915881097316742, -0.14912523329257965, 0.25982993841171265, 0.12400050461292267, 0.18621833622455597, -0.044829197227954865, -0.032360922545194626, -0.2528952956199646, 0.005232776515185833, 0.005999214481562376, -0.1261308491230011, 0.11093204468488693, -0.08999104797840118, 0.17359241843223572, -0.11957413703203201, -0.021271735429763794, -0.09422652423381805, 0.0690985843539238, -0.11514871567487717, -0.10207948088645935, 0.11103454977273941, -0.14523649215698242, -0.134368434548378, -0.14152991771697998, -0.11761666089296341, 0.042030517011880875, 0.3018609285354614, -0.2018263190984726, 0.0869087278842926, 0.04178682342171669, -0.018422367051243782, 0.09283977001905441, -0.0802871510386467, 0.10164351761341095, 0.1331268697977066, -0.03522999957203865, 0.11747036129236221, -0.03474714979529381, 0.19123868644237518, -0.030286679044365883, 0.139678955078125, -0.1524486094713211, -0.10141020268201828, 0.07243507355451584, -0.0795736312866211, 0.054053522646427155, -0.12092237174510956, 0.03981342911720276, -0.04171481356024742, 0.12297134846448898, -0.11833572387695312, 0.29948562383651733, 0.012135548517107964, -0.19795921444892883, 0.05041753500699997, -0.2621016502380371, -0.04791970178484917, 0.14240537583827972, -0.02009245567023754, 0.139102041721344, 0.06540273129940033, -0.2295083999633789, -0.08915158361196518, 0.04793986678123474, 0.2778705656528473, 0.03769480437040329, 0.15901853144168854, -0.23394612967967987, 0.04390851780772209, 0.06846097111701965, 0.039384908974170685, -0.06523463875055313, 0.14726229012012482, 0.3135741949081421, 0.1063009575009346, -0.13586103916168213, -0.05192027986049652, -0.19110172986984253, 0.08650927990674973, 0.08019496500492096, 0.23113243281841278, 0.09554461389780045, 0.198858380317688, -0.035555414855480194, -0.44486004114151, -0.06308048218488693, 0.06649316102266312, -0.004151504952460527, -0.013457025401294231, 0.11027359217405319, 0.056972432881593704, -0.04172258824110031, -0.04608483612537384, 0.0931631326675415, -0.02959008328616619, 0.2758116126060486, 0.054144591093063354, -0.25739994645118713, 0.15321606397628784, 0.1778745949268341, 0.009863889776170254], [0.14174343645572662, -0.26805952191352844, 0.013887094333767891, -0.22339390218257904, -0.2009863555431366, -0.09501975029706955, 0.20531882345676422, -0.008983314968645573, -0.09002432227134705, -0.18585312366485596, -0.06977558881044388, 0.37321820855140686, -0.11229031533002853, 0.22731462121009827, 0.29250335693359375, 0.15975947678089142, -0.014289372600615025, -0.11380643397569656, 0.002528571058064699, 0.08649615198373795, 0.01178754772990942, 0.061615437269210815, 0.02223934791982174, -0.2680796980857849, 0.0010700378334149718, -0.287200003862381, -0.020152660086750984, -0.06467388570308685, -0.05466047674417496, 0.2129894644021988, 0.2758200764656067, 0.1588669717311859, -0.08706817775964737, -0.06932996958494186, -0.37576255202293396, -0.07450029253959656, 0.05693034082651138, -0.0029905331321060658, 0.1411968171596527, -0.024750158190727234, 0.031213754788041115, 0.02488362044095993, 0.1614326685667038, 0.2589409053325653, -0.06596618890762329, 0.018862569704651833, -0.348310261964798, -0.1479804664850235, -0.10081706941127777, 0.08014349639415741, -0.0753435268998146, -0.07301672548055649, 0.2630215287208557, -0.0431654192507267, 0.09342902898788452, 0.3856809139251709, -0.03444499522447586, -0.40111422538757324, -0.11767980456352234, -0.07591694593429565, -0.1645815670490265, 0.009595233015716076, -0.6157322525978088, 0.03173195943236351, -0.04666375741362572, -0.08645079284906387, 0.20718377828598022, -0.18620918691158295, 0.008717007003724575, 0.15902255475521088, -0.07236257940530777, -0.0051783667877316475, 0.041552718728780746, 0.09821592271327972, 0.16112585365772247, 0.023024801164865494, 0.14246228337287903, -0.14410752058029175, -0.07846860587596893, 0.1105196475982666, -0.23413632810115814, 0.20118556916713715, -0.2572183609008789, 0.18613682687282562, 0.13524729013442993, -0.0021956544369459152, 0.25718459486961365, 0.05940280482172966, 0.10524860769510269, 0.10372912883758545, 0.07023592293262482, -0.03149447217583656, 0.014956614933907986, -0.10098588466644287, 0.06994170695543289, 0.13947860896587372, 0.004307958763092756, 0.06315195560455322, 0.04936543107032776, -0.09879142045974731, -0.03729091212153435, -0.18471282720565796, 0.06091040372848511, 0.11348053812980652, 0.0017455262131989002, -0.2128678411245346, -0.18289360404014587, -0.10307294875383377, -0.03120625950396061, -0.18372799456119537, -0.1413097232580185, -0.07475142925977707, -0.13564647734165192, -0.04063164442777634, -0.061712440103292465, 0.013797649182379246, 0.09354723244905472, 0.0021877845283597708, -0.3250068724155426, 0.15589016675949097, -0.07963351905345917, -0.06542512029409409, -0.1492585688829422, 0.16887915134429932, 0.21559637784957886, -0.12106659263372421, 0.2154795229434967, 0.07790838181972504, 0.19690531492233276, -0.050556428730487823, -0.4188229441642761, 0.1724826544523239, -0.24354393780231476, 0.025881454348564148, 0.10289079695940018, -0.1342383474111557, 0.19128213822841644, -0.08231225609779358, -0.13004569709300995, 0.28584983944892883, 0.20469729602336884, 0.17266565561294556, -0.17955169081687927, 0.2641579806804657, 0.03531615436077118, -0.1712053269147873, -0.027806788682937622, 0.4054342210292816, -0.13298532366752625, 0.05666395276784897, 0.2974778711795807, -0.154632568359375, -0.1644304245710373, -0.052582982927560806, 0.013611110858619213, 0.11774258315563202, -0.02894366905093193, -0.04237760603427887, -0.0037295615766197443, 0.017274273559451103, -0.095379538834095, -0.1276935636997223, 0.22176001965999603, -0.12387468665838242, 0.1107272356748581, 0.030825175344944, 0.1433326154947281, 0.09122658520936966, -0.20564335584640503, -0.13733616471290588, -0.04332774132490158, 0.06510521471500397, 0.06352925300598145, -0.0034986999817192554, -0.11035541445016861, 0.22034455835819244, 0.03822650760412216, -0.033063314855098724, 0.011995496228337288, 0.07164683938026428, -0.08630628883838654, 0.023200560361146927, -0.15411652624607086, -0.12981759011745453, -0.12372184544801712, 0.08477362245321274, -0.04278358817100525, 0.10971978306770325, 0.11590240895748138, 0.34976711869239807, 0.0022998263593763113, -0.19290684163570404, 0.1674065738916397, -0.02105751261115074, 0.042425576597452164, 0.0018480574944987893, 0.1550706923007965, -0.17398375272750854, 0.3498992621898651, -0.3126879334449768, -0.06520184874534607, 0.0011530912015587091, 0.006856035441160202, 0.042481787502765656, 0.07437275350093842, 0.09863719344139099, 0.016564976423978806, 0.016744324937462807, 0.013868781737983227, -0.07825063914060593, -0.03641834482550621, -0.04428616538643837, -0.06201304495334625, -0.05827849730849266, 0.028317766264081, 0.11564850062131882, 0.07306747883558273, 0.05721213296055794, -0.06067532300949097, 0.3714931309223175, -0.10461920499801636, -0.02550508826971054, -0.04546928033232689, -0.12915582954883575, -0.029027510434389114, -0.0277240127325058, 0.09549155831336975, -0.10339438915252686, -0.0018255200702697039, 0.06699840724468231, 0.08338746428489685, 0.05223948508501053, -0.07085520774126053, -0.26020383834838867, -0.1201508566737175, 0.2977644205093384, -0.12213306874036789, 0.07283910363912582, 0.09246134757995605, 0.09899311512708664, -0.31536734104156494, 0.014495466835796833, -0.16096115112304688, 0.06989968568086624, 0.01919304020702839, 0.039906639605760574, 0.025172855705022812, 0.11543845385313034, -0.039184678345918655, -0.010151618160307407, 0.09029622375965118, 0.035830579698085785, 0.06775511056184769, 0.031143706291913986, -0.21641694009304047, 0.00784517265856266, -0.05926113203167915, 0.037641290575265884, 0.11505745351314545, 0.05628212168812752, -0.18274131417274475, 0.06055677682161331, -0.14219528436660767, 0.014098124578595161, -0.045927803963422775, 0.164580836892128, -0.15833601355552673, 0.03343368321657181, -0.14627182483673096, 0.2911485433578491, -0.0023537473753094673, -0.22572679817676544, 0.14201422035694122, 0.03118833899497986, -0.006268207915127277, -0.2726592421531677, 0.06919492036104202, -0.06542152911424637, -0.16997100412845612, -0.14905326068401337, -0.12251757830381393, -0.14268538355827332, -0.06251607090234756, -0.1996864378452301, -0.04474511742591858, 0.13812212646007538, 0.08032405376434326, 0.028428416699171066, -0.1840772032737732, 0.14334289729595184, 0.18430979549884796, -0.03345031663775444, 0.11796008795499802, -0.14993762969970703, 0.05860092118382454, -0.025069013237953186, 0.11639755964279175, -0.15425948798656464, 0.09410218149423599, 0.10054472088813782], [-0.11813821643590927, 0.026385243982076645, -0.09131253510713577, 0.11143825948238373, 0.006566512398421764, -0.11100905388593674, -0.08413033187389374, -0.014608600176870823, -0.05227276682853699, -0.07242307811975479, 0.02198426052927971, -0.23753929138183594, -0.01422941219061613, 0.17445605993270874, -0.0502360574901104, 0.19941967725753784, -0.04966491088271141, -0.34056854248046875, 0.030398184433579445, -0.07857447862625122, -0.15904639661312103, 0.17253988981246948, 0.21029897034168243, -0.35888946056365967, -0.2502255141735077, 0.12397821992635727, 0.10206793248653412, -0.009703757241368294, 0.04375085607171059, -0.11189960688352585, 0.045594725757837296, 0.12023050338029861, -0.06502785533666611, -0.0904422402381897, -0.06517447531223297, -0.04001589119434357, 0.13119858503341675, 0.2104722112417221, 0.0006709677982144058, -0.11703132838010788, -0.11612846702337265, -0.08663806319236755, -0.150064617395401, -0.02462383359670639, 0.047689344733953476, 0.06328634917736053, 0.07870061695575714, -0.05764331668615341, 0.00807587057352066, 0.2814875841140747, -0.20864903926849365, 0.026357289403676987, -0.07221580296754837, -0.1032206192612648, -0.09170038998126984, 0.21887782216072083, 0.006160614546388388, 0.003027636092156172, -0.19714613258838654, -0.1511608064174652, -0.13798871636390686, -0.05629459768533707, -0.17072393000125885, -0.42074304819107056, -0.09097222238779068, -0.027005430310964584, 0.03385339677333832, -0.03488937392830849, 0.21075622737407684, -0.14936323463916779, 0.23152613639831543, -0.2732369303703308, -0.1569141447544098, 0.07340128719806671, 0.050666920840740204, 0.20426206290721893, 0.06863842159509659, -0.1021292582154274, 0.13583441078662872, 0.060245271772146225, -0.18127714097499847, 0.08742275834083557, -0.3054211437702179, -0.13991963863372803, -0.24388062953948975, 0.2046830654144287, -0.42505720257759094, -0.11788114160299301, -0.07098674029111862, 0.12690851092338562, -0.0795791745185852, 0.36023184657096863, 0.011398492380976677, -0.061468690633773804, 0.07147626578807831, -0.028008833527565002, 0.09644739329814911, -0.1965665966272354, 0.23069298267364502, 0.04657505825161934, -0.07103734463453293, 0.17501811683177948, 0.24439556896686554, 0.31180909276008606, 0.2153063714504242, -0.11582262814044952, 0.22527717053890228, 0.029700234532356262, 0.25682342052459717, -0.07507351040840149, 0.45157527923583984, 0.1590535044670105, 0.023106783628463745, -0.13609060645103455, 0.28906601667404175, -0.02398744970560074, -0.13989517092704773, 0.34810397028923035, -0.06724373251199722, 0.15266962349414825, -0.07759557664394379, -0.13209378719329834, -0.09897056221961975, 0.09525012224912643, -0.45148730278015137, 0.13286833465099335, -0.10782399773597717, 0.2608385384082794, 0.2090066820383072, 0.44349205493927, 0.15630994737148285, 0.3586680591106415, 0.10216041654348373, -0.035813745111227036, 0.07150251418352127, -0.11340966820716858, -0.04815216735005379, -0.5660202503204346, 0.09614523500204086, 0.30437180399894714, 0.13951553404331207, 0.19638687372207642, 0.009647361934185028, -0.2147238701581955, -0.22026808559894562, 0.2420261949300766, -0.3924524188041687, 0.25406599044799805, -0.04179835692048073, 0.31124842166900635, 0.15027987957000732, 0.09907811135053635, 0.46211525797843933, -0.18215501308441162, -0.04352094978094101, 0.21915630996227264, 0.014945530332624912, 0.16630128026008606, 0.1446143388748169, 0.12205632030963898, 0.052234847098588943, 0.08658979088068008, -0.23013053834438324, 0.30691495537757874, 0.009259724989533424, 0.07690064609050751, -0.34827306866645813, 0.24903830885887146, 0.030737202614545822, 0.38859114050865173, -0.13763144612312317, 0.007913227193057537, -0.5194437503814697, -0.08484215289354324, -0.08905038982629776, -0.06733305007219315, -0.11896639317274094, 0.24513670802116394, 0.04562301188707352, 0.09978442639112473, -0.17911429703235626, -0.07200252264738083, -0.2640588581562042, 0.2682133913040161, 0.015102526172995567, 0.13498607277870178, 0.029895424842834473, 0.29204973578453064, -0.011133193969726562, 0.07564955204725266, -0.18358145654201508, -0.3186109662055969, 0.18534623086452484, 0.026210542768239975, -0.2798701524734497, -0.018133409321308136, 0.2659243047237396, -0.17482872307300568, -0.254028856754303, -0.3188427686691284, 0.025967199355363846, 0.17168337106704712, 0.00588049553334713, 0.31924760341644287, 0.20075678825378418, 0.28098800778388977, 0.07874809950590134, 0.10833980143070221, 0.21272532641887665, 0.005371597595512867, -0.07366742193698883, -0.13411609828472137, -0.16393490135669708, 0.09344722330570221, 0.1561792492866516, -0.10325198620557785, -0.02188725583255291, 0.358473002910614, 0.06745143234729767, 0.12793798744678497, 0.03454319387674332, -0.13574765622615814, 0.22930127382278442, -0.34264764189720154, 0.2343430519104004, -0.2982369661331177, 0.06882679462432861, 0.025008417665958405, 0.036167893558740616, -0.060938410460948944, -0.27416834235191345, -0.033383287489414215, -0.03716936707496643, -0.12988416850566864, -0.09795812517404556, 0.01692854054272175, -0.17337898910045624, 0.09592097997665405, 0.1701388657093048, 0.00524261174723506, 0.06825042515993118, 0.20232725143432617, 0.0054228766821324825, 0.23175503313541412, -0.0400465652346611, -0.14826588332653046, -0.29754140973091125, 0.23043599724769592, 0.10477728396654129, -0.15342926979064941, 0.10466501116752625, 0.08245169371366501, -0.17295297980308533, -0.08122316002845764, 0.04733944311738014, 0.24061504006385803, 0.03086012601852417, -0.07203052937984467, 0.282115638256073, -0.06002816557884216, -0.0026012652087956667, -0.05989665165543556, 0.26869669556617737, 0.06133941560983658, 0.030635060742497444, -0.11620816588401794, 0.052208349108695984, 0.0584673248231411, 0.039941415190696716, -0.05782650411128998, 0.15806055068969727, 0.10874234884977341, 0.1268652081489563, -0.050741273909807205, -0.3016437292098999, 0.4293695092201233, -0.2623891830444336, 0.30703970789909363, 0.10811818391084671, 0.11764007806777954, -0.013292822055518627, 0.3017604649066925, -0.03216555714607239, 0.10952470451593399, -0.15809009969234467, 0.05473675578832626, -0.027571113780140877, 0.10019043833017349, -0.005694285035133362, -0.07353615015745163, -0.04599310830235481, -0.2493337094783783, -0.012346187606453896, 0.11685926467180252, 0.20667478442192078, -0.03807869181036949, 0.03782813251018524, 0.004086245317012072, 0.055505167692899704, 0.23339833319187164], [-0.012422297149896622, 0.29375484585762024, -0.08529049903154373, -0.041497085243463516, -0.23923207819461823, -0.010903369635343552, 0.22849971055984497, -0.11931881308555603, 0.0019414785783737898, 0.15519899129867554, 0.14578653872013092, 0.2182670533657074, 0.015422762371599674, -0.2505931556224823, -0.02395840547978878, -0.06658736616373062, -0.07797715067863464, -0.036988209933042526, -0.03703633323311806, 0.15228460729122162, -0.1404404491186142, -0.04150562733411789, 0.12458442896604538, -0.060223158448934555, 0.19916515052318573, -0.06604398041963577, -0.0677323043346405, 0.0251995250582695, 0.08265388756990433, 0.07402241230010986, -0.23104578256607056, 0.04159457981586456, -0.0018853441579267383, 0.11597882956266403, -0.253039687871933, 0.2743415832519531, -0.09213485568761826, 0.1005222275853157, -0.048700060695409775, 0.14242376387119293, 0.07364130765199661, -0.04494564235210419, -0.008084424771368504, 0.265632301568985, -0.1339545100927353, 0.07311525195837021, -0.27264559268951416, 0.23169687390327454, -0.3035423457622528, 0.00412026746198535, 0.16403503715991974, 0.014327718876302242, 0.27161532640457153, 0.14414866268634796, 0.3455081582069397, -0.15624842047691345, 0.07091276347637177, -0.10879440605640411, 0.06639451533555984, -0.06104080379009247, -0.006527377758175135, 0.19850927591323853, 0.21060974895954132, 0.24643640220165253, -0.1087859719991684, 0.19807648658752441, 0.11402497440576553, 0.09418807178735733, 0.021202439442276955, -0.29458507895469666, 0.18692752718925476, -0.03769486024975777, -0.054151423275470734, -0.14242616295814514, 0.15565459430217743, -0.02477271668612957, 0.1218288317322731, 0.04766067862510681, 0.09951137751340866, -0.24250242114067078, -0.016397934406995773, 0.14204798638820648, -0.10523585230112076, -0.10740891844034195, 0.06274982541799545, -0.11271815747022629, 0.14339713752269745, -0.11661927402019501, 0.13452289998531342, -0.054552704095840454, -0.05727763846516609, -0.2434757798910141, -0.048089273273944855, 0.06122675910592079, 0.20783022046089172, 0.29036763310432434, -0.046482570469379425, 0.11451396346092224, 0.23526617884635925, 0.23130525648593903, -0.23084372282028198, -0.08382511883974075, -0.08042488247156143, 0.06738604605197906, -0.1757562756538391, -0.30910032987594604, -0.25496721267700195, -0.0875297486782074, 0.0752321109175682, -0.24952873587608337, 0.0013509002747014165, -0.029284775257110596, -0.01008441299200058, -0.21635359525680542, 0.016913194209337234, 0.09686101227998734, -0.2928791046142578, -0.01816989853978157, -0.14978982508182526, 0.20742590725421906, 0.014947901479899883, 0.14295989274978638, 0.24897408485412598, 0.09962092339992523, -0.14644283056259155, -0.057931698858737946, -0.26653358340263367, 0.07377392798662186, 0.2845645248889923, -0.41700583696365356, -0.6862183809280396, 0.20995831489562988, 0.08532439917325974, 0.20972421765327454, -0.024859700351953506, 0.2732725739479065, -0.10593681782484055, 0.14989309012889862, -0.29883691668510437, -0.14084409177303314, -0.04532879963517189, 0.031229330226778984, -0.36408793926239014, 0.14988315105438232, -0.03813423961400986, 0.15458537638187408, -0.1841912567615509, 0.26633933186531067, 0.10214605927467346, -0.12234658002853394, 0.009622089564800262, -0.08263300359249115, 0.006941486615687609, 0.07916359603404999, 0.07457196712493896, -0.04344270005822182, 0.09008494764566422, 0.030353957787156105, 0.06883197277784348, 0.14614321291446686, 0.10792993754148483, 0.02384268492460251, -0.14376653730869293, -0.363793283700943, -0.21885471045970917, -0.00359161663800478, -0.06081230938434601, 0.14469552040100098, 0.12261966615915298, -0.05673858895897865, 0.052547238767147064, -0.13262733817100525, -0.0024201159831136465, 0.17304298281669617, -0.02869882807135582, -0.166396826505661, -0.005931515712291002, -0.17751534283161163, 0.06532115489244461, -0.02821895107626915, -0.12206266075372696, 0.12147166579961777, 0.08057726919651031, -0.05336318910121918, 0.11061004549264908, 0.0680881068110466, -0.16174069046974182, -0.07363688200712204, 0.11896485090255737, -0.10885133594274521, 0.05419183894991875, 0.28626343607902527, 0.2907501757144928, -0.034051746129989624, 0.1658278852701187, 0.2119457721710205, 0.21776308119297028, 0.3243577480316162, 0.45183926820755005, 0.20268243551254272, 0.2430378943681717, -0.1563924103975296, -0.08389218896627426, -0.2910611629486084, 0.27687153220176697, -0.16164277493953705, 0.11778994649648666, -0.06526949256658554, -0.08173181861639023, -0.028627589344978333, -0.041293367743492126, 0.13649439811706543, -0.08702903240919113, 0.1102813258767128, -0.02713138610124588, -0.009916064329445362, 0.32724621891975403, -0.26089292764663696, -0.0733274295926094, -0.15208598971366882, 0.0005577871343120933, -0.03487097844481468, 0.10207834094762802, 0.12364618480205536, 0.19079603254795074, 0.10148392617702484, 0.2118789404630661, -0.0234580896794796, -0.09876998513936996, 0.3232055902481079, 0.07849818468093872, -0.23266419768333435, 0.09638597071170807, -0.14529600739479065, 0.32257741689682007, 0.16594646871089935, 0.05420710891485214, -0.1958519071340561, 0.0062829311937093735, -0.0624721460044384, -0.4278043508529663, -0.1481712907552719, -0.05627473443746567, -0.4863467812538147, -0.10742049664258957, -0.04185302555561066, 0.0058380067348480225, 0.06824000179767609, -0.1445058137178421, 0.2829072177410126, 0.10394115746021271, 0.3182697594165802, 0.04837499186396599, 0.08933756500482559, -0.2624964118003845, 0.02059103734791279, -0.031778354197740555, 0.04873228818178177, -0.07419008016586304, 0.04297706484794617, -0.15826645493507385, 0.2446269690990448, -0.058739855885505676, -0.03752908483147621, 0.14952097833156586, -0.016197195276618004, 0.044069163501262665, 0.0016798607539385557, -0.06078587472438812, -0.07291264086961746, 0.23641414940357208, -0.014659569598734379, 0.02288731560111046, -0.02950514294207096, -0.08907561004161835, -0.20637722313404083, 0.18494850397109985, -0.362022340297699, -0.04638703912496567, 0.03845115751028061, 0.2869334816932678, -0.12250670045614243, -0.1400456577539444, 0.2306123822927475, 0.004925824701786041, 0.19140669703483582, 0.2121870517730713, 0.16029669344425201, -0.332507848739624, -0.04594311863183975, 0.16064153611660004, 0.05034464970231056, -0.026515068486332893, 0.12943193316459656, 0.2559870779514313, -0.1765051931142807, -0.21906590461730957, 0.22128655016422272, -0.4314082860946655, -0.16179056465625763], [-0.07018021494150162, 0.10825317353010178, 0.18253114819526672, 0.1720021665096283, -0.026654966175556183, 0.24142640829086304, 0.1747043877840042, 0.07573628425598145, 0.024183345958590508, -0.07543665915727615, 0.11623787134885788, -0.09494009613990784, -0.10909409075975418, -0.07777230441570282, -0.12354400753974915, -0.15804055333137512, -0.08820851892232895, 0.1629435420036316, 0.06097292900085449, 0.046890635043382645, 0.07191016525030136, 0.07936539500951767, -0.08713092654943466, 0.01185742300003767, 0.08017213642597198, -0.07003530859947205, -0.05127155780792236, -0.18775644898414612, -0.04006396606564522, -0.23132717609405518, -0.08845303952693939, -0.22929638624191284, 0.10270801931619644, 0.17700998485088348, 0.24661782383918762, -0.03950178995728493, -0.03070990741252899, -0.009136735461652279, 0.08453498035669327, -0.13045085966587067, -0.022603467106819153, -0.04436293989419937, -0.021123047918081284, 0.06916321069002151, -0.09752748906612396, -0.025690216571092606, -0.03625229001045227, -0.05908721312880516, 0.011829215101897717, 0.054596222937107086, -0.08616616576910019, 0.2055717259645462, -0.041840799152851105, 0.10432875901460648, 0.034551896154880524, -0.23083357512950897, 0.03648228570818901, 0.1023278459906578, 0.008130320347845554, 0.061660293489694595, 0.14020930230617523, -0.04059409722685814, 0.16842034459114075, -0.14150075614452362, 0.3282013237476349, -0.015054266899824142, -0.0764155387878418, 0.20034034550189972, 0.02737085148692131, 0.09731407463550568, 0.015603536739945412, 0.23476141691207886, 0.15253125131130219, 0.023340294137597084, -0.049196917563676834, 0.2937432527542114, -0.15986451506614685, 0.10491489619016647, 0.07126078754663467, 0.0842171460390091, -0.0018454488599672914, 0.010148424655199051, -0.07288104295730591, -0.1668458878993988, 0.1525210589170456, 0.03645516559481621, 0.11588048934936523, -0.0757579430937767, -0.016614146530628204, -0.014040309935808182, 0.0868859812617302, 0.08902577310800552, -0.04260815307497978, -0.001682807458564639, 0.03922296315431595, 0.0839289203286171, 0.05800282955169678, 0.045341793447732925, 0.0022491123527288437, -0.18384329974651337, 0.12514947354793549, 0.1666722297668457, -0.033633407205343246, 0.11930505186319351, 0.16751839220523834, 0.04650501534342766, 0.004633164964616299, -0.06801964342594147, -0.2503627836704254, 0.13689270615577698, -0.12534448504447937, 0.013492693193256855, -0.11800259351730347, 0.0916300043463707, 0.08002470433712006, -0.061375025659799576, 0.026758402585983276, 0.16754049062728882, 0.2476719319820404, -0.017531564459204674, 0.05535970628261566, 0.14687049388885498, -0.19785383343696594, 0.07698411494493484, -0.16608037054538727, 0.18475089967250824, -0.12993675470352173, -0.03655632957816124, -0.20926491916179657, 0.02146998979151249, 0.1919320523738861, 0.09562277793884277, -0.2004135400056839, 0.19553163647651672, 0.1625286489725113, 0.02516588382422924, 0.03881867602467537, 0.19975903630256653, 0.1559855192899704, -0.15651652216911316, -0.20846779644489288, -0.015550163574516773, -0.02248760312795639, -0.030194120481610298, -0.0028666674625128508, -0.10177846997976303, 0.055489808320999146, -0.3711562156677246, 0.18327322602272034, 0.07290926575660706, -0.10616288334131241, -0.00039705060771666467, 0.003790768561884761, -0.0273379348218441, 0.11170391738414764, -0.08933674544095993, -0.027818407863378525, 0.10259852558374405, -0.2462981939315796, -0.18694902956485748, 0.03287000209093094, 0.22330191731452942, 0.007264964748173952, 0.018126754090189934, 0.057551003992557526, -0.2871067225933075, 0.033153850585222244, -0.1481323540210724, -0.20130398869514465, 0.18039147555828094, -0.005432622041553259, 0.03496798500418663, -0.035600535571575165, 0.06350304186344147, 0.22864693403244019, 0.008646868169307709, 0.20855712890625, -0.12775953114032745, 0.035499848425388336, -0.1209445521235466, -0.18781018257141113, 0.19667628407478333, 0.039547618478536606, -0.03770113363862038, 0.06994763016700745, -0.013759056106209755, 0.14490433037281036, -0.0048010582104325294, -0.09825467318296432, -0.059079743921756744, 0.2898175120353699, 0.030626216903328896, -0.12033410370349884, 0.0407121442258358, 0.03384258598089218, 0.12932400405406952, -0.0270528681576252, -0.025176459923386574, -0.10773459076881409, 0.03876097872853279, -0.015461120754480362, 0.018110552802681923, -0.08499748259782791, -0.1732255071401596, -0.052959319204092026, 0.0706271380186081, -0.007941960357129574, -0.031436674296855927, 0.00618489645421505, -0.07570736855268478, -0.06966467201709747, -0.16619279980659485, 0.03677218407392502, 0.08247678726911545, -0.020524241030216217, 0.1630137860774994, -0.009187841787934303, -0.08973890542984009, 0.1283242255449295, -0.016094166785478592, 0.017822032794356346, -0.08847170323133469, -0.2462518811225891, 0.03241721913218498, 0.0659114420413971, -0.1086016595363617, -0.02701347880065441, 0.16510692238807678, -0.05521323159337044, 0.08452726155519485, -0.13964879512786865, -0.04192543029785156, -0.017149310559034348, 0.09967806190252304, 0.02590123564004898, -0.0584210641682148, 0.12527377903461456, -0.07874436676502228, 0.2290566861629486, 0.09032784402370453, -0.11792643368244171, 0.03313760831952095, -0.024901829659938812, 0.11098777502775192, 0.25957968831062317, -0.07764419913291931, -0.10810580104589462, -0.15072956681251526, -0.02445010282099247, 0.1278517246246338, -0.17221146821975708, -0.05339809134602547, -0.19121213257312775, -0.2562018930912018, 0.016859589144587517, -0.1595432311296463, 0.11673888564109802, -0.004906702321022749, -0.1331719607114792, -0.03701598942279816, 0.22649529576301575, 0.08832632750272751, -0.2666691541671753, 0.04406667873263359, -0.10755137354135513, -0.04258041828870773, 0.20059610903263092, -0.046427737921476364, -0.0006095244316384196, 0.2814158797264099, -0.3894155025482178, -0.1647675484418869, 0.022859005257487297, 0.2971033751964569, 0.34442609548568726, -0.034042149782180786, 0.0712801069021225, -0.12389571219682693, -0.16694216430187225, -0.06658373028039932, 0.17267630994319916, 0.1095927432179451, -0.10698597878217697, -0.040253933519124985, -0.06727836281061172, -0.049755193293094635, -0.10125808417797089, -0.10844744741916656, -0.025514502078294754, 0.0859542116522789, -0.1416470855474472, -0.06715171039104462, -0.044462136924266815, 0.13552069664001465, -0.18571071326732635, 0.0797029435634613, 0.02864123322069645, -0.014591730199754238, 0.20435748994350433, 0.09497930854558945], [0.045872218906879425, 0.21984578669071198, -0.10341405123472214, 0.07052988559007645, -0.07091645151376724, 0.1833837330341339, 0.16512645781040192, 0.12979459762573242, 0.12737144529819489, 0.1483498364686966, -0.04834737256169319, 0.032927241176366806, -0.2664901316165924, -0.008562671020627022, -0.08894399553537369, 0.014176787808537483, -0.14596420526504517, -0.04478677362203598, -0.13646595180034637, -0.032170943915843964, 0.021643562242388725, 0.20320571959018707, -0.14025434851646423, 0.01921277493238449, -0.14903368055820465, -0.13001945614814758, 0.08409927785396576, 0.13695085048675537, -0.08101772516965866, 0.058287132531404495, 0.03363271430134773, -0.01882789097726345, 0.00014816199836786836, -0.03083893284201622, 0.1319635659456253, -0.016036994755268097, -0.10116048902273178, -0.12729761004447937, 0.059429023414850235, -0.033443618565797806, 0.09057322889566422, -0.01660972833633423, -0.11301041394472122, 0.18637007474899292, 0.11756379157304764, -0.029117299243807793, -0.011412403546273708, 0.04734943434596062, -0.011245199479162693, -0.07699103653430939, 0.0966155156493187, -0.08173682540655136, 0.049730367958545685, 0.03069755621254444, -0.005108514800667763, -0.14079536497592926, -0.05009269341826439, 0.01873372495174408, 0.24226504564285278, -0.09915035218000412, 0.38552507758140564, -0.14090503752231598, 0.07603418081998825, 0.026883281767368317, 0.23130257427692413, 0.009402206167578697, 0.029803864657878876, -0.009827136993408203, -0.07037105411291122, -0.17508450150489807, -0.012443571351468563, -0.10372578352689743, -0.04848003014922142, -0.053464777767658234, 0.2099703848361969, 0.07139988243579865, -0.11546917259693146, 0.1912073791027069, -0.07824365049600601, 0.06743008643388748, -0.010307978838682175, -0.13384483754634857, -0.21515046060085297, -0.12214720994234085, -0.17243048548698425, 0.027396028861403465, -0.1930903047323227, -0.17439059913158417, -0.1753905564546585, -0.2089523822069168, 0.08757007122039795, -0.051547545939683914, 0.04933730140328407, 0.09786824136972427, -0.18873468041419983, 0.14247484505176544, 0.16699287295341492, -0.2491547167301178, -0.08123543858528137, -0.006257802248001099, -0.30072909593582153, 0.014733539894223213, 0.07875341922044754, -0.33581334352493286, -0.4739215075969696, 0.02311050146818161, 0.20307359099388123, -0.14673928916454315, -0.08013074100017548, -0.0857444778084755, 0.07228024303913116, 0.05346028879284859, 0.07281167805194855, 0.004081910941749811, 0.1223669946193695, 0.233756422996521, 0.03680017217993736, -0.19845522940158844, 0.10375671088695526, -0.09212016314268112, 0.0156217897310853, -0.11943259835243225, -0.08542249351739883, -0.07379209995269775, -0.22312894463539124, -0.08444669097661972, -0.46819835901260376, 0.05942105874419212, -0.08862484991550446, -0.1116982251405716, 0.03111260198056698, -0.07680416107177734, -0.016601942479610443, -0.04097869619727135, 0.11934029310941696, -0.12532351911067963, -0.09370873868465424, 0.222494438290596, 0.008627044036984444, -0.0882670134305954, -0.1434834599494934, -0.13776691257953644, 0.19715070724487305, -0.11838918179273605, -0.1893460750579834, -0.16050685942173004, -0.038062263280153275, -0.12759678065776825, -0.19331131875514984, -0.038102492690086365, -0.1199285015463829, 0.1519993394613266, -0.1301194131374359, 0.06665413081645966, 0.1880338340997696, -0.093352310359478, 0.054753758013248444, 0.06943386793136597, -0.1794040948152542, -0.1236235648393631, -0.013571587391197681, 0.03278744965791702, 0.13992926478385925, 0.1178269237279892, 0.08835406601428986, -0.11079943925142288, 0.10998495668172836, -0.145232155919075, -0.20096874237060547, 0.1940058022737503, -0.02133842371404171, 0.03340456634759903, -0.26551249623298645, -0.01873502880334854, 2.188858707086183e-05, 0.18726392090320587, -0.06950604915618896, -0.10962025076150894, -0.13137201964855194, -0.11975277215242386, -0.281975656747818, 0.2661764323711395, 0.14869815111160278, 0.261989951133728, 0.08564107120037079, -0.2922915518283844, -0.25166893005371094, 0.14615248143672943, -0.008064346387982368, -0.006143394857645035, 0.03088073432445526, 0.27794569730758667, 0.01645049639046192, 0.0779687687754631, 0.077883780002594, -0.2045832872390747, -0.018389325588941574, 0.04771311581134796, -0.015457617118954659, 0.14473670721054077, -0.03932341933250427, -0.18484237790107727, -0.16781726479530334, 0.04143849387764931, -0.32925423979759216, 0.03905850276350975, -0.3366686701774597, 0.19992569088935852, 0.14335547387599945, 0.0699225515127182, 0.005047728307545185, -0.09251134097576141, -0.1056789830327034, 0.2666010856628418, 0.41812923550605774, -0.09318757802248001, 0.002301562810316682, -0.008106885477900505, -0.05833939462900162, -0.12125076353549957, -0.18299822509288788, -0.053817249834537506, -0.04116695001721382, -0.0679888129234314, -0.05430165305733681, 0.11820963025093079, 0.1278800517320633, -0.033608779311180115, -0.10603941231966019, -0.04018605127930641, -0.10652432590723038, 0.10530649125576019, -0.008659920655190945, -0.005265270359814167, -0.026462895795702934, 0.11839203536510468, 0.0949721485376358, 0.06069449707865715, -0.00012901534500997514, 0.2180517315864563, -0.07870635390281677, -0.20674748718738556, -0.15332885086536407, 0.000499857822433114, 0.07756638526916504, 0.05236072838306427, -0.13427606225013733, 0.07336094230413437, -0.10317802429199219, -0.05280882120132446, 0.08309672027826309, 0.10082846134901047, -0.27852296829223633, -0.055890802294015884, 0.07665844261646271, -0.04088272899389267, 0.003180769504979253, -0.14114244282245636, -0.011515200138092041, 0.1026136502623558, 0.06866905838251114, 0.17676667869091034, 0.2568114399909973, 0.1830122172832489, 0.21381214261054993, 0.05825437232851982, -0.07861077785491943, 0.012482569552958012, -0.04388997703790665, -0.13479846715927124, -0.21303091943264008, 0.11948896199464798, 0.19770649075508118, 0.09106384217739105, -0.12474355846643448, 0.20369310677051544, -0.10722088068723679, 0.23597076535224915, 0.1477886438369751, -0.020300060510635376, 0.0533670149743557, 0.02026626653969288, -0.028863221406936646, 0.09951020032167435, -0.0843256339430809, -0.22842197120189667, -0.1242806613445282, 0.09451509267091751, -0.14167317748069763, 0.08418261259794235, 0.05917198956012726, 0.35861366987228394, 0.14710038900375366, 0.004087124485522509, -0.0816834345459938, 0.257131963968277, -0.15024705231189728, -0.0849485993385315, -0.01465727761387825, 0.20366400480270386], [0.15234626829624176, 0.12896573543548584, 0.19339968264102936, -0.16008703410625458, 0.07191431522369385, -0.02620488777756691, -0.34372109174728394, -0.21263082325458527, 0.10935088992118835, 0.12566891312599182, 0.009769395925104618, -0.05937415733933449, 0.2726925313472748, -0.3054268956184387, 0.1153268963098526, -0.008788821287453175, 0.049604978412389755, 0.21591056883335114, 0.10084202885627747, 0.07873770594596863, -0.09544098377227783, -0.21720042824745178, 0.11956322938203812, -0.2192583531141281, -0.10636402666568756, -0.34942826628685, 0.18066169321537018, 0.17933247983455658, 0.0411146879196167, -0.08758636564016342, -0.2316879779100418, -0.15158110857009888, 0.16469676792621613, -0.031342290341854095, -0.015969138592481613, 0.006552852224558592, 0.1575353741645813, -0.00718584842979908, -0.051035597920417786, 0.22048437595367432, 0.4880988299846649, -0.26785752177238464, 0.059304431080818176, -0.03798140585422516, 0.08095481246709824, 0.0310374703258276, -0.04238692671060562, 0.3080849051475525, 0.23973962664604187, -0.1868882179260254, 0.018773576244711876, -0.21452882885932922, 0.032959066331386566, 0.04502978175878525, 0.056522078812122345, -0.21701186895370483, 0.26279106736183167, 0.040575288236141205, 0.08570580184459686, 0.15997058153152466, -0.0459524542093277, 0.1091146320104599, -0.12011541426181793, 0.5227132439613342, -0.32607078552246094, 0.20849287509918213, 0.11350531876087189, -0.011870828457176685, 0.01750035583972931, -0.019788097590208054, -0.260418176651001, 0.5080580115318298, -0.026253217831254005, -0.18236181139945984, 0.1510058045387268, 0.15663504600524902, 0.21503056585788727, -0.03441709652543068, 0.19951818883419037, 0.21082985401153564, -0.018822796642780304, 0.04215124249458313, 0.07389256358146667, -0.014946693554520607, -0.2704337537288666, 0.13222917914390564, 0.11381901800632477, -0.198285311460495, -0.1159060001373291, 0.16561439633369446, 0.14219655096530914, -0.04733271524310112, 0.11973430216312408, 0.05541407689452171, 0.021898968145251274, -0.12721998989582062, 0.09148833155632019, 0.04926212877035141, 0.053750090301036835, -0.008030864410102367, 0.041188787668943405, 0.07401174306869507, -0.13527853786945343, 0.23232115805149078, -0.07884517312049866, -0.044642992317676544, 0.06688801944255829, -0.14943517744541168, -0.361967533826828, -0.030221695080399513, -0.24422232806682587, 0.05576423928141594, -0.028013892471790314, 0.06716068089008331, 0.21735768020153046, -0.12107416987419128, 0.00846796203404665, 0.021037893369793892, -0.11577747017145157, -0.3188944458961487, 0.015896214172244072, 0.06186720356345177, 0.10330548137426376, 0.01330504473298788, -0.16304096579551697, 0.12530051171779633, -0.2499297857284546, 0.04226237162947655, -0.05380254238843918, 0.1903306543827057, -0.08215836435556412, -0.0351511612534523, -0.23199820518493652, 0.12116111069917679, -0.026169687509536743, 0.0643136277794838, 0.11540427058935165, 0.49255236983299255, 0.142105832695961, -0.25749534368515015, -0.022013692185282707, -0.364012748003006, -0.005218234844505787, -0.02589401789009571, 0.0155338728800416, -0.1900588423013687, -0.31932446360588074, -0.4092749059200287, -0.03261286020278931, -0.07185646891593933, 0.08942905813455582, -0.13016238808631897, 0.3229924738407135, -0.022291148081421852, -0.04450047388672829, 0.2728694975376129, 0.39814305305480957, 0.034077271819114685, -0.2919079065322876, -0.33412274718284607, -0.06803952902555466, 0.03886878862977028, 0.07363265007734299, -0.10496853291988373, -0.00599568011239171, 0.02238994836807251, 0.22222158312797546, -0.6995653510093689, -0.3852408230304718, -0.04327140375971794, 0.2715168297290802, -0.19766458868980408, 0.2803402245044708, 0.07704473286867142, 0.048291563987731934, 0.2978192865848541, 0.2755473256111145, -0.14556682109832764, 0.058152977377176285, -0.0945560559630394, -0.029629886150360107, -0.044150542467832565, 0.2965012490749359, 0.24128204584121704, -0.23165856301784515, -0.4003349840641022, -0.11191082000732422, -0.019877826794981956, -0.08595476299524307, -0.1486588418483734, 0.057828959077596664, 0.17767439782619476, -0.06868650764226913, 